Grasshopper.Getters.GH_PointGetter.GetPoint(System.String,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@)
Utility function for getting single points. This function properly  Handles Nothing results.
prompt: Prompt to display during GetPoint.
base_point: Base point for getter or Point3d.Unset for not base point.
out_point: Resulting point. Only filled out if return is GH_GetterResult.success
Returns: Result of operation.