Grasshopper.Kernel.GH_RenderArgs.#ctor(Rhino.RhinoDoc,Rhino.DocObjects.ViewportInfo,Rhino.Render.RenderPrimitiveList,System.Guid)
Create new render arguments.
doc: Rhino document.
vp: Viewport.
geometry: Geometry list.
id: Render plugin id.