Grasshopper.Kernel.GH_Convert.CommonObjectToByteArray(System.Int32,Rhino.Runtime.CommonObject)
Convert a RhinoCommon object into a compressed byte-array using
safe Rhino ?.0 OpenNurbs serialization.
data: Object to serialize.
Returns: A byte array representing the object or null on failure.