Grasshopper.GUI.GH_AsynchFileData.FilePath
Gets the location this class is watching.

Grasshopper.GUI.GH_AsynchFileData.#ctor(System.String,System.Boolean,Grasshopper.GUI.GH_AsynchFileData.FileChangedDelegate)
Asynchronous constructor. File properties will be loaded asychronously.
filePath: Location of file
thumbnail: If true, thumbnail data will be loaded.
callback: Callback delegate for file changes.

Grasshopper.GUI.GH_AsynchFileData.UpdatePropertiesAsynch
Updates all file properties on a low-priority background thread.

Grasshopper.GUI.GH_AsynchFileData.LocalUpdatePeriod
Specifies the number of milliseconds in between periodic checks for files on the local system.

Grasshopper.GUI.GH_AsynchFileData.RemoteUpdatePeriod
Specifies the number of milliseconds in between periodic checks for files on network drives.

Grasshopper.GUI.GH_AsynchFileData.DetermineUpdateFrequency
Set the update frequency based on the type of path.

Grasshopper.GUI.GH_AsynchFileData.StartPeriodicUpdate
Starts periodic updating (from now).

Grasshopper.GUI.GH_AsynchFileData.StopPeriodicUpdate
Stop any periodic updates.

Grasshopper.GUI.GH_AsynchFileData.Thumbnail
Gets or sets whether the thumbnail ought to be parsed.
At the moment this only makes sense for GH/GHX files.