Grasshopper.GUI.GH_AsynchFileData.FileData
Represents useful data about a file.

Grasshopper.GUI.GH_AsynchFileData.FileData.#ctor(System.String)
Create a new FileData instance.
uri: Path to examine.

Grasshopper.GUI.GH_AsynchFileData.FileData.Path
Gets the URI of this file.

Grasshopper.GUI.GH_AsynchFileData.FileData.Exists
Gets whether this file exists at all.

Grasshopper.GUI.GH_AsynchFileData.FileData.Size
Gets the file byte-size.
Returns:

Grasshopper.GUI.GH_AsynchFileData.FileData.DateCreated
Gets or sets the creation date for this file.

Grasshopper.GUI.GH_AsynchFileData.FileData.DateChanged
Gets or sets the most recently changed date for this file.