Grasshopper.Kernel.GH_DocumentObject.RecordUndoEvent(System.String)
Record a generic object change undo event.
name: Name of undo record.
Returns: The ID of the newly added record or Guid.Empty on failure.

Grasshopper.Kernel.GH_DocumentObject.RecordUndoEvent(System.String,Grasshopper.Kernel.Undo.IGH_UndoAction)
Record a specific object change undo event.
name: Name of undo record.
action: Undo action to record.
Returns: The ID of the newly added record or Guid.Empty on failure.

Grasshopper.Kernel.GH_DocumentObject.SetIconOverride(System.Drawing.Bitmap)
Set a new custom icon override for this object.
custom_icon: Icon override. Should be a 24x24 image.

Grasshopper.Kernel.GH_DocumentObject.GetValue(System.String,System.Boolean)
Get a boolean value from the component value table.
name: Name of boolean to retrieve.
default: Default value to return in case of missing named value.
Returns: The boolean value with the given name of the default value.

Grasshopper.Kernel.GH_DocumentObject.GetValue(System.String,System.Int32)
Get an integer value from the component value table.
name: Name of integer to retrieve.
default: Default value to return in case of missing named value.
Returns: The integer value with the given name of the default value.

Grasshopper.Kernel.GH_DocumentObject.GetValue(System.String,System.Double)
Get a double value from the component value table.
name: Name of double to retrieve.
default: Default value to return in case of missing named value.
Returns: The double value with the given name of the default value.

Grasshopper.Kernel.GH_DocumentObject.GetValue(System.String,System.String)
Get a string value from the component value table.
name: Name of string to retrieve.
default: Default value to return in case of missing named value.
Returns: The string value with the given name of the default value.

Grasshopper.Kernel.GH_DocumentObject.GetValue(System.String,System.Drawing.Color)
Get a color value from the component value table.
name: Name of color to retrieve.
default: Default value to return in case of missing named value.
Returns: The color value with the given name of the default value.

Grasshopper.Kernel.GH_DocumentObject.SetValue(System.String,System.Boolean)
Set a named value. This value will be serialized with the component.
name: Name of value.
value: Value itself.

Grasshopper.Kernel.GH_DocumentObject.SetValue(System.String,System.Int32)
Set a named value. This value will be serialized with the component.
name: Name of value.
value: Value itself.

Grasshopper.Kernel.GH_DocumentObject.SetValue(System.String,System.Double)
Set a named value. This value will be serialized with the component.
name: Name of value.
value: Value itself.

Grasshopper.Kernel.GH_DocumentObject.SetValue(System.String,System.String)
Set a named value. This value will be serialized with the component.
name: Name of value.
value: Value itself.

Grasshopper.Kernel.GH_DocumentObject.SetValue(System.String,System.Drawing.Color)
Set a named value. This value will be serialized with the component.
name: Name of value.
value: Value itself.