Grasshopper.GUI.GH_MenuTextBox.TextChanged
Raised whenever the text in the textbox changes.
sender: Control raising the event.
text: New text

Grasshopper.GUI.GH_MenuTextBox.#ctor(System.Windows.Forms.ToolStripDropDown,System.String,System.Boolean)
Constructor for TextBox collection.
nDropDown: The menu dropdown into which to embed this textbox control.
nText: The original text to be displayed in the textbox.
bLockFocus: If True, the control will disable the other menu items when it gets focus.