Grasshopper.Kernel.GH_ComponentServer.LoadExternalFiles(System.Collections.Generic.List{Grasshopper.Kernel.GH_ExternalFile})
Load Grasshopper.dll and all provided external files.

Grasshopper.Kernel.GH_ComponentServer.LoadExternalFile(Grasshopper.Kernel.GH_ExternalFile)
Load a GHA, GHUSER or GHCLUSTER file.

Grasshopper.Kernel.GH_ComponentServer.ConflictSolutionPrompt(Grasshopper.Kernel.IGH_ObjectProxy,Grasshopper.Kernel.IGH_ObjectProxy,Grasshopper.Kernel.GH_GuidConflictSolution@)
Displays the GUID conflict dialog for types A and B.
A: The resident instance.
B: The conflicting instance.
solution: the current solution value. If solution equals ReplaceAll or SkipAll the dialog is not displayed.

Grasshopper.Kernel.GH_ComponentServer.FindObjects(System.String[],System.Int32)
Searches the list of cached object proxies for objects that might be implied by a search term.
terms: Search terms to use.
max_hits: Maximum number of allowed hits.
Returns: A sorted list of search results.