Grasshopper.Kernel.GH_Document.ReadObjectList(GH_IO.Serialization.GH_IReader,System.String,System.Collections.Generic.List{Grasshopper.Kernel.GH_Document.LibraryInfo})
Deserialize a list of IGH_DocumentObjects

Grasshopper.Kernel.GH_Document.ReadLibraryList(GH_IO.Serialization.GH_IReader)
Read all library data and display a message when a library is not loaded.
reader: Reader object to read from.

Grasshopper.Kernel.GH_Document.FindAttribute(System.Drawing.PointF,System.Boolean)
Search for attributes that contain a certain point. The attribute balloon boxes
are also taken into account.
pt: The point in Canvas coordinates
topLevelOnly: If true, child attributes will be skipped.

Grasshopper.Kernel.GH_Document.DefaultMeshingParameters
Defines the default Grasshopper meshing parameters for fast and dirty meshing.

Grasshopper.Kernel.GH_Document.IsPreviewViewport(Rhino.RhinoDoc,Rhino.Display.RhinoViewport,Rhino.Display.DisplayPipeline)
Validate a viewport to see if we should be drawing previews into it.
vp: Viewport.
doc: Document associated with viewport.
Returns: True if previews ought to be drawn into this viewport.