Grasshopper.Kernel.IGH_DocumentObject.RecordUndoEvent(System.String)
Record a generic object change undo event.
name: Name of undo record.

Grasshopper.Kernel.IGH_DocumentObject.RecordUndoEvent(System.String,Grasshopper.Kernel.Undo.IGH_UndoAction)
Record a specific object change undo event.
name: Name of undo record.
action: Undo action to record.