Grasshopper.Kernel.Special.GH_Timer.Interval
Gets or sets the interval (in milliseconds between timer ticks)

Grasshopper.Kernel.Special.GH_Timer.CleanTargetList
Remove all targets which have been orphaned or translocated.