Grasshopper.Kernel.Data.GH_Lexer.m_mask
Mask string

Grasshopper.Kernel.Data.GH_Lexer.m_path
Contains all the elements in the mask string. This list is created lazily.

Grasshopper.Kernel.Data.GH_Lexer.m_item
Contains the item element in the mask string. This is created lazily.

Grasshopper.Kernel.Data.GH_Lexer.#ctor(System.String)
Create a new mask from a textual string.
M: Mask string.

Grasshopper.Kernel.Data.GH_Lexer.ParseMask
Parse the current mask string.