Rhino.Render.ChangeQueue.Mesh.GetMeshes
Get a SimpleArrayMeshPointer containing all meshes for the related Mesh
Returns:

Rhino.Render.ChangeQueue.Mesh.Id
Get the Object Guid this mesh is for.
Returns: Guid of parent object.

Rhino.Render.ChangeQueue.Mesh.SingleMapping
Get texture mapping info as single mapping

Rhino.Render.ChangeQueue.Mesh.Mapping
Get the mapping for this mesh.

Rhino.Render.ChangeQueue.Mesh.Attributes
Get object attributes of object associated to this mesh. This will be possible only
after returning true from ChangeQueue.ProvideOriginalObject()