Rhino.Render.TimeZone.Name
Gets name of a time zone.

Rhino.Render.TimeZone.Hours
Gets hours of a time zone.

Rhino.Render.TimeZone.TimeZones
Returns number of available time zones.
Returns: Time zone count.

Rhino.Render.TimeZone.TimeZoneAt(System.Int32)
Returns a time zone at given index.
index: index.
Returns: Time zone at index.