Rhino.Render.ChangeQueue.DisplayRenderSettings.CullBackFaces
True if backfaces should be culled

Rhino.Render.ChangeQueue.DisplayRenderSettings.ForceFlatShading
True if flat shading is forced

Rhino.Render.ChangeQueue.DisplayRenderSettings.SceneLightingOn
True if scene lighting is enabled