Rhino.Geometry.SubDOperations.SplitEdgeCS(Rhino.Geometry.SubD,Rhino.Geometry.SubDEdgePtr,Rhino.Geometry.Point3d)
Splits an edge by inserting a vertex at a given location.
The new edge is placed on the edge.VertexTo side.
The old edge is kept unchanged, except it is now followed by the new one.
subd:
edge:
location:
Returns:

Rhino.Geometry.SubDOperations.RestoreBackwardConnections(Rhino.Geometry.SubD)
Searches and reassigns all backward-connections that are needed in a SubD.
If we imagine the SubD data structure as a connection known at creation time as
V < E < F, then all connections that are backwards are "decorations" we can
recreate when we are done modifying the SubD.
This means V > F, V > E and E > F will be recomputed by this method.
subd: The SubD to recompute.