Rhino.PlugIns.PlugInInfo.Id
Returns the plug-in's Id.

Rhino.PlugIns.PlugInInfo.RegistryPath
Returns the plug-in's Windows Registry path.

Rhino.PlugIns.PlugInInfo.Name
Returns the plug-in's name.

Rhino.PlugIns.PlugInInfo.Description
Returns the plug-in's description.

Rhino.PlugIns.PlugInInfo.Icon(System.Drawing.Size)
Returns the plug-in's icon in bitmap form.

Rhino.PlugIns.PlugInInfo.FileName
Returns the plug-in's file name.

Rhino.PlugIns.PlugInInfo.Version
Returns the plug-in's version.

Rhino.PlugIns.PlugInInfo.Organization
Returns the organization or company that created the plug-in.

Rhino.PlugIns.PlugInInfo.Address
Returns the address of the organization or company that created the plug-in.

Rhino.PlugIns.PlugInInfo.Country
Returns the country of the organization or company that created the plug-in.

Rhino.PlugIns.PlugInInfo.Email
Returns the email address of the organization or company that created the plug-in.

Rhino.PlugIns.PlugInInfo.Phone
Returns the phone number of the organization or company that created the plug-in.

Rhino.PlugIns.PlugInInfo.Fax
Returns the fax number of the organization or company that created the plug-in.

Rhino.PlugIns.PlugInInfo.WebSite
Returns the web site, or url, of the organization or company that created the plug-in.

Rhino.PlugIns.PlugInInfo.UpdateUrl
Returns the web site, or url, were an updated version of the plug-in can be found.

Rhino.PlugIns.PlugInInfo.PlugInType
Returns the plug-in type.

Rhino.PlugIns.PlugInInfo.PlugInLoadTime
Returns the plug-in's load time.

Rhino.PlugIns.PlugInInfo.IsLoaded
Returns true if the plug-in is loaded, false otherwise.

Rhino.PlugIns.PlugInInfo.IsLoadProtected(System.Boolean@)
Returns the load protection state for a plug-in
loadSilently: The plug-in's load silently state.
Returns: true if the plug-in is load protected, false otherwise.

Rhino.PlugIns.PlugInInfo.ShipsWithRhino
Returns true if the plug-in ships with Rhino, false otherwise.

Rhino.PlugIns.PlugInInfo.IsDotNet
Returns true if the plug-in is based on .NET, false otherwise.

Rhino.PlugIns.PlugInInfo.CommandNames
Returns a plug-in's English command names.

Rhino.PlugIns.PlugInInfo.FileTypeDescriptions
Returns the description of supported file types for file import and file export plug-in.