Rhino.DocObjects.ObjectAttributes.Transform(Rhino.Geometry.Transform)
Apply a transformation.
xform: The transformation.
Returns: trueif successful, false otherwise.

Rhino.DocObjects.ObjectAttributes.Visible
Gets or sets an object's visiblity.

Rhino.DocObjects.ObjectAttributes.CastsShadows
Gets or sets an object's casts shadows property, or whether or not an object casts shadows on other objects and a ground plane.

Rhino.DocObjects.ObjectAttributes.ReceivesShadows
Gets or sets an object's receives shadows property, or whether or not an object receives shadows from other objects.

Rhino.DocObjects.ObjectAttributes.Decals
Gets all object decals associated with this object.

Rhino.DocObjects.ObjectAttributes.MaterialRefs
If you are developing a high quality plug-in renderer, and a user is
assigning a custom render material to this object, then add rendering
material information to the MaterialRefs dictionary.
Note to developers:
As soon as the MaterialRefs dictionary contains items rendering
material queries slow down.  Do not populate the MaterialRefs
dictionary when setting the MaterialIndex will take care of your needs.

Rhino.DocObjects.ObjectAttributes.HasMapping
A mapping from any plugin source is associated with these attributes
Need to do this here to respond correctly to ModifyObjectAttributes event

Rhino.DocObjects.ObjectAttributes.DisplayOrder
Display order used to force objects to be drawn on top or behind each other.
Larger numbers draw on top of smaller numbers.
0  = draw object in standard depth buffered order
<0 = draw object behind "normal" draw order objects
>0 = draw object on top of "normal" draw order objects

Rhino.DocObjects.ObjectAttributes.GetGroupList
Returns an array of GroupCount group indices.  If GroupCount is zero, then GetGroupList() returns null.
Returns: An array of group indices. null might be returned in place of an empty array.

Rhino.DocObjects.ObjectAttributes.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key. If null, the key will be removed
Returns: true on success.