Rhino.Input.Custom.GetLine.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Input.Custom.GetLine.Get(Rhino.Geometry.Line@)
Perform the 'get' operation.
line:
Returns:

Rhino.Input.Custom.GetLine.FirstPointPrompt
Prompt when getting first point

Rhino.Input.Custom.GetLine.MidPointPrompt
Prompt when getting midpoint

Rhino.Input.Custom.GetLine.SecondPointPrompt
Prompt when getting second point

Rhino.Input.Custom.GetLine.AcceptZeroLengthLine
Controls whether or not a zero length line is acceptable.
The default is to require the user to keep picking the end
point until we get a point different than the start point.

Rhino.Input.Custom.GetLine.HaveFeedbackColor
If true, the feedback color is used to draw the dynamic
line when the second point is begin picked.  If false,
the active layer color is used.

Rhino.Input.Custom.GetLine.FeedbackColor
If set, the feedback color is used to draw the dynamic
line when the second point is begin picked.  If not set,
the active layer color is used.

Rhino.Input.Custom.GetLine.FixedLength
If FixedLength > 0, the line must have the specified length

Rhino.Input.Custom.GetLine.EnableFromBothSidesOption(System.Boolean)
If true, then the "BothSides" option shows up when the
start point is inteactively picked.
on:

Rhino.Input.Custom.GetLine.EnableFromMidPointOption(System.Boolean)
If true, the the "MidPoint" options shows up
on:

Rhino.Input.Custom.GetLine.EnableAllVariations(System.Boolean)
If true, then all line variations are shown if the default line mode is used
on:

Rhino.Input.Custom.GetLine.SetFirstPoint(Rhino.Geometry.Point3d)
Use SetFirstPoint to specify the line's starting point and skip
the start point interactive picking
point:

Rhino.Input.Custom.GetLine.GetLineMode
Mode used