Rhino.Geometry.MeshPart.StartVertexIndex
Start of subinterval of parent mesh vertex array

Rhino.Geometry.MeshPart.EndVertexIndex
End of subinterval of parent mesh vertex array

Rhino.Geometry.MeshPart.StartFaceIndex
Start of subinterval of parent mesh face array

Rhino.Geometry.MeshPart.EndFaceIndex
End of subinterval of parent mesh face array

Rhino.Geometry.MeshPart.VertexCount
EndVertexIndex - StartVertexIndex

Rhino.Geometry.MeshPart.TriangleCount
