Rhino.Geometry.Collections.MeshVertexList.Capacity
Gets or sets the total number of vertices the internal data structure can hold without resizing.

Rhino.Geometry.Collections.MeshVertexList.Clear
Clears the Vertex list on the mesh.

Rhino.Geometry.Collections.MeshVertexList.Destroy
Releases all memory allocated to store faces. The list capacity will be 0 after this call.
Subsequent calls can add new items.

Rhino.Geometry.Collections.MeshVertexList.Align(System.Double,System.Collections.Generic.IEnumerable{System.Boolean})
Moves mesh vertices that belong to naked edges to neighboring vertices, within the specified distance.
This forces unaligned mesh vertices to the same location and is helpful to clean meshes for 3D printing.
See the _AlignMeshVertices Rhino command for more information.
distance: Distance that should not be exceed when modifying the mesh.
whichVertices: If not null, defines which vertices should be considered for adjustment.
Returns: If the operation succeeded, the number of moved vertices, or -1 on error.

Rhino.Geometry.Collections.MeshVertexList.ToFloatArray
Copies all vertices to a linear array of float in x,y,z order
Returns: The float array.