Rhino.Geometry.Leader.#ctor
Constructor

Rhino.Geometry.Leader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[])
Creates a Leader geometry object
richText:
plane:
dimstyle:
points:
Returns:

Rhino.Geometry.Leader.Curve
Gets the curve used by this leader

Rhino.Geometry.Leader.Points2D
Get or set the 2d points defining the curve used by this leader

Rhino.Geometry.Leader.Points3D
Get or set the 3d points defining the curve used by this leader

Rhino.Geometry.Leader.LeaderTextHorizontalAlignment
Gets or sets the horizontal alignment of the leader's text

Rhino.Geometry.Leader.LeaderTextVerticalAlignment
Gets or sets the vertical alignment of the leader's text

Rhino.Geometry.Leader.LeaderArrowType
The arrowhead type for the leader

Rhino.Geometry.Leader.LeaderArrowBlockId
Id of the block used as the arrow for the leader when the arrow type is 'User arrow'

Rhino.Geometry.Leader.LeaderArrowSize
The size of the leader arrow

Rhino.Geometry.Leader.LeaderCurveStyle
The style of the leader curve: polyline or spline

Rhino.Geometry.Leader.LeaderContentAngleStyle
Angle for text of leader text

Rhino.Geometry.Leader.LeaderHasLanding
Returns true if the leader has a landing line

Rhino.Geometry.Leader.LeaderLandingLength
Gets or sets the length of the landing line