Rhino.DocObjects.Tables.ViewTable.IsCameraIconVisible(Rhino.Display.RhinoView)
Determine if a camera icon is being shown
view:
if null, then all views are tested. If not null, then just view is tested.
Returns:

Rhino.DocObjects.Tables.ViewTable.EnableCameraIcon(Rhino.Display.RhinoView)
Use to turn camera icon on and off
view:
If null, any camera icon is turned off. If not null, the camera icon for that
view is turned on.

Rhino.DocObjects.Tables.ViewTable.Redraw
Redraws all views.
Remarks:
If you change something in the document -- like adding objects,
deleting objects, modifying layer or object display attributes, etc.,
then you need to call Redraw to redraw all the views.
If you change something in a particular view like the projection,
construction plane, background bitmap, etc., then you need to
call CRhinoView::Redraw to redraw that particular view.