Rhino.Geometry.SubD.SubDEdgeTag
SubD::EdgeTag identifies the type of subdivision edge.  Different tags use
different subdivision algorithms to determine where the subdivision point is located.

Rhino.Geometry.SubD.SubDEdgeTag.Unset
Not a valid edge tag and the default value for ON_SubDEdge::m_edge_tag.
This encourages developers to thoughtfully initialize ON_SubDEdge::m_edge_tag.

Rhino.Geometry.SubD.SubDEdgeTag.Smooth
One or two of the edge's vertices must be tagged as ON_SubD::VertexTag::Smooth.
The edge must have exactly two faces.

Rhino.Geometry.SubD.SubDEdgeTag.Crease
Both of the edge's vertices must be tagged as not ON_SubD::VertexTag::Smooth.
The edge can have any number of faces.

Rhino.Geometry.SubD.SubDEdgeTag.Sharp
Reserved for version 2 of the ON_SubD project.
Currently this tag is not used and is invalid.
FUTURE: The edge is a "soft crease" or "semi-sharp".
At lease one end vertex must be tagged as ON_SubD::VertexTag::Smooth
The edge must have exactly two faces.
The value of ON_SubDEdge::m_sharpness controls how
soft/hard the edge appears.
ON_SubDEdge::m_sharpness = 0 is identical to ON_SubD::EdgeTag::Smooth.
ON_SubDEdge::m_sharpness = 1 is identical to ON_SubD::EdgeTag::Crease.

Rhino.Geometry.SubD.SubDEdgeTag.X
This tag appears only on edges that have exactly two neighboring faces
and no end vertices are tagged as ON_SubD::VertexTag::Smooth.
The subdivision point for this edge is its midpoint.
When subdivided, the subdivided midpoint vertex will be tagged
as ON_SubD::VertexTag::Smooth and the subdivided edges will
be tagged as ON_SubD::EdgeTag::Smooth.
This tag is used at because the ON_SubD subdivision
algorithm requires any edge with both end vertices
tagged as not smooth must be subdivided at its midpoint.
Sector iterators treat "X" edges as smooth.
Both edge end weights must be set so the smooth
subdivided edges will be valid.