Rhino.Geometry.BrepEdge.TrimIndices
Gets the indices of all trims associated with this edge.
Returns: Empty array on failure.

Rhino.Geometry.BrepEdge.GetEdgeParameter(System.Int32,System.Double,System.Double@)
Get corresponding edge parameter for given trim at given trim parameter.
trimIndex:
trimParameter:
edgeParameter:
Returns: true on success

Rhino.Geometry.BrepEdge.EdgeCurveIndex
Get the brep.Curves3D[] index of the 3d curve geometry used by this edge or -1.

Rhino.Geometry.BrepEdge.EdgeCurve
Get the brep.Curves3D[] 3d curve geometry used by this edge or null.

Rhino.Geometry.BrepEdge.SetEdgeCurve(System.Int32)
Set 3d curve geometry used by a b-rep edge.
curve3dIndex: index of 3d curve in m_C3[] array
Returns: true if successful

Rhino.Geometry.BrepEdge.SetEdgeCurve(System.Int32,Rhino.Geometry.Interval)
Set 3d curve geometry used by a b-rep edge.
curve3dIndex: index of 3d curve in m_C3[] array
subDomain:
Returns: true if successful

Rhino.Geometry.BrepEdge.StartVertex
BrepVertex at start of edge

Rhino.Geometry.BrepEdge.EndVertex
BrepVertex at end of edge