Rhino.Geometry.Line.TryCreateBetweenCurves(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double@,System.Double@,System.Boolean,System.Boolean,Rhino.Geometry.Line@)
Creates a line segment between a pair of curves such that the line segment is either tangent or perpendicular to each of the curves.
curve0: The first curve.
curve1: The second curve.
t0: Parameter value of point on curve0. Seed value at input and solution at output.
t1: Parameter value of point on curve 0.  Seed value at input and solution at output.
perpendicular0: Find line Perpendicuar to (true) or tangent to (false) curve0.
perpendicular1: Find line Perpendicuar to (true) or tangent to (false) curve1.
line: The line segment if successful.
Returns: true on success, false on failure.

Rhino.Geometry.Line.EpsilonEquals(Rhino.Geometry.Line,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:

Rhino.Geometry.Line.PointAtLength(System.Double)
Computes a point located at a specific metric distance from the line origin (Rhino.Geometry.Line.From).
If line start and end coincide, then the start point is always returned.
distance: A positive, 0, or a negative value that will be the distance from Rhino.Geometry.Line.From.
Returns: The newly found point.