Rhino.Geometry.Sphere.EquatorialPlane
Gets or sets the Equatorial plane for this sphere.

Rhino.Geometry.Sphere.EpsilonEquals(Rhino.Geometry.Sphere,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns: