Rhino.Geometry.PolylineCurve.Parameter(System.Int32)
Gets a parameter at a specified index in the polyline curve.
index: An index.
Returns: A parameter.

Rhino.Geometry.PolylineCurve.SetParameter(System.Int32,System.Double)
Sets a parameter at a specified index in the polyline curve.
index: An index.
parameter: A parameter to set.

Rhino.Geometry.PolylineCurve.ToPolyline
Returns the underlying Polyline, or points.
Returns: The Polyline if successful, null of the curve has no points.