Rhino.Geometry.MeshRefinements.RefinementSettings.#ctor
Creates a default operation settings object.

Rhino.Geometry.MeshRefinements.RefinementSettings.Level
The level of subdivision to achieve.

Rhino.Geometry.MeshRefinements.RefinementSettings.HasPull
Gets a value indicating whether this subdivision should create a result on a specific surface.

Rhino.Geometry.MeshRefinements.RefinementSettings.ContinueRequest
A token to request computation termination.

Rhino.Geometry.MeshRefinements.RefinementSettings.NakedEdgeMode
Set this property to define how naked edges should be treated.