Rhino.Geometry.Curve.GetConicSectionType
Returns the type of conic section based on the curve's shape.
Returns:

Rhino.Geometry.Curve.GetConicSectionType(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Returns the type of conic section based on the curve's shape.
focus1: The first focus point, if applicable.
focus2: The second focus point, if applicable.
center: The center point, if applicable.
Returns:

Rhino.Geometry.Curve.CreateSoftEditCurve(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Vector3d,System.Double,System.Boolean)
Creates a soft edited curve from an exising curve using a smooth field of influence.
curve: The curve to soft edit.
t:
A parameter on the curve to move from. This location on the curve is moved, and the move
is smoothly tapered off with increasing distance along the curve from this parameter.
delta: The direction and magitude, or maximum distance, of the move.
length:
The distance along the curve from the editing point over which the strength
of the editing falls off smoothly.
fixEnds:
Returns: The soft edited curve if successful. null on failure.

Rhino.Geometry.Curve.CreateFilletCornersCurve(Rhino.Geometry.Curve,System.Double,System.Double,System.Double)
Rounds the corners of a kinked curve with arcs of a single, specified radius.
curve: The curve to fillet.
radius: The fillet radius.
tolerance: The tolerance. When in doubt, use the document's model space absolute tolerance.
angleTolerance: The angle tolerance in radians. When in doubt, use the document's model space angle tolerance.
Returns: The filleted curve if successful. null on failure.

Rhino.Geometry.Curve.CreateBlendCurve(Rhino.Geometry.Curve,System.Double,System.Boolean,Rhino.Geometry.BlendContinuity,Rhino.Geometry.Curve,System.Double,System.Boolean,Rhino.Geometry.BlendContinuity)
Makes a curve blend between 2 curves at the parameters specified
with the directions and continuities specified
curve0: First curve to blend from
t0: Parameter on first curve for blend endpoint
reverse0:
If false, the blend will go in the natural direction of the curve.
If true, the blend will go in the opposite direction to the curve
continuity0: Continuity for the blend at the start
curve1: Second curve to blend from
t1: Parameter on second curve for blend endpoint
reverse1:
If false, the blend will go in the natural direction of the curve.
If true, the blend will go in the opposite direction to the curve
continuity1: Continuity for the blend at the end
Returns: The blend curve on success. null on failure

Rhino.Geometry.Curve.CreateTweenCurves(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32)
Creates curves between two open or closed input curves. Uses the control points of the curves for finding tween curves.
That means the first control point of first curve is matched to first control point of the second curve and so on.
There is no matching of curves direction. Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
Returns: An array of joint curves. This array can be empty.

Rhino.Geometry.Curve.CreateTweenCurves(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32,System.Double)
Creates curves between two open or closed input curves. Uses the control points of the curves for finding tween curves.
That means the first control point of first curve is matched to first control point of the second curve and so on.
There is no matching of curves direction. Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
tolerance:
Returns: An array of joint curves. This array can be empty.

Rhino.Geometry.Curve.CreateTweenCurvesWithMatching(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32)
Creates curves between two open or closed input curves. Make the structure of input curves compatible if needed.
Refits the input curves to have the same structure. The resulting curves are usually more complex than input unless
input curves are compatible and no refit is needed. There is no matching of curves direction.
Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
Returns: An array of joint curves. This array can be empty.

Rhino.Geometry.Curve.CreateTweenCurvesWithMatching(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32,System.Double)
Creates curves between two open or closed input curves. Make the structure of input curves compatible if needed.
Refits the input curves to have the same structure. The resulting curves are usually more complex than input unless
input curves are compatible and no refit is needed. There is no matching of curves direction.
Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
tolerance:
Returns: An array of joint curves. This array can be empty.

Rhino.Geometry.Curve.CreateTweenCurvesWithSampling(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32,System.Int32)
Creates curves between two open or closed input curves. Use sample points method to make curves compatible.
This is how the algorithm workd: Divides the two curves into an equal number of points, finds the midpoint between the
corresponding points on the curves and interpolates the tween curve through those points. There is no matching of curves
direction. Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
numSamples: Number of sample points along input curves.
Returns: >An array of joint curves. This array can be empty.

Rhino.Geometry.Curve.CreateTweenCurvesWithSampling(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32,System.Int32,System.Double)
Creates curves between two open or closed input curves. Use sample points method to make curves compatible.
This is how the algorithm workd: Divides the two curves into an equal number of points, finds the midpoint between the
corresponding points on the curves and interpolates the tween curve through those points. There is no matching of curves
direction. Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
numSamples: Number of sample points along input curves.
tolerance:
Returns: >An array of joint curves. This array can be empty.

Rhino.Geometry.Curve.CreateFilletCurves(Rhino.Geometry.Curve,Rhino.Geometry.Point3d,Rhino.Geometry.Curve,Rhino.Geometry.Point3d,System.Double,System.Boolean,System.Boolean,System.Boolean,System.Double,System.Double)
Creates a tangent arc between two curves and trims or extends the curves to the arc.
curve0: The first curve to fillet.
point0:
A point on the first curve that is near the end where the fillet will
be created.
curve1: The second curve to fillet.
point1:
A point on the second curve that is near the end where the fillet will
be created.
radius: The radius of the fillet.
join: Join the output curves.
trim:
Trim copies of the input curves to the output fillet curve.
arcExtension:
Applies when arcs are filleted but need to be extended to meet the
fillet curve or chamfer line. If true, then the arc is extended
maintaining its validity. If false, then the arc is extended with a
line segment, which is joined to the arc converting it to a polycurve.
tolerance:
The tolerance, generally the document's absolute tolerance.
angleTolerance:
Returns:
The results of the fillet operation. The number of output curves depends
on the input curves and the values of the parameters that were used
during the fillet operation. In most cases, the output array will contain
either one or three curves, although two curves can be returned if the
radius is zero and join = false.
For example, if both join and trim = true, then the output curve
will be a polycurve containing the fillet curve joined with trimmed copies
of the input curves. If join = false and trim = true, then three curves,
the fillet curve and trimmed copies of the input curves, will be returned.
If both join and trim = false, then just the fillet curve is returned.

Rhino.Geometry.Curve.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Calculates the boolean union of two or more closed, planar curves.
Note, curves must be co-planar.
curves: The co-planar curves to union.
tolerance:
Returns: Result curves on success, empty array if no union could be calculated.

Rhino.Geometry.Curve.CreateBooleanIntersection(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)
Calculates the boolean intersection of two closed, planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
curveB: The second closed, planar curve.
tolerance:
Returns: Result curves on success, empty array if no intersection could be calculated.

Rhino.Geometry.Curve.CreateBooleanDifference(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)
Calculates the boolean difference between two closed, planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
curveB: The second closed, planar curve.
tolerance:
Returns: Result curves on success, empty array if no difference could be calculated.

Rhino.Geometry.Curve.CreateBooleanDifference(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Calculates the boolean difference between a closed planar curve, and a list of closed planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
subtractors: curves to subtract from the first closed curve.
tolerance:
Returns: Result curves on success, empty array if no difference could be calculated.

Rhino.Geometry.Curve.CreateTextOutlines(System.String,System.String,System.Double,System.Int32,System.Boolean,Rhino.Geometry.Plane,System.Double,System.Double)
Creates outline curves created from a text string. The functionality is similar to what you find in Rhino's TextObject command or TextEntity.Explode() in RhinoCommon.
text: The text from which to create outline curves.
font: The text font.
textHeight: The text height.
textStyle: The font style. The font style can be any number of the following: 0 - Normal, 1 - Bold, 2 - Italic
closeLoops: Set this value to True when dealing with normal fonts and when you expect closed loops. You may want to set this to False when specifying a single-stroke font where you don't want closed loops.
plane: The plane on which the outline curves will lie.
smallCapsScale: Displays lower-case letters as small caps. Set the relative text size to a percentage of the normal text.
tolerance: The tolerance for the operation.
Returns: An array containing one or more curves if successful.

Rhino.Geometry.Curve.CreateCurve2View(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Double,System.Double)
Creates a third curve from two curves that are planar in different construction planes.
The new curve looks the same as each of the original curves when viewed in each plane.
curveA: The first curve.
curveB: The second curve.
vectorA: A vector defining the normal direction of the plane which the first curve is drawn upon.
vectorB: A vector defining the normal direction of the plane which the seconf curve is drawn upon.
tolerance: The tolerance for the operation.
angleTolerance: The angle tolerance for the operation.
Returns: An array containing one or more curves if successful.

Rhino.Geometry.Curve.GetDistancesBetweenCurves(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)
Computes the distances between two arbitrary curves that overlap.
curveA: A curve.
curveB: Another curve.
tolerance: A tolerance value.
maxDistance: The maximum distance value. This is an out reference argument.
maxDistanceParameterA: The maximum distance parameter on curve A. This is an out reference argument.
maxDistanceParameterB: The maximum distance parameter on curve B. This is an out reference argument.
minDistance: The minimum distance value. This is an out reference argument.
minDistanceParameterA: The minimum distance parameter on curve A. This is an out reference argument.
minDistanceParameterB: The minimum distance parameter on curve B. This is an out reference argument.
Returns: true if the operation succeeded; otherwise false.

Rhino.Geometry.Curve.PlanarCurveCollision(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Plane,System.Double)
Determines if two coplanar curves collide (intersect).
curveA: A curve.
curveB: Another curve.
testPlane: A valid plane containing the curves.
tolerance: A tolerance value for intersection.
Returns: true if the curves intersect, otherwise false

Rhino.Geometry.Curve.DuplicateSegments
Polylines will be exploded into line segments. ExplodeCurves will
return the curves in topological order.
Returns:
An array of all the segments that make up this curve.

Rhino.Geometry.Curve.ClosedCurveOrientation
Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in the world xy plane.
Only works with simple (no self intersections) closed, planar curves.
Returns: The orientation of this curve with respect to world xy plane.

Rhino.Geometry.Curve.ClosedCurveOrientation(Rhino.Geometry.Vector3d)
Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in a given plane.
Only works with simple (no self intersections) closed, planar curves.
upDirection: A vector that is considered "up".
Returns: The orientation of this curve with respect to a defined up direction.

Rhino.Geometry.Curve.ClosedCurveOrientation(Rhino.Geometry.Plane)
Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in a given plane.
Only works with simple (no self intersections) closed, planar curves.
plane:
The plane in which to solve the orientation.
Returns: The orientation of this curve in the given plane.

Rhino.Geometry.Curve.ClosedCurveOrientation(Rhino.Geometry.Transform)
Determines the orientation (counterclockwise or clockwise) of a closed, planar curve.
Only works with simple (no self intersections) closed, planar curves.
xform:
Transformation to map the curve to the world xy plane.
Returns: The orientation of this curve in the world xy-plane.

Rhino.Geometry.Curve.ClosestPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,System.Int32@,System.Double)
Finds the object (and the closest point in that object) that is closest to
this curve. Breps, surfaces,
curves and point clouds are examples of
objects that can be passed to this function.
geometry: A list, an array or any enumerable set of geometry to search.
pointOnCurve: The point on curve. This out parameter is assigned during this call.
pointOnObject: The point on geometry. This out parameter is assigned during this call.
whichGeometry: The index of the geometry. This out parameter is assigned during this call.
maximumDistance: Maximum allowable distance. Past this distance, the research is given up and false is returned.
Returns: true on success; false if no object was found or selected.
Throws System.ArgumentNullException: If geometry is null.

Rhino.Geometry.Curve.ClosestPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,System.Int32@)
Finds the object (and the closest point in that object) that is closest to
this curve. Breps, surfaces,
curves and point clouds are examples of
objects that can be passed to this function.
geometry: A list, an array or any enumerable set of geometry to search.
pointOnCurve: The point on curve. This out parameter is assigned during this call.
pointOnObject: The point on geometry. This out parameter is assigned during this call.
whichGeometry: The index of the geometry. This out parameter is assigned during this call.
Returns: true on success; false if no object was found or selected.
Throws System.ArgumentNullException: If geometry is null.

Rhino.Geometry.Curve.ClosestPoints(Rhino.Geometry.Curve,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Gets closest points between this and another curves.
otherCurve: The other curve.
pointOnThisCurve: The point on this curve. This out parameter is assigned during this call.
pointOnOtherCurve: The point on other curve. This out parameter is assigned during this call.
Returns: true on success; false on error.

Rhino.Geometry.Curve.ExtremeParameters(Rhino.Geometry.Vector3d)
Returns the parameter values of all local extrema.
Parameter values are in increasing order so consecutive extrema
define an interval on which each component of the curve is monotone.
Note, non-periodic curves always return the end points.
direction: The direction in which to perform the calculation.
Returns: The parameter values of all local extrema.

Rhino.Geometry.Curve.CreatePeriodicCurve(Rhino.Geometry.Curve)
Removes kinks from a curve. Periodic curves deform smoothly without kinks.
curve: The curve to make periodic. Curve must have degree >= 2.
Returns: The resulting curve if successful, null otherwise.

Rhino.Geometry.Curve.CreatePeriodicCurve(Rhino.Geometry.Curve,System.Boolean)
Removes kinks from a curve. Periodic curves deform smoothly without kinks.
curve: The curve to make periodic. Curve must have degree >= 2.
smooth:
If true, smooths any kinks in the curve and moves control points to make a smooth curve.
If false, control point locations are not changed or changed minimally (only one point may move) and only the knot vector is altered.
Returns: The resulting curve if successful, null otherwise.

Rhino.Geometry.Curve.DivideByCount(System.Int32,System.Boolean)
Divide the curve into a number of equal-length segments.
segmentCount: Segment count. Note that the number of division points may differ from the segment count.
includeEnds: If true, then the point at the start of the first division segment is returned.
Returns:
List of curve parameters at the division points on success, null on failure.

Rhino.Geometry.Curve.DivideByCount(System.Int32,System.Boolean,Rhino.Geometry.Point3d[]@)
Divide the curve into a number of equal-length segments.
segmentCount: Segment count. Note that the number of division points may differ from the segment count.
includeEnds: If true, then the point at the start of the first division segment is returned.
points: A list of division points. If the function returns successfully, this point-array will be filled in.
Returns: Array containing division curve parameters on success, null on failure.

Rhino.Geometry.Curve.DivideByLength(System.Double,System.Boolean)
Divide the curve into specific length segments.
segmentLength: The length of each and every segment (except potentially the last one).
includeEnds: If true, then the point at the start of the first division segment is returned.
Returns: Array containing division curve parameters if successful, null on failure.

Rhino.Geometry.Curve.DivideByLength(System.Double,System.Boolean,System.Boolean)
Divide the curve into specific length segments.
segmentLength: The length of each and every segment (except potentially the last one).
includeEnds: If true, then the point at the start of the first division segment is returned.
reverse: If true, then the divisions start from the end of the curve.
Returns: Array containing division curve parameters if successful, null on failure.

Rhino.Geometry.Curve.DivideByLength(System.Double,System.Boolean,Rhino.Geometry.Point3d[]@)
Divide the curve into specific length segments.
segmentLength: The length of each and every segment (except potentially the last one).
includeEnds: If true, then the point at the start of the first division segment is returned.
points: If function is successful, points at each parameter value are returned in points.
Returns: Array containing division curve parameters if successful, null on failure.

Rhino.Geometry.Curve.DivideByLength(System.Double,System.Boolean,System.Boolean,Rhino.Geometry.Point3d[]@)
Divide the curve into specific length segments.
segmentLength: The length of each and every segment (except potentially the last one).
includeEnds: If true, then the point at the start of the first division segment is returned.
reverse: If true, then the divisions start from the end of the curve.
points: If function is successful, points at each parameter value are returned in points.
Returns: Array containing division curve parameters if successful, null on failure.

Rhino.Geometry.Curve.Trim(Rhino.Geometry.Interval)
Removes portions of the curve outside the specified interval.
domain:
Trimming interval. Portions of the curve before curve(domain[0])
and after curve(domain[1]) are removed.
Returns: Trimmed curve if successful, null on failure.

Rhino.Geometry.Curve.Trim(Rhino.Geometry.CurveEnd,System.Double)
Shortens a curve by a given length
side:
length:
Returns: Trimmed curve if successful, null on failure.

Rhino.Geometry.Curve.Split(System.Collections.Generic.IEnumerable{System.Double})
Splits (divides) the curve at a series of specified parameters.
The parameter must be in the interior of the curve domain.
t:
Parameters to split the curve at in the interval returned by Domain().
Returns: Multiple curves on success, null on failure.

Rhino.Geometry.Curve.Split(Rhino.Geometry.Brep,System.Double,System.Double)
Splits a curve into pieces using a polysurface.
cutter: A cutting surface or polysurface.
tolerance: A tolerance for computing intersections.
angleToleranceRadians:
Returns: An array of curves. This array can be empty.

Rhino.Geometry.Curve.Split(Rhino.Geometry.Surface,System.Double,System.Double)
Splits a curve into pieces using a surface.
cutter: A cutting surface or polysurface.
tolerance: A tolerance for computing intersections.
angleToleranceRadians:
Returns: An array of curves. This array can be empty.

Rhino.Geometry.Curve.ToPolyline(System.Double,System.Double,System.Double,System.Double)
Gets a polyline approximation of a curve.
tolerance: The tolerance. This is the maximum deviation from line midpoints to the curve. When in doubt, use the document's model space absolute tolerance.
angleTolerance: The angle tolerance in radians. This is the maximum deviation of the line directions. When in doubt, use the document's model space angle tolerance.
minimumLength: The minimum segment length.
maximumLength: The maximum segment length.
Returns: PolyCurve on success, null on error.

Rhino.Geometry.Curve.ToArcsAndLines(System.Double,System.Double,System.Double,System.Double)
Converts a curve into polycurve consisting of arc segments. Sections of the input curves that are nearly straight are converted to straight-line segments.
tolerance: The tolerance. This is the maximum deviation from arc midpoints to the curve. When in doubt, use the document's model space absolute tolerance.
angleTolerance: The angle tolerance in radians. This is the maximum deviation of the arc end directions from the curve direction. When in doubt, use the document's model space angle tolerance.
minimumLength: The minimum segment length.
maximumLength: The maximum segment length.
Returns: PolyCurve on success, null on error.

Rhino.Geometry.Curve.PullToBrepFace(Rhino.Geometry.BrepFace,System.Double)
Pulls this curve to a brep face and returns the result of that operation.
face: A brep face.
tolerance: A tolerance value.
Returns: An array containing the resulting curves after pulling. This array could be empty.
Throws System.ArgumentNullException: If face is null.

Rhino.Geometry.Curve.OffsetNormalToSurface(Rhino.Geometry.Surface,System.Double)
Finds a curve by offsetting an existing curve normal to a surface.
The caller is responsible for ensuring that the curve lies on the input surface.
surface: Surface from which normals are calculated.
height: offset distance (distance from surface to result curve)
Returns:
Offset curve at distance height from the surface.  The offset curve is
interpolated through a small number of points so if the surface is irregular
or complicated, the result will not be a very accurate offset.