Rhino.FileIO.TextLog.#ctor
Creates a text log that stores all text in memory.  Use ToString on this
version of the TextLog to get the text that we written

Rhino.FileIO.TextLog.#ctor(System.String)
Creates a text log that writes all text to a file. If no filename is
provided, then text is written to StdOut
filename:
Name of file to create and write to. If null, then text output
is sent to StdOut

Rhino.FileIO.TextLog.#ctor(System.IntPtr)
Create a TextLog from a pointer owned elsewhere. Need
to ensure that pointer isn't deleted on Disposal of this array

Rhino.FileIO.TextLog.PushIndent
Increase the indentation level

Rhino.FileIO.TextLog.PopIndent
Decrease the indentation level

Rhino.FileIO.TextLog.IndentSize
0: one tab per indent. >0: number of spaces per indent

Rhino.FileIO.TextLog.PrintWrappedText(System.String,System.Int32)
Send text wrapped at a set line length
text:
lineLength:

Rhino.FileIO.TextLog.Print(System.String)
Send text to the textlog
text:

Rhino.FileIO.TextLog.Print(System.String,System.Object)
Send formatted text to the textlog
format:
arg0:

Rhino.FileIO.TextLog.Print(System.String,System.Object,System.Object)
Send formatted text to the textlog
format:
arg0:
arg1:

Rhino.FileIO.TextLog.Dispose
Actively reclaims unmanaged resources that this instance uses.