Rhino.FileIO.FileObj.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjWriteOptions)
Write an obj file based on the contents of a RhinoDoc
filename:
doc:
options:
Returns:

Rhino.FileIO.FileObj.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjReadOptions)
filename:
doc:
options:
Returns: