Rhino.Display.DisplayPipelineAttributes.UseAssignedObjectMaterial
Gets whether objects ought to be drawn using their assigned rendering material.

Rhino.Display.DisplayPipelineAttributes.UseCustomObjectColor
Gets whether objects ought to be drawn using a custom color.

Rhino.Display.DisplayPipelineAttributes.UseCustomObjectMaterial
Gets whether objects ought to be drawn using a custom material.

Rhino.Display.DisplayPipelineAttributes.ShowCurves
Draw curves

Rhino.Display.DisplayPipelineAttributes.CurveThickness
Pixel thickness for curves

Rhino.Display.DisplayPipelineAttributes.CurveColor
Color used for drawing curves

Rhino.Display.DisplayPipelineAttributes.ShadingEnabled
Draw shaded meshes and surfaces

Rhino.Display.DisplayPipelineAttributes.LockedObjectsDrawBehindOthers
Locked object are drawn behind other objects

Rhino.Display.DisplayPipelineAttributes.RealtimeDisplayId
Get the ID of the realtime display engine attached to the view. This will be
Guid.Empty if no realtime display engine is in use. This can be the case for instance
when starting a _Render session for a realtime viewport integration. That still would
cause this ID to be Guid.Empty.