Rhino.Geometry.Arrowhead.#ctor
Constructor

Rhino.Geometry.Arrowhead.#ctor(Rhino.DocObjects.DimensionStyle.ArrowType,System.Guid)
Constructor
arrowType:  type of this arrowhead
blockId:  Guid of the block used for user defined display

Rhino.Geometry.Arrowhead.BlockId
Id of block used for user-defined arrowhead

Rhino.Geometry.Arrowhead.ArrowType
Type of arrowhead used by annotation