Rhino.Geometry.HiddenLineDrawing.Compute(Rhino.Geometry.HiddenLineDrawingParameters,System.Boolean)
Perform the hidden line drawing calculation based on input parameters
parameters:
multipleThreads:
Returns: Results of calculation on success, null on failure

Rhino.Geometry.HiddenLineDrawing.Compute(Rhino.Geometry.HiddenLineDrawingParameters,System.Boolean,System.IProgress{System.Double},System.Threading.CancellationToken)
Perform the hidden line drawing calculation based on input parameters
parameters:
multipleThreads:
progress:
cancelToken:
Returns: Results of calculation on success, null on failure or cancellation

Rhino.Geometry.HiddenLineDrawing.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Geometry.HiddenLineDrawing.Segments
Subcurve objects calculated by the hidden line drawing.

Rhino.Geometry.HiddenLineDrawing.AddObject(Rhino.Geometry.GeometryBase,Rhino.Geometry.Transform,System.Int32)
Add Brep, Curve, Extrusion, or Mesh that is to be drawn.
geometry: The geometry to be drawn.
xform: A transformation to apply to geoemtry to place it in the world coordinte system.
tagIndex: A value used to cross-reference the geometry, such as a layer index.
Returns: Index of the object, or -1 if the geometry type is not supported.

Rhino.Geometry.HiddenLineDrawing.Viewport
Returns the ViewportInfo used by the hidden line drawing.
Returns: The ViewportInfo

Rhino.Geometry.HiddenLineDrawing.BoundingBox(System.Boolean)
Get tight bounding box of the hidden line drawing.
includeHidden: Include hidden objects.
Returns: The tight bounding box.

Rhino.Geometry.HiddenLineDrawing.WorldToHiddenLine
Returns the world-coordinate system to HLD-coordinate system transformation.