Rhino.PersistentSettings.HiddenFromUserInterface
If false then values will appear in the EditOptions window

Rhino.PersistentSettings.GetChild(System.String)
Call this method to get a nested settings Rhino.PersistentSettings
instance, will throw a System.Collections.Generic.KeyNotFoundException exception if
the key does not exist.
key: Key name
Throws System.Collections.Generic.KeyNotFoundException: Thrown if the key does not exist.
Returns:
Returns persistent settings for the specified key or throws an
exception if the key is invalid.

Rhino.PersistentSettings.TryGetChild(System.String,Rhino.PersistentSettings@)
Call this method to get a nested settings Rhino.PersistentSettings
instance, will return true if the key exists and value was set
otherwise; will return false and value will be set to null.
key: [in] Key name
value:
[out] Will be set the the child settings if the key is valid otherwise
it will be null.
Returns:
Returns true if the key exists and value was set otherwise; returns
false.

Rhino.PersistentSettings.Keys
Gets a collection containing the keys in the settings dictionary.

Rhino.PersistentSettings.ChildKeys
Gets a collection containing the keys in the settings dictionary.

Rhino.PersistentSettings.TryGetSettingType(System.String,System.Type@)
Get the type of the last value passed to Set... or Get... for the
specified setting.
key:
Key name for which to search.
type:
Type of the last value passed to Set... or Get... for the specified
setting.
Returns:

Rhino.PersistentSettings.GetSettingType(System.String)
Gets the type of the last value passed to Set... or Get... for the
specified setting.
key:
Key name for which to search.
Returns:
Type of the last value passed to Set... or Get... for the specified
setting.
Throws System.Collections.Generic.KeyNotFoundException:
A KeyNotFoundException exception is thrown if the key is not found in
the settings dictionary.

Rhino.PersistentSettings.TryGetSettingIsReadOnly(System.String,System.Boolean@)
Values read from all users settings files will be marked as read-only
which will cause any future calls to Set... to fail.
key:
Key name for which to search.
value:
Value will be true if the setting is read-only otherwise false.
setting.
Returns:

Rhino.PersistentSettings.GetSettingIsReadOnly(System.String)
Values read from all users settings files will be marked as read-only
which will cause any future calls to Set... to fail.
key:
Key name for which to search.
Returns:
Returns true if the setting is read-only otherwise false.
Throws System.Collections.Generic.KeyNotFoundException:
A KeyNotFoundException exception is thrown if the key is not found in
the settings dictionary.

Rhino.PersistentSettings.TryGetSettingIsHiddenFromUserInterface(System.String,System.Boolean@)
Values read from all users settings files will be marked as read-only
which will cause any future calls to Set... to fail.
key:
Key name for which to search.
value:
Value will be true if the setting is read-only otherwise false.
setting.
Returns:

Rhino.PersistentSettings.TryGetSettingIsHiddenFromUserInterface(System.String,System.Boolean@,System.Collections.Generic.IEnumerable{System.String})
Values read from all users settings files will be marked as read-only
which will cause any future calls to Set... to fail.
key:
Key name for which to search.
value:
Value will be true if the setting is read-only otherwise false.
setting.
legacyKeyList:
Returns:

Rhino.PersistentSettings.GetSettingIsHiddenFromUserInterface(System.String)
Values read from all users settings files will be marked as read-only
which will cause any future calls to Set... to fail.
key:
Key name for which to search.
Returns:
Returns true if the setting is read-only otherwise false.
Throws System.Collections.Generic.KeyNotFoundException:
A KeyNotFoundException exception is thrown if the key is not found in
the settings dictionary.

Rhino.PersistentSettings.GetSettingIsHiddenFromUserInterface(System.String,System.Collections.Generic.IEnumerable{System.String})
Values read from all users settings files will be marked as read-only
which will cause any future calls to Set... to fail.
key:
Key name for which to search.
legacyKeyList:
Returns:
Returns true if the setting is read-only otherwise false.
Throws System.Collections.Generic.KeyNotFoundException:
A KeyNotFoundException exception is thrown if the key is not found in
the settings dictionary.

Rhino.PersistentSettings.HideSettingFromUserInterface(System.String)
key:

Rhino.PersistentSettings.AddChild(System.String)
Call this method to add a new child key, if the key is exists then the
existing key is returned otherwise a new empty Rhino.PersistentSettings
child key is added and the new settings are returned.
key: Key to add to the child dictionary.
Returns:
If the key is exists then the existing key is returned otherwise a new
empty Rhino.PersistentSettings child key is added and the new
settings are returned.

Rhino.PersistentSettings.DeleteChild(System.String)
Call this method to delete a child settings key.
key:

Rhino.PersistentSettings.GetValidator``1(System.String)
Provides a way to find a ready-to-use validator for the
PersistentSetting class for the given the key, or obtaining null.
The type that the validator acts upon.
key: The name of the setting key.
Throws System.InvalidCastException: If type parameter T is not
the right specialization for Rhino.PersistentSettingsEventArgs`1.
Returns: A valid validator, or null if no validator was found.

Rhino.PersistentSettings.GetEnumValue``1(``0)
Get a stored enum value, or return default value if not found
defaultValue:
Returns:

Rhino.PersistentSettings.GetEnumValue``1(System.String,``0)
Gets a stored enum value using a custom key, or return default value if not found.
key:
defaultValue:
Returns:

Rhino.PersistentSettings.GetEnumValue``1(System.String)
Get a stored enum value using a custom key.
key:
Returns:
Throws System.Collections.Generic.KeyNotFoundException:

Rhino.PersistentSettings.TryGetEnumValue``1(System.String,``0@)
Attempt to get the stored value for an enum setting using a custom key. Note: the enum value ALWAYS gets assigned!
Be sure to check for success of this method to prevent erroneous use of the value.
key:
enumValue:
Returns: true if successful

Rhino.PersistentSettings.SetEnumValue``1(``0)
Set an enum value in the settings.
enumValue:

Rhino.PersistentSettings.SetEnumValue``1(System.String,``0)
Set an enum value in the settings using a custom key
key:
value: