Rhino.DocObjects.DetailViewObject.WorldToPageTransform
Gets the world coordinate to page coordinate transformation.

Rhino.DocObjects.DetailViewObject.PageToWorldTransform
Returns the page coordinate to world coordinate transformation.