Rhino.Geometry.Plane.UpdateEquation
Update Equations
Returns:
bool

Rhino.Geometry.Plane.ValueAt(Rhino.Geometry.Point3d)
Get the value of the plane equation at the point.
p: evaulation point.
Returns: returns pe[0]*p.X + pe[1]*p.Y + pe[2]*p.Z + pe[3] where
pe[0], pe[1], pe[2] and pe[3] are the coeeficients of the plane equation.

Rhino.Geometry.Plane.DistanceTo(Rhino.Geometry.BoundingBox,System.Double@,System.Double@)
Returns the signed minimum and maximum distances from bbox to this plane.
bbox: bounding box to get distances from
min: minimum signed distance from plane to box
max: maximum signed distance from plane to box
Returns: false if plane has zero length normal

Rhino.Geometry.Plane.EpsilonEquals(Rhino.Geometry.Plane,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:

Rhino.Geometry.Plane.Clone
Returns a deep of this instance.
Returns: A plane with the same values as this item.