Rhino.Geometry.Vector3d.Negate(Rhino.Geometry.Vector3d)
Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
Remarks: Similar to Reverse(), but static for CLR compliance.
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.

Rhino.Geometry.Vector3d.VectorAngle(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Computes the angle of v1, v2 with a normal vector.
v1: First vector.
v2: Second vector.
vNormal: Normal vector.
Returns: On success, the angle (in radians) between a and b with respect of normal vector; RhinoMath.UnsetValue on failure.

Rhino.Geometry.Vector3d.EpsilonEquals(Rhino.Geometry.Vector3d,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:

Rhino.Geometry.Vector3d.Reverse
Reverses this vector in place (reverses the direction).
If this vector is Invalid, no changes will occur and false will be returned.
Remarks: Similar to Negate, that is only provided for CLR language compliance.
Returns: true on success or false if the vector is invalid.