Rhino.FileIO.File3dmMaterialTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.RenderMaterial.

Rhino.FileIO.File3dmMaterialTable.FindIndex(System.Int32)
Retrieves a material based on Index. This seach type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A material, or null if none was found.