InstanceIdArray
InstanceIdArray class that wraps the CRhRdkInstanceIdArray interface

InstanceIdArray.#ctor
InstanceIdArray constructor

InstanceIdArray.#ctor(System.IntPtr)
InstanceIdArray constructor

InstanceIdArray.Finalize
InstanceIdArray destructor

InstanceIdArray.Dispose
InstanceIdArray dispose

InstanceIdArray.Dispose(System.Boolean)
InstanceIdArray dispose

InstanceIdArray.Append(System.Guid)
Append item to the list
uuid: The Guid of the item to append to the list

InstanceIdArray.Count
Get the number of instances
Returns: returns the number of instances

InstanceIdArray.At(System.Int32)
Get the instance at index
index: The index of the instance
Returns: returns the instance at index