Rhino.Render.AsyncRenderContext.RenderWindow
Handle to the RenderWindow for the instance of this class. This
is a convenience property for implementors to use.

Rhino.Render.AsyncRenderContext.RenderThread
Holder for render thread, that gets set through
StartRenderThread()

Rhino.Render.AsyncRenderContext.StartRenderThread(System.Threading.ThreadStart,System.String)
Start a new render thread with given function.
threadStart: Function to start in render thread
threadName: Name for the thread
Returns:

Rhino.Render.AsyncRenderContext.JoinRenderThread
Join the render thread, then set to null;

Rhino.Render.AsyncRenderContext.StopRendering
Override StopRendering if you need to do additional tasks besides
having Cancel set to true.
Note: you should always base.StopRendering() in your overriding
implementation.