Rhino.Geometry.Collections.SubDEdgeAccess
Provides access to the edge and edge-related functionality of a SubD.

Rhino.Geometry.Collections.SubDEdgeAccess.Count
Gets or sets the number of SubD edges.

Rhino.Geometry.Collections.SubDEdgeAccess.Add(Rhino.Geometry.SubD.SubDEdgeTag,Rhino.Geometry.SubDVertexPtr,Rhino.Geometry.SubDVertexPtr)
Adds a new edge to the end of the SubDEdgePtr list.
tag: The type of edge tag, such as smooth or corner.
v0: First vertex.
v1: Second vertex.
Throws System.ArgumentOutOfRangeException: If tag is unset or non-defined.