Rhino.Input.Custom.GetBaseClass.AddOptionEnumList``1(System.String,``0)
Adds a choice of enum values as list option
The enum type
englishOptionName: The name of the option
defaultValue: The default value
Throws System.ArgumentException: Gets thrown if defaultValue provided is not an enum type.
Returns: Option index

Rhino.Input.Custom.GetBaseClass.AddOptionEnumList``1(System.String,``0,``0[])
Adds a choice of enum values as list option. Allows to include only some enum values.
The enum type
englishOptionName: The name of the option
defaultValue: The default value
include: An array of enum values to use. This argument can also be null; in this case, the whole enum is used.
Throws System.ArgumentException: Gets thrown if defaultValue provided is not an enum type.
Returns: Option index

Rhino.Input.Custom.GetBaseClass.AddOptionEnumSelectionList``1(System.String,System.Collections.Generic.IEnumerable{``0},System.Int32)
Adds a list of enum values as option list. Use enumSelection[go.Option.CurrentListOptionIndex] to retrieve selection.
englishOptionName:
enumSelection:
listCurrentIndex:
Returns:

Rhino.Input.Custom.GetBaseClass.GetSelectedEnumValue``1
Returns the selected enum value. Use this in combination with Rhino.Input.Custom.GetBaseClass.AddOptionEnumList``1(System.String,``0).
This must be called directly after having called a Get method, and having obtained a Rhino.Input.GetResult.Option value.
Throws System.ArgumentException: Gets thrown if type T is not an enum type.
Throws System.IndexOutOfRangeException: If 0 >= CurrentListOptionIndex or CurrentListOptionIndex > N where N is the number of enum values.
Returns:

Rhino.Input.Custom.GetBaseClass.GetSelectedEnumValueFromSelectionList``1(System.Collections.Generic.IEnumerable{``0})
Returns the selected enum value by looking at the list of values from which to select.
Use this in combination with Rhino.Input.Custom.GetBaseClass.AddOptionEnumSelectionList``1(System.String,System.Collections.Generic.IEnumerable{``0},System.Int32)
selectionList:
Throws System.ArgumentException: Gets thrown if type T is not an enum type.
Throws System.IndexOutOfRangeException: If 0 >= CurrentListOptionIndex or CurrentListOptionIndex > N where N is the number of enum values.
Returns:

Rhino.Input.Custom.GetBaseClass.AcceptEnterWhenDone(System.Boolean)
There are instances of RhinoGet that prompt with "Press Enter when Done." yet do not call AcceptNothing().
On the Mac, these instances need an additional call to AcceptEnterWhenDone() so the GetPointOptions dialog
can correctly enable the Done button.
enable: