Rhino.Render.CreatePreviewEventArgs.SkipInitialisation
Call this if you don't want the argument to handle data initialisation.
This is for use with the ChangeQueue

Rhino.Render.CreatePreviewEventArgs.Reason
Reason the preview is getting generated

Rhino.Render.CreatePreviewEventArgs.PreviewContent
Obsolete, will return always null

Rhino.Render.CreatePreviewEventArgs.PreviewImageSize
Pixel size of the image that is being requested for the preview scene

Rhino.Render.CreatePreviewEventArgs.Quality
Quality of the preview image that is being requested for the preview scene

Rhino.Render.CreatePreviewEventArgs.PreviewImage
Initially null.  If this image is set, then this image will be used for
the preview.  If never set, the default internal simulation preview will
be used.

Rhino.Render.CreatePreviewEventArgs.Cancel
Get set by Rhino if the preview generation should be canceled for this

Rhino.Render.CreatePreviewEventArgs.Id
Unique Id for this scene.

Rhino.Render.CreatePreviewEventArgs.ContentKind
Description of content that preview is being generated for.

Rhino.Render.CreatePreviewEventArgs.ContentTypeId
The class Id of content that preview is being generated for.

Rhino.Render.CreatePreviewEventArgs.Environment
The environment that the previewed object is rendered in.