Rhino.FileIO.File3dmWriteOptions.#ctor
Initializes properties to defaults.

Rhino.FileIO.File3dmWriteOptions.Version
File version. Default is major version number of this assembly version.
Must be in range [2; current version].
Alternatively, 0 is a placeholder for the last valid version.
Rhino can read its current version, plus earlier file versions except 1.
Use latest version when possible.

Rhino.FileIO.File3dmWriteOptions.SaveRenderMeshes
Include Render meshes in the file. Default is true

Rhino.FileIO.File3dmWriteOptions.EnableRenderMeshes(Rhino.DocObjects.ObjectType,System.Boolean)
Activates saving of render meshes for specific types of objects.
If you do not specify the state for an object type, its default is used.
Specifically, currently SubD mesh saving is disabled by default, while Brep and Extrusion is on.
objectType: The object type. Mostly brep, extrusion and SubD (or their flag combinations) make sense here.
DO NOT specify a 'filter' or subobject type.
enable: If false, disables saving for this object type.

Rhino.FileIO.File3dmWriteOptions.SaveAnalysisMeshes
Include analysis meshes in the file. Default is true

Rhino.FileIO.File3dmWriteOptions.EnableAnalysisMeshes(Rhino.DocObjects.ObjectType,System.Boolean)
Activates saving of analysis meshes for specific types of objects.
If you do not specify the state for an object type, its default is used.
Currently SubD mesh saving is disabled by default, while Brep and Extrusion is enabled.
objectType: The object type. Mostly mesh, brep, extrusion and SubD (or their flag combinations) make sense here.
DO NOT specify a 'filter' or subobject type.
enable: If false, disables saving for this object type.

Rhino.FileIO.File3dmWriteOptions.SaveUserData
Include custom user data in the file. Default is true