Rhino.Collections.Point3dList.SetAllX(System.Double)
Set all the X values for the points to a single value
xValue:

Rhino.Collections.Point3dList.SetAllY(System.Double)
Set all the Y values for the points to a single value
yValue:

Rhino.Collections.Point3dList.SetAllZ(System.Double)
Set all the Z values for the points to a single value
zValue:

Rhino.Collections.Point3dList.Duplicate
Returns a deep copy of this point list instance.
Returns: The duplicated list.