Rhino.ApplicationSettings.FileSettings.LocalProfileDataFolder
Get full path to a Rhino specific sub-folder under the per-user Local
(non-roaming) Profile folder.  This is the folder where user-specific
data is stored.
On Windows 7, 8, usually someplace like:
"C:\Users\[USERNAME]\AppData\Local\McNeel\Rhinoceros\[VERSION_NUMBER]\"