Rhino.Render.Skylight.Changed
This event is raised when a Skylight property value is changed.

Rhino.Render.Skylight.#ctor
Create an utility object not associated with any document

Rhino.Render.Skylight.#ctor(Rhino.Render.Skylight)
Create an utility object not associated with any document from another object
src: