Rhino.FileIO.File3dmLinetypeTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.LinePattern.

Rhino.FileIO.File3dmLinetypeTable.FindName(System.String)
Finds a Linetype given its name.
name: The name of the Linetype to be searched.
Returns: A Linetype, or null on error.

Rhino.FileIO.File3dmLinetypeTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a Linetype given its name hash.
nameHash: The name hash of the Linetype to be searched.
Returns: An Linetype, or null on error.

Rhino.FileIO.File3dmLinetypeTable.FindIndex(System.Int32)
Retrieves a Linetype object based on Index. This seach type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Linetype, or null if none was found.