Rhino.PlugIns.LicenseCapabilities
Controls the buttons that will appear on the license notification window
that is displayed if a license for the requesting product is not found.
Note, the "Close" button will always be displayed.

Rhino.PlugIns.LicenseCapabilities.CanBeSpecified
Shows ""Enter a license" and "Use a Zoo" buttons

Rhino.PlugIns.LicenseCapabilities.SupportsCloudZoo
Supports Cloud Zoo Licenses