Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader class.

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.#ctor(System.IntPtr)
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader class.

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Add(Rhino.FileIO.BinaryArchiveReader)
Adds a new Rhino.Geometry.Interval at the end of this array.

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Count
Gets the amount of elements in this array.

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Get(System.Int32)
Get the Guid at index
index:
Returns:

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Dispose
Actively reclaims unmanaged resources that this instance uses.