Rhino.Geometry.HiddenLineDrawingSegment
The results of HiddenLineDrawing calculation are a collection of segments.
A segment is a subcurve of a HiddenLineDrawingObjectCurve.

Rhino.Geometry.HiddenLineDrawingSegment.Index
Index of this curve in HiddenLineDrawing.Curves.

Rhino.Geometry.HiddenLineDrawingSegment.CurveGeometry
The actual curve geometry

Rhino.Geometry.HiddenLineDrawingSegment.ParentCurve
This curve is a subcurve of the returned HiddenLineDrawingFullCurve object.

Rhino.Geometry.HiddenLineDrawingSegment.SegmentVisibility
Returns the segment's visibility

Rhino.Geometry.HiddenLineDrawingSegment.IsSceneSilhouette
Returns true if this curve is a scene silhoutte.

Rhino.Geometry.HiddenLineDrawingSegment.CurveSideFills
The SideFill fields are only valid for visible curves.
With respect to the HiddenLineDrawing, the region to the left (or right respecively) of this curve is
described by CurveSideFills[0] or CurveSideFills[1], respectively.  If exactly one of these regions is empty
this is a scene silhouette. If this region conains a surface it is either a surface which in 3-D is adjacent
to this edge or it an surface that is further away from the camera, we call this a shadow surface.
unknown is used for unset values and for projecting curves