Rhino.Runtime.InteropWrappers.SimpleArray2dex.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArray2dex.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArray2dex.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArray2dex class.

Rhino.Runtime.InteropWrappers.SimpleArray2dex.#ctor(System.Collections.Generic.IEnumerable{Rhino.IndexPair})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArray2dex class
values: initial set of integer pairs to add to the array

Rhino.Runtime.InteropWrappers.SimpleArray2dex.Count
Gets the amount of elements in this array.

Rhino.Runtime.InteropWrappers.SimpleArray2dex.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArray2dex.Dispose
Actively reclaims unmanaged resources that this instance uses.