Rhino.Geometry.Point3f.EpsilonEquals(Rhino.Geometry.Point3f,System.Single)
Check that all values in other are withing epsilon of the values in this
other:
epsilon:
Returns:

Rhino.Geometry.Point3f.op_Multiply(Rhino.Geometry.Point3f,System.Single)
Multiplies a point by a factor.
point: A point.
value: A value.
Returns: A new vector that is the multiplication of point by value.

Rhino.Geometry.Point3f.op_Multiply(System.Single,Rhino.Geometry.Point3f)
Multiplies a point by a factor.
point: A point.
value: A value.
Returns: A new vector that is the multiplication of point by value.