Rhino.Display.DisplayPipeline.FrameBuffer
Gets the contents of the framebuffer that this pipeline is drawing to.

Rhino.Display.DisplayPipeline.IsInViewCapture
Gets a value that indicates whether this pipeline is currently drawing
for ViewCaptureToFile or ViewCaptureToClipboard

Rhino.Display.DisplayPipeline.DrawingWires
Gets a value that indicates whether the pipeline is currently in a curve
drawing operation. This is useful when inside of a draw event or display
conduit to check and see if the geometry is about to be drawn is going to
be drawing the wire representation of the geometry (mesh, extrusion, or
brep).  See DrawingSurfaces to check and see if the shaded mesh representation
of the geometry is going to be drawn.

Rhino.Display.DisplayPipeline.DrawingSurfaces
Gets a value that indicates whether the pipeline is currently in a surface
drawing operation.  Surface drawing means draw the shaded triangles of a mesh
representing the surface (mesh, extrusion, or brep).  This is useful when
inside of a draw event or display conduit to check and see if the geometry is
about to be drawn as a shaded set of triangles representing the geometry.
See DrawingWires to check and see if the wireframe representation of the
geometry is going to be drawn.

Rhino.Display.DisplayPipeline.DpiScale
Scale factor used for high resolution displays. When a monitor that this
pipeline is drawing to is at a DPI of 96, this value is one. On high
DPI monitors, this value will commonly be greater than one.

Rhino.Display.DisplayPipeline.DrawExtrusionWires(Rhino.Geometry.Extrusion,System.Drawing.Color)
Draws all the wireframe curves of an extrusion object.
extrusion: Extrusion to draw.
color: Color of Wireframe curves.

Rhino.Display.DisplayPipeline.DrawExtrusionWires(Rhino.Geometry.Extrusion,System.Drawing.Color,System.Int32)
Draws all the wireframe curves of an extrusion object.
extrusion: Extrusion to draw.
color: Color of Wireframe curves.
wireDensity:
"Density" of wireframe curves.
-1 = no internal wires.
0 = default internal wires.
>0 = custom high density.

Rhino.Display.DisplayPipeline.DrawActivePoint(Rhino.Geometry.Point3d)
Draws a point in style used during "GetPoint" operations
point: Location of the point in world coordinates

Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d)
Draws a point using the current display attribute size, style and color
point: Location of point in world coordinates.

Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Single,System.Drawing.Color)
Draws a point with a given radius, style and color.
point: Location of point in world coordinates.
style: Point display style.
radius: Point size in pixels.
color:
Color of point. If style is ControlPoint, this will be the border color.

Rhino.Display.DisplayPipeline.DrawPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Display.PointStyle,System.Single,System.Drawing.Color)
Draw a set of points with a given radius, style and color.
points: Location of points in world coordinates.
style: Point display style.
radius: Point size in pixels.
color:
Color of points. If style is ControlPoint, this will be the border color.

Rhino.Display.DisplayPipeline.DrawPointCloud(Rhino.Geometry.PointCloud,System.Single)
Draws a point cloud.
cloud: Point cloud to draw, if the cloud has a color array, it will be used, otherwise the points will be black.
size: Size of points.

Rhino.Display.DisplayPipeline.DrawPointCloud(Rhino.Geometry.PointCloud,System.Single,System.Drawing.Color)
Draws a point cloud.
cloud: Point cloud to draw.
size: Size of points.
color: Color of points in the cloud, if the cloud has a color array this setting is ignored.

Rhino.Display.DisplayPipeline.DrawPatternedLine(Rhino.Geometry.Line,System.Drawing.Color,System.Int32,System.Int32)
Draws a single line with specified pattern.
line: Line to draw.
color: Color of line.
pattern: Pattern of the line (like 0x00001111 for dotted line).
thickness: Thickness (in pixels) of lines.

Rhino.Display.DisplayPipeline.DrawPatternedLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color,System.Int32,System.Int32)
Draws a single line with specified pattern.
from: Line start point.
to: Line end point.
color: Color of line.
pattern: Pattern of the line (like 0x00001111 for dotted line).
thickness: Thickness (in pixels) of lines.

Rhino.Display.DisplayPipeline.DrawDottedPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Boolean)
Draws a set of connected lines (polyline) in a dotted pattern (0x00001111).
points: End points of each line segment.
color: Color of polyline.
close: Draw a line between the first and last points.

Rhino.Display.DisplayPipeline.DrawPatternedPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Int32,System.Int32,System.Boolean)
Draws a set of connected lines (polyline) with specified pattern.
points: End points of each line segment.
color: Color of polyline.
pattern: Pattern to use for the line (like 0x00001111 for dotted).
thickness: Thickness (in pixels) of lines.
close: Draw a line between the first and last points.

Rhino.Display.DisplayPipeline.DrawPolygon(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Boolean)
Draws a filled, convex polygon from a collection of points.
points:
Collection of world coordinate points that are connected by lines to form a closed shape.
Collection must contain at least 3 points.
color: Color to draw with.
filled:
true if the closed area should be filled with color.
false if you want to draw just the border of the closed shape.

Rhino.Display.DisplayPipeline.DrawBitmap(Rhino.Display.DisplayBitmap,System.Int32,System.Int32)
Draws a bitmap in screen coordinates
bitmap: bitmap to draw
left: where top/left corner of bitmap should appear in screen coordinates
top: where top/left corner of bitmap should appear in screen coordinates

Rhino.Display.DisplayPipeline.DrawDot(System.Single,System.Single,System.String,System.Drawing.Color,System.Drawing.Color)
Draws a text dot in screen coordinates.
screenX: X coordinate (in pixels) of dot center.
screenY: Y coordinate (in pixels) of dot center.
text: Text content of dot.
dotColor: Dot background color.
textColor: Dot foreground color.

Rhino.Display.DisplayPipeline.DrawDot(System.Single,System.Single,System.String)
Draws a text dot in screen coordinates.
screenX: X coordinate (in pixels) of dot center.
screenY: Y coordinate (in pixels) of dot center.
text: Text content of dot.

Rhino.Display.DisplayPipeline.DrawDot(Rhino.Geometry.TextDot,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)
Draw a text dot as defined by the text dot class
dot:
fillColor:
textColor:
borderColor:

Rhino.Display.DisplayPipeline.Measure2dText(System.String,Rhino.Geometry.Point2d,System.Boolean,System.Double,System.Int32,System.String)
Determines screen rectangle that would be drawn to using the Draw2dText(..) function
with the same parameters.
text: text to measure.
definitionPoint: either lower-left or middle of text.
middleJustified: true=middle justified. false=lower-left justified.
rotationRadians: text rotation in radians
height: height in pixels (good default is 12)
fontFace: font name (good default is "Arial")
Returns: rectangle in the viewport's screen coordinates on success.