Rhino.Runtime.InteropWrappers.StringWrapper.#ctor
Initializes a new empty unmanaged string (ON_wString*).

Rhino.Runtime.InteropWrappers.StringWrapper.#ctor(System.String)
Initializes a new unmanaged string with an initial value.
The string s can be null.
s: The initial value, or null.