Rhino.Geometry.LinearDimension.SetLocations(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Sets the three locations of the point, using two-dimensional points
that refer to the plane of the annotation.

Rhino.Geometry.LinearDimension.Create(Rhino.Geometry.AnnotationType,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Initialize Dimension parameters
dimtype:
dimStyle:
plane:
horizontal:
defpoint1:
defpoint2:
dimlinepoint:
rotationInPlane:
Returns:

Rhino.Geometry.LinearDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
extensionLine1End:
extensionLine2End:
arrowhead1End:
arrowhead2End:
dimlinepoint:
textpoint:
Returns:

Rhino.Geometry.LinearDimension.ExtensionLine1End
End of the first extension line.

Rhino.Geometry.LinearDimension.ExtensionLine2End
End of the second extension line.

Rhino.Geometry.LinearDimension.DimensionLinePoint
Point on annotation plane where dimension line starts