Rhino.Geometry.Transform.#ctor(Rhino.Geometry.Transform)
Initializes a new transform matrix with a specified value.
value: Value to assign to all cells.

Rhino.Geometry.Transform.ProjectAlong(Rhino.Geometry.Plane,Rhino.Geometry.Vector3d)
Construct a projection onto a plane along a specific direction.
plane: Plane to project onto.
direction: Projection direction, must not be parallel to the plane.
Returns: Projection transformation or identity transformation if projection could not be calculated.

Rhino.Geometry.Transform.Multiply(Rhino.Geometry.Transform,Rhino.Geometry.Transform)
Multiplies (combines) two transformations.
This is the same as the * operator between two transformations.
a: First transformation.
b: Second transformation.
Returns: A transformation matrix that combines the effect of both input transformations.
The resulting Transform gives the same result as though you'd first apply B then A.

Rhino.Geometry.Transform.IsIdentity
Return true if this Transform is the identity transform

Rhino.Geometry.Transform.Transpose
Flip row/column values
Returns:

Rhino.Geometry.Transform.ToFloatArray(System.Boolean)
Return the matrix as a linear array of 16 float values
rowDominant:
Returns:

Rhino.Geometry.Transform.Clone
Returns a deep copy of the transform. For languages that treat structures as value types, this can
be accomplished by a simple assignment.
Returns: A deep copy of this data structure.