Rhino.UI.Localization.LocalizeDialogItem(System.Object,System.String,System.String)
Look in the dialog item list for the specified key and return the translated
localized string if the key is found otherwise return the English string.
assemblyOrObject: An assembly or an object from an assembly.
key:
english: The text in English.
Returns:
Look in the dialog item list for the specified key and return the translated
localized string if the key is found otherwise return the English string.

Rhino.UI.Localization.LocalizeForm(System.Object)
Look in the dialog item list for the specified key and return the translated
localized string if the key is found otherwise return the English string.
formOrUserControl: