Rhino.DocObjects.EarthAnchorPoint.EarthLocationIsSet
Checks if the earth location is set or not.
Returns: Bool value, true if set else false

Rhino.DocObjects.EarthAnchorPoint.GetEarthAnchorPlane(Rhino.Geometry.Vector3d@)
Returns the earth anchor plane
anchorNorth:
Returns: A plane value.