Rhino.Render.ChangeQueue.DynamicObjectTransform.MeshInstanceId
Get the mesh instance id for this dynamic object.

Rhino.Render.ChangeQueue.DynamicObjectTransform.Transform
Transform for the DynamicObject