Rhino.DocObjects.Tables.InstanceDefinitionTable.Find(System.String)
Finds the instance definition with a given name.
instanceDefinitionName: name of instance definition to search for (ignores case)
Returns: The specified instance definition, or null if nothing matching was found.

Rhino.DocObjects.Tables.InstanceDefinitionTable.InstanceDefinitionIndex(System.Guid,System.Boolean)
Get the index of the instance definition with a given id.
instanceId: Unique id of the instance definition to search for
ignoreDeletedInstanceDefinitions: true means don't search deleted instance definitions.
Returns: index > -1 if instance definition was found.

Rhino.DocObjects.Tables.InstanceDefinitionTable.DestroySourceArchive(Rhino.DocObjects.InstanceDefinition,System.Boolean)
Destroys all source archive information.
Specifically:
* Rhino.DocObjects.InstanceDefinition.SourceArchive is set to the empty string.
* SourceRelativePath is set to false
* The alternative source archive path is set to the empty string.
* Checksum.Zero() is used to private destroy all checksum information.
* Rhino.DocObjects.InstanceDefinition.UpdateType is set to Rhino.DocObjects.InstanceDefinitionUpdateType.Static.
definition: The instance definition to be modified.
quiet: If true, then message boxes about erroneous parameters will not be shown.
Returns:
Returns true if the definition was successfully modified otherwise returns false.

Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifySourceArchive(System.Int32,System.String,Rhino.DocObjects.InstanceDefinitionUpdateType,System.Boolean)
If the instance definition is linked or embedded, use SetSource to
specify the source archive.
idefIndex: The index of the instance definition to be modified.
sourceArchive: The new source archive file name.
updateType:
quiet: If true, then message boxes about erroneous parameters will not be shown.
Returns:
Returns true if the definition was successfully modified otherwise returns false.

Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifySourceArchive(System.Int32,Rhino.FileIO.FileReference,Rhino.DocObjects.InstanceDefinitionUpdateType,System.Boolean)
If the instance definition is linked or embedded, use SetSource to
specify the source archive.
idefIndex: The index of the instance definition to be modified.
sourceArchive: The new source archive file name.
updateType:
quiet: If true, then message boxes about erroneous parameters will not be shown.
Returns:
Returns true if the definition was successfully modified otherwise returns false.

Rhino.DocObjects.Tables.InstanceDefinitionTable.RefreshLinkedBlock(Rhino.DocObjects.InstanceDefinition)
Reload linked block definitions and update the Rhino display.
definition:
Instance definition to reload.
Returns:
Returns true if the linked file was successfully read and updated.

Rhino.DocObjects.Tables.InstanceDefinitionTable.MakeSourcePathRelative(Rhino.DocObjects.InstanceDefinition,System.Boolean,System.Boolean)
Obsolete method that always returns false.
Marks the source path for a linked instance definition as relative or absolute.
idef: The instance definition to be marked.
relative:
If true, the path should be considered as relative.
If false, the path should be considered as absolute.
quiet: If true, then message boxes about erroneous parameters will not be shown.
Returns:
true if the instance definition could be modified.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Delete(Rhino.DocObjects.InstanceDefinition)
Deletes the instance definition. This deletes all references too.
item: The item to delete.
Returns: True on success.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Purge(System.Int32)
Purges an instance definition and its definition geometry.
idefIndex:
zero based index of instance definition to delete.
This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count.
Returns:
True if successful. False if the instance definition cannot be purged
because it is in use by reference objects or undo information.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Compact(System.Boolean)
Purge deleted instance definition information that is not in use.
This function is time consuming and should be used in a thoughtful manner.
ignoreUndoReferences:
If false, then deleted instance definition information that could possibly
be undeleted by the Undo command will not be deleted. If true, then all
deleted instance definition information is deleted.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Undelete(System.Int32)
Undeletes an instance definition that has been deleted by Delete()
idefIndex:
zero based index of instance definition to delete.
This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count.
Returns: true if successful

Rhino.DocObjects.Tables.InstanceDefinitionTable.UpdateLinkedInstanceDefinition(System.Int32,System.String,System.Boolean,System.Boolean)
Read the objects from a file and use them as the instance's definition geometry.
idefIndex:
zero based index of instance definition to delete.
This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count.
filename:
name of file (can be any type of file that Rhino or a plug-in can read)
updateNestedLinks:
If true and the instance definition referes to a linked instance definition,
that needs to be updated, then the nested defition is also updated. If
false, nested updates are skipped.
quiet:
Returns: