Rhino.DocObjects.Tables.StringTable.SetString(System.String,System.String)
Adds or sets a user data string to the document.
key: The key.
value: The entry value.
Returns:
The previous value if successful and a previous value existed.