Rhino.Render.PreviewGeometry.CppPointer
CppPointer for PreviewGeometry

Rhino.Render.PreviewGeometry.#ctor(System.IntPtr)
Constructor for PreviewGeometry

Rhino.Render.PreviewGeometry.SetUpPreview(System.IntPtr,System.IntPtr,System.Boolean)
SetUpPreview

Rhino.Render.PreviewGeometry.ElementKind
ElementKind