Rhino.Render.Fields.FieldDictionary
Dictionary containing RenderContent data fields, add fields to this
dictionary in your derived RenderContent classes constructor.  Get field
values using the TryGet[data type]() methods and set them using the Set()
method.
[System.Runtime.InteropServices.Guid("ABE4059B-9BD7-451C-91B2-67C2F188860A")]
public class CustomMaterial : RenderMaterial
{
public override string TypeName { get { return "CSharp Custom Material"; } }
public override string TypeDescription { get { return "My first custom .NET material"; } }
public CustomMaterial()
{
Fields.AddField("bool", false, "Yes/No");
Fields.AddField("color", Rhino.Display.Color4f.White, "Color");
}
}

Rhino.Render.Fields.FieldDictionary.ContainsField(System.String)
Call this method to determine if a this FieldsList contains a field
with the specified field name.
fieldName: Field to search for
Returns:
Returns true if a field with that matches fieldName is found or false
if it is not found.

Rhino.Render.Fields.FieldDictionary.GetField(System.String)
Call this method to get the field with the matching name.
fieldName: Field name to search for.
Returns:
If the field exists in the Fields dictionary then the field is returned
otherwise; null is returned.

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.String)
Add a new StringField to the dictionary.  This will be a data only
field and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.String,System.String)
Add a new StringField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.String,System.String)
Add a new StringField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Boolean)
Add a new BoolField to the dictionary. This will be a data only field
and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Boolean,System.String)
Add a new BoolField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Boolean,System.String)
Add a new BoolField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Int32)
Add a new IntField to the dictionary. This will be a data only field
and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Int32,System.String)
Add a new IntField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Int32,System.String)
Add a new IntField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Single)
Add a new FloatField to the dictionary. This will be a data only field
and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Single,System.String)
AddField a new FloatField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Single,System.String)
Add a new FloatField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Double)
AddField a new DoubleField to the dictionary. This will be a data only
field and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Double,System.String)
Add a new DoubleField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Double,System.String)
Add a new DoubleField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Display.Color4f)
Add a new Color4fField to the dictionary. This will be a data only
field and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Display.Color4f,System.String)
Add a new Color4fField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Display.Color4f,System.String)
Add a new Color4fField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Drawing.Color)
Add a new Color4fField to the dictionary. This will be a data only
field and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Drawing.Color,System.String)
Add a new Color4fField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Drawing.Color,System.String)
Add a new Color4fField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Vector2d)
Add a new Vector2dField to the dictionary. This will be a data only
field and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Vector2d,System.String)
Add a new Vector2dField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Geometry.Vector2d,System.String)
Add a new Vector2dField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Vector3d)
Add a new Vector3dField to the dictionary. This will be a data only
field and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Vector3d,System.String)
Add a new Vector3dField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Geometry.Vector3d,System.String)
Add a new Vector3dField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point2d)
Add a new Point2dField to the dictionary. This will be a data only
field and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point2d,System.String)
Add a new Point2dField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Geometry.Point2d,System.String)
Add a new Point2dField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point3d)
Add a new Point3dField to the dictionary. This will be a data only
field and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point3d,System.String)
Add a new Point3dField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Geometry.Point3d,System.String)
Add a new Point3dField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point4d)
Add a new Point4dField to the dictionary. This will be a data only
field and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point4d,System.String)
Add a new Point4dField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Geometry.Point4d,System.String)
Add a new Point4dField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Guid)
Add a new GuidField to the dictionary. This will be a data only field
and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Guid,System.String)
Add a new GuidField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Guid,System.String)
Add a new GuidField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Transform)
Add a new TransformField to the dictionary. This will be a data only
field and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Transform,System.String)
Add a new TransformField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,Rhino.Geometry.Transform,System.String)
Add a new TransformField to the dictionary. This overload will cause
the field to be tagged as "textured" so that the texturing UI will
appear in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.DateTime)
Add a new DateTimeField to the dictionary. This will be a data only
field and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.DateTime,System.String)
Add a new DateTimeField to the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.DateTime,System.String)
Add a new DateTimeField to the dictionary. This overload will cause the
field to be tagged as "textured" so that the texturing UI will appear
in automatic UIs.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Byte[])
AddField a new ByteArrayField to the dictionary. This will be a data
only field and not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:
Throws System.ArgumentException:
An element with the same key already exists in the dictionary

Rhino.Render.Fields.FieldDictionary.SetHelper``1(System.String,``0)
Set the field value with a change notification of
RenderContent.ChangeContexts.Program.  Will throw an exception if the
key name is invalid or if T is not a supported data type.
Data type of the value parameter.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.String)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.String,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Boolean)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Boolean,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Int32)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Int32,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Single)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Single,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Double)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Double,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Display.Color4f)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Display.Color4f,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Drawing.Color)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Drawing.Color,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Geometry.Vector2d)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Geometry.Vector2d,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Geometry.Vector3d)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Geometry.Vector3d,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Geometry.Point2d)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Geometry.Point2d,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Geometry.Point3d)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Geometry.Point3d,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Geometry.Point4d)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Geometry.Point4d,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Guid)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Guid,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Geometry.Transform)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,Rhino.Geometry.Transform,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.DateTime)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.DateTime,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Byte[])
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.

Rhino.Render.Fields.FieldDictionary.Set(System.String,System.Byte[],Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw a InvalidOperationException exception if the key
name is not valid.
key: Key name for the field value to change.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.FieldDictionary.SetTag(System.String,System.Object)
Sets an object that contains data to associate with the field.  THIS IS NOW OBSOLETE - if you were using this, please email andy@mcneel.com and let me know why.
key: Key name for the field to tag.
tag: Data to associate with the field.
Returns: True if the field is found and the tag was set otherwise false is returned.

Rhino.Render.Fields.FieldDictionary.TryGetTag(System.String,System.Object@)
Gets object that contains data associate with a field. THIS IS NOW OBSOLETE - if you were using this, please email andy@mcneel.com and let me know why.
key: Key name of the field to get.
tag: Data associated with the field.
Returns:
Returns true if the field is found and its tag was retrieved otherwise;
returns false.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,System.String@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,System.Boolean@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,System.Int32@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,System.Double@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,System.Single@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,Rhino.Display.Color4f@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,System.Drawing.Color@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,Rhino.Geometry.Vector2d@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,Rhino.Geometry.Vector3d@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,Rhino.Geometry.Point2d@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,Rhino.Geometry.Point3d@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,Rhino.Geometry.Point4d@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,System.Guid@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,Rhino.Geometry.Transform@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,System.DateTime@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.

Rhino.Render.Fields.FieldDictionary.TryGetValue(System.String,System.Byte[]@)
Find a field with the specified key and get its value if found.
key: Key name of the field to get a value for.
value: Output parameter which will receive the field value.
Returns:
Returns true if the key is found and the value parameter is set to the
field value.  Returns false if the field was not found.