Rhino.PlugInSettings.WriteTempFile(System.String,System.Boolean)
Constructs a temporary file and write plug-in and plug-in command settings to the temp file.
Only writes PersistentSettings that contain one or more item with a value that differs
from the default value.