Rhino.FileIO.FileObjWriteOptions.EolType
Remarks:
Alias/Wavefront OBJ files are ASCII files.
Generally they should have a LF (UNIX)
as the end-of-line marker.

Rhino.FileIO.FileObjWriteOptions.TrimCurveType
trimming curve option

Rhino.FileIO.FileObjWriteOptions.ExportObjectNames
Setting to determine what object names in Rhino
will become in the OBJ output file

Rhino.FileIO.FileObjWriteOptions.ExportGroupNameLayerNames
Setting to determine whether object, group or layer names
will become "g"s in the OBJ output file

Rhino.FileIO.FileObjWriteOptions.ExportMaterialDefinitions
Setting to write an .mtl file and "usemtl"s in the obj file

Rhino.FileIO.FileObjWriteOptions.MapZtoY
Setting to transform Rhino's Z axis to OBJ's Y axis

Rhino.FileIO.FileObjWriteOptions.SignificantDigits
Number of significant digits to write out for floating point numbers

Rhino.FileIO.FileObjWriteOptions.WrapLongLines
Setting to enable/disable line wrapping with "\"s

Rhino.FileIO.FileObjWriteOptions.SortObjGroups
Setting to enable/disable sorting of OBJ groups
Remarks:
This is mainly for the sake of making an obj file more human readable,
however, it is important that it happens when a user has opted to write
Rhino groups as OBJ "g"s since it is not necessary for every object in Rhino
to be part of a group.

Rhino.FileIO.FileObjWriteOptions.CreateNgons
Setting to enable/diable the creation of ngons for the output

Rhino.FileIO.FileObjWriteOptions.IncludeUnweldedEdgesInNgons
Setting to determine whether unwelded edges are ignored in the
creation of an ngon.
Remarks:
Imagine a plane that has been split and then rejoined.  This
setting determines if you will get one or twon ngons in the output.
TODO This is not hooked up yet, Dale hasn't made this available yet.
See RH-30673.

Rhino.FileIO.FileObjWriteOptions.CullUnnecessaryVertexesInNgons
Setting to determine whether interior colinear vertexes are part of the
ngon.
Remarks:
Imagine a plane that has been split and then rejoined.  If IncludeUnweldedEdgesInNgons
is setr to true then you would get an ngon with 6 vertexes, the corners and one on each edge
that was split.  Setting this to true would remove those 2 vertexes from the interior of the edge.
TODO This is not hooked up yet, Dale hasn't made this available yet.
See RH-30673.

Rhino.FileIO.FileObjWriteOptions.MinNgonFaceCount
Minimum number of faces to consider creation of ngon

Rhino.FileIO.FileObjWriteOptions.ExportTcs
Enable/disable export of texture coordinates, if they exist.

Rhino.FileIO.FileObjWriteOptions.ExportNormals
Enable/disable export of vertex normals, if they exist.

Rhino.FileIO.FileObjWriteOptions.ExportVcs
Enable/disable export of vertex colors, if they exist.

Rhino.FileIO.FileObjWriteOptions.ExportOpenMeshes
Enable/Disable bailing when an open mesh is encountered.

Rhino.FileIO.FileObjWriteOptions.UnderbarMaterialNames
Enable/disable replacing white space with underbars in material names.

Rhino.FileIO.FileObjWriteOptions.UseSimpleDialog
Determines whether to use the simple or detailed meshing dialog.

Rhino.FileIO.FileObjWriteOptions.MeshParameters
Mesh parameters to use when meshing geometry that is not already a mesh.

Rhino.FileIO.FileObjWriteOptions.UseRelativeIndexing
Determines whether to use relative indexing.
TRUE = use relative (negative) indexing
FALSE = use absolute (positive) indexing
Remarks:
This only has an impact on non-mesh output.  There is also
no interface in the OBJ export plugin so code executed when set to
true has not been thoroughly tested.  It has been there forever and migrated
with each successive revision of OBJ export code.

Rhino.FileIO.FileObjWriteOptions.#ctor(Rhino.FileIO.FileWriteOptions)
writeOptions:

Rhino.FileIO.FileObjWriteOptions.GetTransform
Calculates the transform combination of ZToY and
any the translation that might occur in a SavewithOrigin.