Rhino.Runtime.LicenseManager.GetLicenseHelper(System.String,System.Guid,System.Int32,System.String,System.IntPtr)
title:
id:
productBuildType:
path:
validator:
Returns:

Rhino.Runtime.LicenseManager.CustomGetLicenseHelper(System.Guid,System.String,System.UInt32,System.String,System.String,System.IntPtr)
id:
title:
capabilities:
textMask:
path:
validator:
Returns:

Rhino.Runtime.LicenseManager.AskUserForLicenseHelper(System.String,System.Boolean,System.IntPtr,System.Guid,System.Int32,System.String,System.String,System.IntPtr)
productTitle:
standAlone:
parent:
productId:
productBuildType:
textMask:
path:
validator:
Returns: