Rhino.Render.TextureEvaluator.Initialize
Call this function before calling GetColor for the first time. Ideally, this should
be on the main thread, but you can also call it on a worker thread as long as you
are sure that Initialize() or GetColor() cannot be called at the same time on another thread.
Returns:

Rhino.Render.TextureEvaluator.GetColor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Get the color of the texture at a particular point in uvw space.
May be called from within a rendering shade pipeline.
note For ray differentials see Pharr Humphreys, "Physically Based Rendering", chapter 11.
uvw: is the point for which to evaluate the texture.
duvwdx: duvwdx is a ray differential.
duvwdy: duvwdy is a ray differential.
Returns: The texture color at this point in UV space.

Rhino.Render.TextureEvaluator.Dispose
For Dispose pattern