Rhino.Display.RhinoPageView.PageNumber
Gets or sets the runtime page number and updates the page number for all
of the other pages. The first page has a value of 0

Rhino.Display.RhinoPageView.PageWidth
Width of the page in the document's PageUnitSystem

Rhino.Display.RhinoPageView.PageHeight
Height of the page in the document's PageUnitSystem