Rhino.DocObjects.ReplayHistoryData.HistoryVersion
ReplayHistory overrides check the version number to ensure the information
saved in the history record is compatible with the current implementation
of ReplayHistory

Rhino.DocObjects.ReplayHistoryData.Results
Provides access to BOTH inputs and outputs of the replay history operation.
Use this property to then call an appropriate UpdateToX() method and make your
custom history support work.