Rhino.PrivateMeshCommands.MeshTypes.Graph.#ctor(Rhino.Geometry.Curve[],System.Double)
Constructs a single topology with tolerance
curves: The array or list of curves that will be shallow copied. Modifying curves invalidates this class.
tolerance: A positive tolerance value, measured in document units

Rhino.PrivateMeshCommands.MeshTypes.Graph.RepetitionCounts(Rhino.PrivateMeshCommands.MeshTypes.VertexOnCurve[],Rhino.Geometry.Curve[],System.Int32[]@)
Repetition counts