Rhino.Geometry.Surface.Reverse(System.Int32,System.Boolean)
Same as Reverse, but if inPlace is set to true this Surface is modified
instead of a new copy being created.
direction:
0 for first parameter's domain, 1 for second parameter's domain.
inPlace:
Returns:
If inPlace is False, a new reversed surface on success. If inPlace is
true, this surface instance is returned on success.

Rhino.Geometry.Surface.Transpose(System.Boolean)
Transposes surface parameterization (swap U and V)
inPlace:
Returns: New transposed surface on success, null on failure.

Rhino.Geometry.Surface.TryGetCylinder(Rhino.Geometry.Cylinder@)
Tests a surface to see if it is a portion of a cylinder within RhinoMath.ZeroTolerance and return the cylinder.
cylinder: On success, the cylinder parameters are filled in.
Returns: true if the surface is a portion of a cylinder.
Remarks:
If successful, an infinite cylinder is returned. When a surface has a cylindrical shape,
even if its ends are not circles on the cylinder, it returns the axis and radius.
You can detect infinite cylinders using Cylinder.IsFinite.

Rhino.Geometry.Surface.TryGetCylinder(Rhino.Geometry.Cylinder@,System.Double)
Tests a surface to see if it is a portion of a cylinder and return the infinite cylinder.
cylinder: On success, the cylinder parameters are filled in.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a cylinder.
Remarks:
If successful, an infinite cylinder is returned. When a surface has a cylindrical shape,
even if its ends are not circles on the cylinder, it returns the axis and radius.
You can detect infinite cylinders using Cylinder.IsFinite.

Rhino.Geometry.Surface.TryGetFiniteCylinder(Rhino.Geometry.Cylinder@,System.Double)
Tests a surface with the assumption that it might be a right circular cylinder and returns this geometry.
cylinder: On success, the cylinder parameters are filled in.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a cylinder.
Remarks:
If successful, a finite cylinder is returned.

Rhino.Geometry.Surface.CreatePeriodicSurface(Rhino.Geometry.Surface,System.Int32)
Constructs a periodic surface from a base surface and a direction.
surface: The surface to make periodic.
direction: The direction to make periodic, either 0 = U, or 1 = V.
Returns: A Surface on success or null on failure.

Rhino.Geometry.Surface.CreatePeriodicSurface(Rhino.Geometry.Surface,System.Int32,System.Boolean)
Constructs a periodic surface from a base surface and a direction.
surface: The surface to make periodic.
direction: The direction to make periodic, either 0 = U, or 1 = V.
bSmooth:
Controls kink removal. If true, smooths any kinks in the surface and moves control points
to make a smooth surface. If false, control point locations are not changed or changed minimally
(only one point may move) and only the knot vector is altered.
Returns: A periodic surface if successful, null on failure.

Rhino.Geometry.Surface.CreateSoftEditSurface(Rhino.Geometry.Surface,Rhino.Geometry.Point2d,Rhino.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Boolean)
Creates a soft edited surface from an exising surface using a smooth field of influence.
surface: The surface to soft edit.
uv:
A point in the parameter space to move from. This location on the surface is moved,
and the move is smoothly tapered off with increasing distance along the surface from
this parameter.
delta: The direction and magitude, or maximum distance, of the move.
uLength:
The distance along the surface's u-direction from the editing point over which the
strength of the editing falls off smoothly.
vLength:
The distance along the surface's v-direction from the editing point over which the
strength of the editing falls off smoothly.
tolerance: The active document's model absolute tolerance.
fixEnds: Keeps edge locations fixed.
Returns: The soft edited surface if successful. null on failure.

Rhino.Geometry.Surface.GetSurfaceParameterFromNurbsFormParameter(System.Double,System.Double,System.Double@,System.Double@)
Translates a parameter from a value on the surface returned by Rhino.Geometry.Surface.ToNurbsSurface to the current surface.
nurbsS: The parameter in the S, or sometimes U, direction of the NURBS form surface.
nurbsT: The parameter in the T, or sometimes V, direction of the NURBS form surface.
surfaceS: S on this surface.
surfaceT: T o n this surface.
Returns: True if the operation succeded; otherwise, false.

Rhino.Geometry.Surface.GetNurbsFormParameterFromSurfaceParameter(System.Double,System.Double,System.Double@,System.Double@)
Translates a parameter from the current surface to the parameter space of the surface returned by Rhino.Geometry.Surface.ToNurbsSurface.
surfaceS: The parameter in the S, or sometimes U, direction, of this surface.
surfaceT: The parameter in the T, or sometimes V, direction of this surface.
nurbsS: S on the NURBS form.
nurbsT: T on the NURBS form.
Returns: True if the operation succeded; otherwise, false.