Rhino.Collections.TransformObjectList.Clear
Remove all elements from this list

Rhino.Collections.TransformObjectList.Count
Number of elements in this list

Rhino.Collections.TransformObjectList.GripCount
Number of elements in grip list

Rhino.Collections.TransformObjectList.GripOwnerCount
Number of elements in grip owner list

Rhino.Collections.TransformObjectList.Add(Rhino.DocObjects.RhinoObject)
Add a RhinoObject to this list
rhinoObject:

Rhino.Collections.TransformObjectList.Add(Rhino.DocObjects.ObjRef)
Add an ObjRef to this list. Use this to add Polyedges so the references are properly counted
objref:

Rhino.Collections.TransformObjectList.AddObjects(Rhino.Input.Custom.GetObject,System.Boolean)
Add objects to list with a GetObject
go: Setup the GetObject, ie. prompt, geometry filter, allow pre/post select
before passing it as an argument.
allowGrips: Specifically allow grips to be selected.  if true, grips must also be included in geometry filter
of the GetObject in order to be selected.
Returns: Number of objects selected.

Rhino.Collections.TransformObjectList.GripArray
Gets access to the GripObject array of the TransformObjectList object.
Returns: An array of GripObjects, empty if there were no GripObjects

Rhino.Collections.TransformObjectList.GripOwnerArray
Gets access to the  GripOwner array of the TransformObjectList object.
Returns: An array of GripOwner, empty if there were no GripOwners.
Remarks: Count may not necessarily equal count of GripObjects from GripArray().