Rhino.Geometry.AngularDimension.#ctor(Rhino.Geometry.Arc,System.Double)
Create an angular dimension from a given arc
arc: The start and end points of the arc are the start and endpoints of the dimension
offset: How far to offset the dimension location from the arc

Rhino.Geometry.AngularDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initialize Dimension parameters
dimStyle:
plane:
horizontal:
centerpoint:
defpoint1:
defpoint2:
dimlinepoint:
Returns:

Rhino.Geometry.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Update Dimension geometry from point locations
plane:
centerpoint:
defpoint1:
defpoint2:
dimlinepoint:
Returns:

Rhino.Geometry.AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initialize Dimension parameters
styleId:
plane:
extpoint1:
extpoint2:
dirpoint1:
dirpoint2:
dimlinepoint:
Returns:

Rhino.Geometry.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Update Dimension geometry from point locations
plane:
extpoint1:
extpoint2:
dirpoint1:
dirpoint2:
dimlinepoint:
Returns:

Rhino.Geometry.AngularDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
centerpoint:
defpoint1:
defpoint2:
arrowpoint1:
arrowpoint2:
dimlinepoint:
textpoint:
Returns: