Rhino.Geometry.TextEntity.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)
Create RichText geometry or null if input is invalid
richTextString:
plane:
style:
wrapped:
rectWidth:
rotationRadians:
Returns:

Rhino.Geometry.TextEntity.GetTextTransform(System.Double,Rhino.DocObjects.DimensionStyle)
Get the transform for this text object's text geometry
textscale:
dimstyle:

Rhino.Geometry.TextEntity.CreateSurfaces(Rhino.DocObjects.DimensionStyle,System.Double,System.Double)
Creates planar breps from the outline curves.
dimstyle:
smallCapsScale:  Set to create small caps out of lower case letters.
spacing:  Set to add additional spacing between glyph output.
Returns: An array of planar breps.

Rhino.Geometry.TextEntity.CreatePolySurfaces(Rhino.DocObjects.DimensionStyle,System.Double,System.Double,System.Double)
Creates breps from the outline curves with specified height.
dimstyle:
height:  Height in direction perpedicular to plane of text.
smallCapsScale:  Set to create small caps out of lower case letters.
spacing:  Set to add additional spacing between glyph output.
Returns: An array of planar breps.

Rhino.Geometry.TextEntity.CreateExtrusions(Rhino.DocObjects.DimensionStyle,System.Double,System.Double,System.Double)
Creates extrusions from the outline curves with specified height.
dimstyle:
height:  Height in direction perpedicular to plane of text.
smallCapsScale:  Set to create small caps out of lower case letters.
spacing:  Set to add additional spacing between glyph output.
Returns: An array of planar breps.

Rhino.Geometry.TextEntity.CreateCurves(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)
Returns the outline curves.
dimstyle:
bAllowOpen:  Set to true to prevent forced closing of open curves retrieved from glyphs.
smallCapsScale:  Set to create small caps out of lower case letters.
spacing:  Set to add additional spacing between glyph output.
Returns: An array of curves that forms the outline or content of this text entity.