Rhino.Geometry.Quaternion.EpsilonEquals(Rhino.Geometry.Quaternion,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:

Rhino.Geometry.Quaternion.Length
Returns the length or norm of the quaternion.
Math.Sqrt(a*a + b*b + c*c + d*d)

Rhino.Geometry.Quaternion.DistanceTo(Rhino.Geometry.Quaternion)
Computes the distance or norm of the difference between this and another quaternion.
q: Another quaternion.
Returns: (this - q).Length.

Rhino.Geometry.Quaternion.Distance(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Returns the distance or norm of the difference between two quaternions.
p: A quaternion.
q: Another quaternion.
Returns: (p - q).Length()

Rhino.Geometry.Quaternion.Unitize
Scales the quaternion's coordinates so that a*a + b*b + c*c + d*d = 1.
Returns:
true if successful.  false if the quaternion is zero and cannot be unitized.

Rhino.Geometry.Quaternion.SetRotation(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Sets the quaternion to the unit quaternion which rotates
plane0.xaxis to plane1.xaxis, plane0.yaxis to plane1.yaxis,
and plane0.zaxis to plane1.zaxis.
plane0: The "from" rotation plane. Origin point is ignored.
plane1: The "to" rotation plane. Origin point is ignored.
Remarks: The plane origins are ignored

Rhino.Geometry.Quaternion.Rotation(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Returns the unit quaternion that represents the the rotation that maps
plane0.xaxis to plane1.xaxis, plane0.yaxis to plane1.yaxis, and
plane0.zaxis to plane1.zaxis.
plane0: The first plane.
plane1: The second plane.
Returns: A quaternion value.
Remarks: The plane origins are ignored

Rhino.Geometry.Quaternion.GetRotation(System.Double@,Rhino.Geometry.Vector3d@)
Returns the rotation defined by the quaternion.
angle: An angle in radians.
axis: unit axis of rotation of 0 if (b,c,d) is the zero vector.
Returns: True if the operation succeeded; otherwise, false.
Remarks:
If the quaternion is not unitized, the rotation of its unitized form is returned.

Rhino.Geometry.Quaternion.GetRotation(Rhino.Geometry.Plane@)
Returns the frame created by applying the quaternion's rotation
to the canonical world frame (1,0,0),(0,1,0),(0,0,1).
plane: A plane. This out value will be assigned during this call.
Returns: true if the operation succeeded; otherwise, false.

Rhino.Geometry.Quaternion.Rotate(Rhino.Geometry.Vector3d)
Rotates a 3d vector. This operation is also called conjugation,
because the result is the same as
(q.Conjugate()*(0,x,y,x)*q/q.LengthSquared).Vector.
v: The vector to be rotated.
Returns:
R*v, where R is the rotation defined by the unit quaternion.
This is mathematically the same as the values
(Inverse(q)*(0,x,y,z)*q).Vector
and
(q.Conjugate()*(0,x,y,x)*q/q.LengthSquared).Vector.
Remarks:
If you need to rotate more than a dozen or so vectors,
it will be more efficient to calculate the rotation
matrix once and use it repeatedly.