Rhino.Render.City.Name
Gets name of city.

Rhino.Render.City.Latitude
Gets latitude of city.

Rhino.Render.City.Longitude
Gets longitude of city.

Rhino.Render.City.TimeZone
Gets time zone of city.

Rhino.Render.City.FindNearest(System.Double,System.Double)
Finds nearest city of specified input parameters.
latitude: latitude.
longitude: longitude.
Returns: Nearest city.

Rhino.Render.City.Cities
Returns number of available cities.
Returns: City count.

Rhino.Render.City.CityAt(System.Int32)
Returns city at given index.
index: index.
Returns: City at index.