Rhino.Geometry.AreaMassProperties.Compute(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Computes the Area properties for a collection of geometric objects.
At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
geometry: Objects to include in the area computation.
Returns: The Area properties for the entire collection or null on failure.