Rhino.Geometry.Light.CreateSunLight(System.Double,System.Double,System.Double)
Constructs a light that represents the Sun.
northAngleDegrees: The angle of North in degrees. North is the angle between positive World Y axis and model North, as measured on World XY plane.
azimuthDegrees: The Azimuth angle value in degrees. Azimuth is the compass angle from North.
altitudeDegrees: The Altitude angle in degrees. Altitude is the angle above the ground plane.
Returns: A new sun light.
Throws Rhino.Runtime.RdkNotLoadedException: If the RDK is not loaded.

Rhino.Geometry.Light.CreateSunLight(System.Double,System.DateTime,System.Double,System.Double)
Constructs a light which simulates the Sun based on a given time and location on Earth.
northAngleDegrees: The angle of North in degrees. North is the angle between positive World Y axis and model North, as measured on World XY plane.
when: The time of the measurement. The Kind property of DateTime specifies whether this is in local or universal time.
Local and Undefined daytime kinds in this argument are considered local.
latitudeDegrees: The latitude, in degrees, of the location on Earth.
longitudeDegrees: The longitude, in degrees, of the location on Earth.
Returns: A newly constructed light object.
Throws Rhino.Runtime.RdkNotLoadedException: If the RDK is not loaded.

Rhino.Geometry.Light.CreateSunLight(Rhino.Render.Sun)
Constructs a light which simulates a Rhino.Render.Sun.
sun: A Sun object from the Rhino.Render namespace.
Returns: A light.

Rhino.Geometry.Light.CoordinateSystem
Gets a value, determined by LightStyle, that explains whether
the camera directions are relative to World or Camera spaces.

Rhino.Geometry.Light.AttenuationVector
Gets or Sets the attenuation vector.

Rhino.Geometry.Light.ShadowIntensity
Gets or sets the shadow intensity for the light.

Rhino.Geometry.Light.Id
Gets the ID of this light.