Rhino.Geometry.Hatch.Create(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Double,System.Double,System.Double)
Constructs an array of hatches from a set of curves.
curves: An array, a list or any enumarable set of Rhino.Geometry.Curve.
hatchPatternIndex: The index of the hatch pattern in the document hatch pattern table.
rotationRadians: The relative rotation of the pattern.
scale: A scaling factor.
tolerance:
Returns: An array of hatches. The array might be empty on error.
Throws System.ArgumentNullException: If curves is null.

Rhino.Geometry.Hatch.Create(Rhino.Geometry.Curve,System.Int32,System.Double,System.Double,System.Double)
Constructs an array of hatches from one curve.
curve: A Rhino.Geometry.Curve.
hatchPatternIndex: The index of the hatch pattern in the document hatch pattern table.
rotationRadians: The relative rotation of the pattern.
scale: A scaling factor.
tolerance:
Returns: An array of hatches. The array might be empty on error.

Rhino.Geometry.Hatch.CreateDisplayGeometry(Rhino.DocObjects.HatchPattern,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Line[]@,Rhino.Geometry.Brep@)
Generate geometry that would be used to draw the hatch with a given hatch pattern
pattern:
patternScale:
bounds:
lines:
solidBrep: