Rhino.Geometry.Collections.BrepVertexList.Count
Gets the number of brep vertices.

Rhino.Geometry.Collections.BrepVertexList.Add
Create and add a new vertex to this list
Returns:

Rhino.Geometry.Collections.BrepVertexList.Add(Rhino.Geometry.Point3d,System.Double)
Create and add a new vertex to this list
point:
vertexTolerance: Use RhinoMath.UnsetTolerance if you are unsure
Returns:

Rhino.Geometry.Collections.BrepVertexList.AddPointOnFace(Rhino.Geometry.BrepFace,System.Double,System.Double)
Adds a new point on face to the brep
face: face that vertex lies on
s: surface parameters
t: surface parameters
Returns: new vertex that represents the point on face
Remarks:
If a vertex is a point on a face, then brep.Edges[m_ei] will
be an edge with no 3d curve.  This edge will have a single
trim with type ON_BrepTrim::ptonsrf.  There will be a loop
containing this single trim.

Rhino.Geometry.Collections.BrepVertexList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.BrepVertexList.GetEnumerator.
Returns: The enumerator.

Rhino.Geometry.Collections.BrepVertexList.GetEnumerator
Gets an enumerator that visits all surfaces.
Returns: The enumerator.