Rhino.Geometry.Arc.EpsilonEquals(Rhino.Geometry.Arc,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:

Rhino.Geometry.Arc.ToNurbsCurve(System.Int32,System.Int32)
Create a uniform non-ratonal cubic NURBS approximation of an arc.
degree: >=1
cvCount: cv count >=5
Returns: NURBS curve approximation of an arc on success