Rhino.DocObjects.GripObject.GetGripDirections(Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)
Sometimes grips have directions.  These directions
can have any length and do not have to be orthoganal.
u:  u direction
v:  v direction
normal:  normal direction
Returns: True if the grip has directions.

Rhino.DocObjects.GripObject.GetSurfaceParameters(System.Double@,System.Double@)
Retrieves the 2d parameter space values of this GripObject from the surface it's associated with.
u:
v:
Returns: True on success. Output is unreliable if return is false.

Rhino.DocObjects.GripObject.GetCageParameters(System.Double@,System.Double@,System.Double@)
Retrieves the 2d parameter space values of this GripObject from the cage it's associated with.
u:
v:
w:
Returns: True on success. Output is unreliable if return is false.

Rhino.DocObjects.GripObject.GetCurveParameters(System.Double@)
Retrieves the 2d parameter space values of this GripObject from the curve it's associated with.
t:
Returns: True on success. Output is unreliable if return is false.