Rhino.PlugIns.LicenseUtils.ShowRhinoExpiredMessage(Rhino.Runtime.Mode,System.Int32@)
Show Rhino or Beta expired message
mode:
result:
Returns:

Rhino.PlugIns.LicenseUtils.Echo(System.String)
Test connectivity with the Zoo.

Rhino.PlugIns.LicenseUtils.GetLicense(System.String,System.Guid,System.Int32,System.String,Rhino.PlugIns.LicenseCapabilities,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate)
20-May-2013 Dale Fugier
This (internal) version of Rhino.PlugIns.LicenseUtils.GetLicense
is used by Rhino.PlugIns.PlugIn objects.

Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid)
This version of Rhino.PlugIns.LicenseUtils.GetLicense
is used by Rhino C++ plug-ins.

Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid)
This version of Rhino.PlugIns.LicenseUtils.AskUserForLicense
is used by Rhino C++ plug-ins.

Rhino.PlugIns.LicenseUtils.DeleteLicense(System.Guid)
Deletes a license along with its license file.

Rhino.PlugIns.LicenseUtils.GetLicenseType(System.Guid)
Returns the contentType of a specified product license

Rhino.PlugIns.LicenseUtils.GetOneLicenseStatus(System.Guid)
Returns the current status of a license for ui purposes.

Rhino.PlugIns.LicenseUtils.GetLicenseCapabilities(System.Int32)
Converts an integer to a LicenseCapabilities flag