Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String)
Public constructor
productLicense: License string to be saved by ZooClient
serialNumber: Serial number to be displayed to end user
licenseTitle: Title of license (Rhino 6.0 Evaluation)

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String,Rhino.PlugIns.LicenseBuildType)
Public constructor
productLicense: License string to be saved by ZooClient
serialNumber: Serial number to be displayed to end user
licenseTitle: Title of license (Rhino 6.0 Evaluation)
buildType: A LicenseBuildType value

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String,Rhino.PlugIns.LicenseBuildType,System.Int32)
Public constructor
productLicense: License string to be saved by ZooClient
serialNumber: Serial number to be displayed to end user
licenseTitle: Title of license (Rhino 6.0 Evaluation)
buildType: A LicenseBuildType value
licenseCount: Number of licenses represented by this string. Allows the Zoo to hand out multiple license keys when greater than 1.

Rhino.PlugIns.LicenseData.LicenseTitle
The title of the license.
This is provided by the plugin that validated the license.
(e.g. "Rhinoceros 6.0 Commercial")

Rhino.PlugIns.LicenseData.RequiresOnlineValidation
Set to true if this license requires online validation.
Caller must also pass VerifyOnlineValidationCodeDelegate to GetLicense/AskUserForLicense

Rhino.PlugIns.LicenseData.IsUpgradeFromPreviousVersion
Set to true if this license requires a previous version license to be entered.
Caller must also pass VerifyPreviousVersionLicenseDelegate to GetLicense/AskUserForLicense.

Rhino.PlugIns.LicenseData.ErrorMessage
Error message set by calls to callback functions