Rhino.PlugIns.CustomRenderSaveFileTypes.RegisterFileType(System.Collections.Generic.IEnumerable{System.String},System.String,Rhino.PlugIns.CustomRenderSaveFileTypes.SaveFileHandler)
Call this method to register a custom file save type with the render
output window save dialog.
extensions:
List of one or more file extension associated with this custom type,
for example: hdr, hdri
description:
File extension description which appears in the file save dialog file
type combo box.
Called by the rendered scene to write the save file.
saveFileHandler: