Rhino.ScaleValue.#ctor
Default constructor

Rhino.ScaleValue.OneToOne
Make a new ScaleValue set to OneToOne
Returns:

Rhino.ScaleValue.Create(System.String,Rhino.Input.StringParserSettings)
Create from string
ps:
s:

Rhino.ScaleValue.Create(Rhino.LengthValue,Rhino.LengthValue,Rhino.ScaleValue.ScaleStringFormat)
Create from 2 length values
left:
right:
format:

Rhino.ScaleValue.Dispose
actively reclaim native allocated ON_SacleValue*

Rhino.ScaleValue.IsUnset
Test IsUnset
Returns:

Rhino.ScaleValue.LeftLengthValue
Get the Left LengthValue from Scale
Returns:

Rhino.ScaleValue.RightLengthValue
Get the Right LengthValue from Scale
Returns:

Rhino.ScaleValue.LeftToRightScale
LeftLengthValue / RightLengthValue

Rhino.ScaleValue.RightToLeftScale
RightLengthValue / LeftLengthValue