Rhino.Geometry.Morphs.TwistSpaceMorph.#ctor
Constructs a twist space morph.

Rhino.Geometry.Morphs.TwistSpaceMorph.TwistAxis
Axis to rotate about.

Rhino.Geometry.Morphs.TwistSpaceMorph.TwistAngleRadians
Twist angle in radians.

Rhino.Geometry.Morphs.TwistSpaceMorph.InfiniteTwist
If true, the deformation is constant throughout the object, even if the axis is shorter than the object.
If false, the deformation takes place only the length of the axis.

Rhino.Geometry.Morphs.TwistSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point. This method is abstract.
point: A point that will be morphed by this function.
Returns: Resulting morphed point.

Rhino.Geometry.Morphs.TwistSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.