Rhino.Geometry.InstanceReferenceGeometry.#ctor(System.Guid,Rhino.Geometry.Transform)
Constructor used when creating nested instance references.
instanceDefinitionId:
transform:

Rhino.Geometry.InstanceReferenceGeometry.ParentIdefId
The unique id for the parent instance definition of this instance reference.

Rhino.Geometry.InstanceReferenceGeometry.Xform
Transformation for this reference.