Rhino.Render.Sun.Changed
This event is raised when a Sun property value is changed.

Rhino.Render.Sun.#ctor
Create a non-document controlled Sun

Rhino.Render.Sun.Enabled
Turn the sun on/off in this document.

Rhino.Render.Sun.ManualControl
Set angles directly or use place/date/time

Rhino.Render.Sun.SkylightOn
Turn skylight on or off.

Rhino.Render.Sun.DaylightSaving
Daylight savings time

Rhino.Render.Sun.DaylightSavingMinutes
Daylight saving minutes

Rhino.Render.Sun.TimeZone
Measured in hours += UTC

Rhino.Render.Sun.North
Angle in degrees on world X-Y plane that should be considered north in the model. Angle is
measured starting at X-Axis and travels counterclockwise. Y-Axis would be a north angle of 90
degrees.

Rhino.Render.Sun.Light
Get a Light which represents the sun. If manual control is in effect, no sun calculation
is performed; the function uses the values last used in calls to Azimuth, Altitude
or Vector. If manual control is not in effect, the observer's position, date, time,
time zone and daylight saving values are used to calculate the position of the sun.

Rhino.Render.Sun.SetPosition(System.Double,System.Double)
Sets position of the Sun based on azimuth and altitude values.
azimuthDegrees: The azimuth sun angle in degrees.
altitudeDegrees: The altitude sun angle in degrees.

Rhino.Render.Sun.SetPosition(System.DateTime,System.Double,System.Double)
Sets position of the sun based on physical location and time.
when: A System.DateTime instance.
If the date Kind is DateTimeKind.Local,
or DateTimeKind.Unspecified, the date is considered local.
latitudeDegrees: The latitude, in degrees, of the location on Earth.
longitudeDegrees: The longitude, in degrees, of the location on Earth.

Rhino.Render.Sun.ShowDialog
Show the tabbed sun dialog.

Rhino.Render.Sun.ColorFromAltitude(System.Double)
Get sun color based on altitude.
altitudeDegrees: The altitude sun angle in degrees.
Returns:
Returns color for altitude.