Rhino.Render.RenderContentType.GetAllAvailableTypes
Gets an array of all available render content types registered with Rhino.
Returns: An array with all types.

Rhino.Render.RenderContentType.NewRenderContent
Returns a new instance of the render content of this type.  This content can be added to a persistant list.
Returns: A new render content instance.

Rhino.Render.RenderContentType.NewContentFromTypeId(System.Guid)
Create a new content specified by the Guid.
This function can be used to create temporary content, as it calls
::RhRdkContentFactories().NewContentFromType().
typeId:
Returns:

Rhino.Render.RenderContentType.Id
Returns the type identifier associated with this type.

Rhino.Render.RenderContentType.InternalName
Returns the internal name identifier associated with this type.