Rhino.Geometry.Collections.BrepEdgeList.Add(System.Int32)
Create and add a new edge to this list
curve3dIndex:
Returns:

Rhino.Geometry.Collections.BrepEdgeList.Add(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepVertex,System.Int32,Rhino.Geometry.Interval,System.Double)
Create and add a new edge to this list
startVertex:
endVertex:
curve3dIndex:
subDomain:
edgeTolerance:
Returns:

Rhino.Geometry.Collections.BrepEdgeList.Add(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepVertex,System.Int32,System.Double)
Create and add a new edge to this list
startVertex:
endVertex:
curve3dIndex:
edgeTolerance:
Returns:

Rhino.Geometry.Collections.BrepEdgeList.Add(System.Int32,System.Int32,System.Int32,Rhino.Geometry.Interval,System.Double)
Create and add a new edge to this list
startVertexIndex:
endVertexIndex:
curve3dIndex:
subDomain:
edgeTolerance:
Returns:

Rhino.Geometry.Collections.BrepEdgeList.Add(System.Int32,System.Int32,System.Int32,System.Double)
Create and add a new edge to this list
startVertexIndex:
endVertexIndex:
curve3dIndex:
edgeTolerance:
Returns: