Rhino.Geometry.Polyline.ToPolylineCurve
Constructs a polyline curve representation of this polyline.
Returns: A curve shaped like this polyline or null on failure.

Rhino.Geometry.Polyline.Duplicate
Returns a deep copy of this polyline instance.
Returns: The duplicated polyline.