Rhino.Geometry.Morphs.FlowSpaceMorph.#ctor(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean)
Constructs a flow space morph.
curve0: Base curve.
curve1: Target curve.
preventStretching:

Rhino.Geometry.Morphs.FlowSpaceMorph.#ctor(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
Constructs a flow space morph.
curve0: Base curve.
curve1: Target curve.
reverseCurve0: If true, then direction of curve0 is reversed.
reverseCurve1: If true, then direction of curve1 is reversed.
preventStretching: If true, the length of the objects along the curve directions are not changed. If false, objects are stretched or compressed in the curve direction so that the relationship to the target curve is the same as it is to the base curve.

Rhino.Geometry.Morphs.FlowSpaceMorph.IsValid
Returns true if the space morph definition is valid, false otherwise.

Rhino.Geometry.Morphs.FlowSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point.
point: A point that will be morphed by this object.
Returns: Resulting morphed point.

Rhino.Geometry.Morphs.FlowSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.