Rhino.FileIO.File3dm.Read(System.String)
Reads a 3dm file from a specified location.
path: The file to read.
Returns: new File3dm on success, null on error.
Throws System.IO.FileNotFoundException: If path does not exist.

Rhino.FileIO.File3dm.Read(System.String,Rhino.FileIO.File3dm.TableTypeFilter,Rhino.FileIO.File3dm.ObjectTypeFilter)
Reads a 3dm file from a specified location.
path: The file to read.
tableTypeFilterFilter:
If tableTypeFilterFilter is None, then everything in the archive is read.
Otherwise tableTypeFilterFilter identifies what tables should be read.
objectTypeFilter:
If objectTypeFilter is not None, then is a filter made by bitwise oring
values to select which types of objects will be read from the model object
table.
Returns: new File3dm on success, null on error.
Throws System.IO.FileNotFoundException: If path does not exist.

Rhino.FileIO.File3dm.ReadWithLog(System.String,Rhino.FileIO.File3dm.TableTypeFilter,Rhino.FileIO.File3dm.ObjectTypeFilter,System.String@)
Reads a 3dm file from a specified location.
path: The file to read.
tableTypeFilterFilter:
If tableTypeFilterFilter is None, then everything in the archive is read.
Otherwise tableTypeFilterFilter identifies what tables should be read.
objectTypeFilter:
If objectTypeFilter is not None, then is a filter made by bitwise oring
values to select which types of objects will be read from the model object
table.
errorLog: Any archive reading errors are logged here.
Returns: new File3dm on success, null on error.
Throws System.IO.FileNotFoundException: If path does not exist.

Rhino.FileIO.File3dm.ReadWithLog(System.String,System.String@)
Read a 3dm file from a specified location and log any archive
reading errors.
path: The file to read.
errorLog: Any archive reading errors are logged here.
Returns: New File3dm on success, null on error.
Throws System.IO.FileNotFoundException: If path does not exist.

Rhino.FileIO.File3dm.ReadArchiveVersion(System.String)
Reads only the archive 3dm version from an existing 3dm file.
path: The file from which to read the archive version.
Returns: The 3dm file archive version.
Throws System.IO.FileNotFoundException: If path does not exist, is null or cannot be accessed because of permissions.

Rhino.FileIO.File3dm.ReadRevisionHistory(System.String,System.String@,System.String@,System.Int32@,System.DateTime@,System.DateTime@)
Quickly check a file for it's revision information.  This function does
not read the entire file, just what it needs to get revision information out
path: path to the 3dm file
createdBy: original author of the file
lastEditedBy: last person to edit the file
revision: which revision this file is at
createdOn: date file was created (DateTime.MinValue if not set in file)
lastEditedOn: date file was last edited (DateTime.MinValue if not set in file)
Returns: true on success

Rhino.FileIO.File3dm.ReadDimensionStyles(System.String)
Read the dimension styles table out of a 3dm file.
path: The location of the file.
Throws System.IO.FileNotFoundException: If the provided path is null, does not exist or cannot be accessed.
Returns:
Array of dimension styles on success (empty array if file does not contain dimension styles)
null on error

Rhino.FileIO.File3dm.Write(System.String,System.Int32)
Writes contents of this model to an openNURBS archive.
If the model is not valid, then Write will refuse to write it.
path: The file name to use for writing.
version:
Version of the openNURBS archive to write.  Must be [2; current version].
Rhino can read its current version, plus earlier file versions except 1.
Use latest version when possible.
Alternatively, 0 is a placeholder for the last valid version.
Returns:
true if archive is written with no error.
false if errors occur.

Rhino.FileIO.File3dm.Write(System.String,Rhino.FileIO.File3dmWriteOptions)
Writes contents of this model to an openNURBS archive.
If the model is not valid, then Write will refuse to write it.
path: The file name to use for writing.
options: An options instance, or null for default.
Returns:
true if archive is written with no error.
false if errors occur.

Rhino.FileIO.File3dm.WriteWithLog(System.String,System.Int32,System.String@)
Writes contents of this model to an openNURBS archive.
If the model is not valid, then Write will refuse to write it.
path: The file name to use for writing.
version:
Version of the openNURBS archive to write.  Must be [2; current version].
Rhino can read its current version, plus earlier file versions except 1.
Use latest version when possible.
Alternatively, 0 is a placeholder for the last valid version.
errorLog: This argument will be filled by out reference.
Returns:
true if archive is written with no error.
false if errors occur.

Rhino.FileIO.File3dm.WriteWithLog(System.String,Rhino.FileIO.File3dmWriteOptions,System.String@)
Writes contents of this model to an openNURBS archive.
If the model is not valid, then Write will refuse to write it.
path: The file name to use for writing.
options: An options instance, or null for default.
errorLog: This argument will be filled by out reference.
Returns:
true if archive is written with no error.
false if errors occur.

Rhino.FileIO.File3dm.IsValid(System.String@)
The File3dm object is kept consistent during its creation.
Therefore, this function now returns only true.
errors:
No errors are found.
Returns: true in any case.

Rhino.FileIO.File3dm.IsValid(Rhino.FileIO.TextLog)
The File3dm object is kept consistent during its creation.
Therefore, this function now returns only true.
errors:
No errors are found.
Returns: >true in any case.

Rhino.FileIO.File3dm.Polish
This function is only kept for forward assembly compatibility.

Rhino.FileIO.File3dm.Audit(System.Boolean,System.Int32@,System.String@,System.Int32[]@)
This function is only kept for forward assembly compatibility.
attemptRepair:
Ignored.
repairCount: Is set to 0.
errors:
Contains no meaninful error.
warnings: Is set to null.
Returns:
Returns 0.

Rhino.FileIO.File3dm.Created
Get the DateTime that this file was originally created. If the
value is not set in the 3dm file, then DateTime.MinValue is returned

Rhino.FileIO.File3dm.LastEdited
Get the DateTime that this file was last edited. If the
value is not set in the 3dm file, then DateTime.MinValue is returned

Rhino.FileIO.File3dm.GetPreviewImage
Preview image used for file explorer

Rhino.FileIO.File3dm.SetPreviewImage(System.Drawing.Bitmap)
Preview image used for file explorer

Rhino.FileIO.File3dm.Manifest
Retrieves the manifest with all object descriptions in this file.

Rhino.FileIO.File3dm.AllMaterials
Materials in this file.

Rhino.FileIO.File3dm.AllLinetypes
Linetypes in this file.

Rhino.FileIO.File3dm.AllLayers
Layers in this file.

Rhino.FileIO.File3dm.DimStyles
Dimension Styles in this file.

Rhino.FileIO.File3dm.AllDimStyles
Dimension Styles in this file.

Rhino.FileIO.File3dm.AllHatchPatterns
Hatch patterns in this file.

Rhino.FileIO.File3dm.InstanceDefinitions
Instance definitions in this file.

Rhino.FileIO.File3dm.AllInstanceDefinitions
Instance definitions in this file

Rhino.FileIO.File3dm.AllNamedViews
Named view list

Rhino.FileIO.File3dm.Strings
Document user strings in this file

Rhino.FileIO.File3dm.DumpToTextLog(Rhino.FileIO.TextLog)
Prepares a text dump of the entire model.
log: