Rhino.Render.RdkUndoRecord.#ctor(System.IntPtr)
Constructor for RdkUndoRecord

Rhino.Render.RdkUndoRecord.Dispose
Dispose for RdkUndoRecord

Rhino.Render.RdkUndoRecord.SetDescription(System.String)
Set description for RdkUndoRecord