Rhino.Geometry.Collections.MeshVertexNormalList.Capacity
Gets or sets the amount of vertex normals that the list can hold without resizing.

Rhino.Geometry.Collections.MeshVertexNormalList.Destroy
Releases all memory allocated to store vertex normals. The list capacity will be 0 after this call.
Subsequent calls can add new items.

Rhino.Geometry.Collections.MeshVertexNormalList.ToFloatArray
Copies all vertex normals to a linear array of float in x,y,z order
Returns: The float array.