Rhino.Geometry.Collections.BrepTrimList.Count
Gets the number of brep trims.

Rhino.Geometry.Collections.BrepTrimList.Add(System.Int32)
Add a new trim that will be part of an inner, outer, or slit loop
to the brep.
curve2dIndex: index of 2d trimming curve
Returns: New Trim
Remarks:
You should set the trim's tolerance, type, iso, li, and m_ei values.
In general, you should try to use the
Add( edge, bRev3d, loop, c2i ) version of NewTrim.
If you want to add a singular trim, use AddSingularTrim.
If you want to add a crvonsrf trim, use AddCurveOnFace.
If you want to add a ptonsrf trim, use AddPointOnFace.

Rhino.Geometry.Collections.BrepTrimList.Add(System.Boolean,Rhino.Geometry.BrepLoop,System.Int32)
Add a new trim that will be part of an inner, outer, or slit loop
to the brep
rev3d:
true if the edge and trim have opposite directions
loop: trim is appended to this loop
curve2dIndex: index of 2d trimming curve
Returns: new trim

Rhino.Geometry.Collections.BrepTrimList.Add(System.Boolean,Rhino.Geometry.BrepEdge,System.Int32)
Add a new trim that will be part of an inner, outer, or slit loop
to the brep
rev3d:
true if the edge and trim have opposite directions
edge: 3d edge associated with this trim
curve2dIndex: index of 2d trimming curve
Returns: new trim

Rhino.Geometry.Collections.BrepTrimList.Add(Rhino.Geometry.BrepEdge,System.Boolean,Rhino.Geometry.BrepLoop,System.Int32)
Add a new trim that will be part of an inner, outer, or slit loop
to the brep.
edge: 3d edge associated with this trim
rev3d:
true if the edge and trim have opposite directions
loop: trim is appended to this loop
curve2dIndex: index of 2d trimming curve
Returns: new trim

Rhino.Geometry.Collections.BrepTrimList.AddSingularTrim(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepLoop,Rhino.Geometry.IsoStatus,System.Int32)
Add a new singular trim to the brep.
vertex: vertex along collapsed surface edge
loop: trim is appended to this loop
iso:
curve2dIndex: index of 2d trimming curve
Returns: new trim

Rhino.Geometry.Collections.BrepTrimList.AddCurveOnFace(Rhino.Geometry.BrepFace,Rhino.Geometry.BrepEdge,System.Boolean,System.Int32)
Add a new curve on face to the brep
face: face that curve lies on
edge: 3d edge associated with this curve on surface
rev3d:
true if the 3d edge and the 2d parameter space curve have opposite directions.
curve2dIndex: index of 2d curve in face's parameter space
Returns: new trim that represents the curve on surface
Remarks:
You should set the trim's tolerance and iso values.

Rhino.Geometry.Collections.BrepTrimList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.BrepTrimList.GetEnumerator.
Returns: The enumerator.

Rhino.Geometry.Collections.BrepTrimList.GetEnumerator
Gets an enumerator that visits all edges.
Returns: The enumerator.