Rhino.DocObjects.Tables.GroupTable.Find(System.String)
Finds a group with a given name.
groupName:
Name of group to search for. Ignores case.
Returns:
>=0 index of the group with the given name.
UnsetIntIndex no group found with the given name.

Rhino.DocObjects.Tables.GroupTable.Find(System.String,System.Boolean)
Finds a group with a given name.
groupName:
Name of group to search for. Ignores case.
ignoreDeletedGroups:
This parameter is ignored. Deleted groups are never searched.
Returns:
>=0 index of the group with the given name.
-1 no group found with the given name.

Rhino.DocObjects.Tables.GroupTable.FindName(System.String)
Finds a Linetype given its name. Returns the instance, rather than the index.
name: The name of the Linetype to be searched.
Returns: An Linetype, or null on error.

Rhino.DocObjects.Tables.GroupTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a Linetype given its name hash.
nameHash: The name hash of the Linetype to be searched.
Returns: An Linetype, or null on error.

Rhino.DocObjects.Tables.GroupTable.FindIndex(System.Int32)
Retrieves a Group object based on Index. This seach type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Group object, or null if none was found.