Rhino.Render.SceneServerData.CppPointer
The CppPointer of SceneServerData

Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewGeometry,Rhino.Render.PreviewBackground,Rhino.Render.PreviewLighting,Rhino.Render.SceneServerDataUsage)
Constructor for SceneServerData

Rhino.Render.SceneServerData.Dispose
Dispose for SceneServerData