Rhino.Geometry.Collections.MeshFaceList.Capacity
Gets or sets the total number of mesh triangles and quads the internal data structure can hold without resizing.

Rhino.Geometry.Collections.MeshFaceList.Destroy
Releases all memory allocated to store faces. The list capacity will be 0 after this call.
Subsequent calls can add new items.

Rhino.Geometry.Collections.MeshFaceList.GetFaceAspectRatio(System.Int32)
Returns the mesh face at the given index.
index: Index of face to get. Must be larger than or equal to zero and
smaller than the Face Count of the mesh.
Returns: The mesh face at the given index on success or MeshFace.Unset if the index is out of range.

Rhino.Geometry.Collections.MeshFaceList.GetFaceCenter(System.Int32)
Gets the center point of a face.
For a triangular face, this is the centroid or barycenter.
For a quad, this is the avarage of four coner points.
faceIndex: A face index.
Returns: The center point.

Rhino.Geometry.Collections.MeshFaceList.ToIntArray(System.Boolean)
Copies all of the faces to a linear array of indices.
Returns: The int array. This method never returns null.
asTriangles: If set to true as triangles.

Rhino.Geometry.Collections.MeshFaceList.ConvertNonPlanarQuadsToTriangles(System.Double,System.Double,System.Int32)
Splits non-planar quads into two triangles based on given params.
planarTolerance:
If planarTolerance >= 0, then a quad is split if its vertices
are not coplanar.
If both planarTolerance = Rhino.RhinoMath.UnsetValue and
angleToleranceRadians >= 0.0, then the planarity test is skipped.
angleToleranceRadians:
If angleToleranceRadians >= 0.0, then a quad is split if the
angle between opposite corner normals is > angleToleranceRadians.
The corner normal is the normal to the triangle formed by two
adjacent edges and the diagonal connecting their endpoints.
A quad has four corner normals.
If both angleToleranceRadians = Rhino.RhinoMath.UnsetValue and planarTolerance >= 0.0,
then the corner normal angle test is skipped.
splitMethod:
0 default
Currently divides along the short diagonal. This may be
changed as better methods are found or preferences change.
By passing zero, you let the developers of this code
decide what's best for you over time.
1 divide along the short diagonal
2 divide along the long diagonal
3 minimize resulting area
4 maximize resulting area
5 minimize angle between triangle normals
6 maximize angle between triangle normals
Returns: Number of quads that were converted to triangles.
Remarks:
If both planarTolerance = Rhino.RhinoMath.UnsetValue and angleToleranceRadians = Rhino.RhinoMath.UnsetValue,
then all quads are split.

Rhino.Geometry.Collections.MeshFaceList.GetClashingFacePairs(System.Int32)
Gets an array of pairs of mesh faces that clash.
maxPairCount:
If >0, then at most this many pairs will be added to the output array.
If <=0, then all clashing pairs will be added to the output array.
Returns: Array of pairs of mesh face indices.

Rhino.Geometry.Collections.MeshFaceList.GetConnectedFaces(System.Int32,System.Double,System.Boolean)
Find all connected face indices where adjacent face normals meet
the criteria of angleRadians and greaterThanAngle
faceIndex: face index to start from
angleRadians: angle to use for comparison of what is connected
greaterThanAngle:
If true angles greater than or equal to are considered connected.
If false, angles less than or equal to are considerd connected.
Returns: list of connected face indices

Rhino.Geometry.Collections.MeshFaceList.GetConnectedFacesToEdges(System.Int32,System.Boolean)
Uses startFaceIndex and finds all connected face indexes up to unwelded
or naked edges. If treatNonmanifoldLikeUnwelded is true then non-manifold
edges will be considered as unwelded or naked
startFaceIndex: Initial face index
treatNonmanifoldLikeUnwelded:
True means non-manifold edges will be handled like unwelded edges,
False means they aren't considered
Returns: Array of connected face indexes

Rhino.Geometry.Collections.MeshFaceList.GetZeroAreaFaces(System.Int32[]@,System.Int32[]@)
Examines and adds face indexes to whollyDegenerateFaces if the face is a triangle with zero area or a quad both triangles have zero area.
Face indexes are added to partiallyDegenerateFaces when a quad has one triangle with zero area.
whollyDegenerateFaces: Array of indexes for faces, both triangles and quads, that have zero area.
partiallyDegenerateFaces: Array of indexes for quad faces, that have one triangle with zero area.
Returns: Returns true if the mesh has wholly or partially degenerate faces, false otherwise.

Rhino.Geometry.Collections.MeshFaceList.RemoveZeroAreaFaces(System.Int32@)
Deletes or fixes mesh faces that have zero area.
fixedFaceCount: Number of fixed partially degenerate faces.
Returns: Number of removed wholly degenerate faces.

Rhino.Geometry.Collections.MeshFaceList.GetDuplicateFaces
Finds all of the duplicate faces.
Returns:
The indexes that are duplicates of other indexes if successful.
If there are no duplicate, then an empty array is returned.

Rhino.Geometry.Collections.MeshFaceList.ExtractDuplicateFaces
Extracts, or removes, duplicate faces.
Returns: A mesh containing the extracted duplicate faces if successful, null otherwise.

Rhino.Geometry.Collections.MeshFaceList.ExtractFaces(System.Collections.Generic.IEnumerable{System.Int32})
Extracts, or removes, faces.
faceIndices: The face indices to be extracted.
Returns: A mesh containing the extracted faces if successful, null otherwise.