Rhino.Geometry.Mesh.CreateFromBox(Rhino.Geometry.BoundingBox,System.Int32,System.Int32,System.Int32)
Constructs new mesh that matches a bounding box.
box: A box to use for creation.
xCount: Number of faces in x-direction.
yCount: Number of faces in y-direction.
zCount: Number of faces in z-direction.
Returns: A new brep, or null on failure.

Rhino.Geometry.Mesh.CreateFromBox(Rhino.Geometry.Box,System.Int32,System.Int32,System.Int32)
Constructs new mesh that matches an aligned box.
box: Box to match.
xCount: Number of faces in x-direction.
yCount: Number of faces in y-direction.
zCount: Number of faces in z-direction.
Returns:

Rhino.Geometry.Mesh.CreateFromBox(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,System.Int32,System.Int32)
Constructs new mesh from 8 corner points.
corners:
8 points defining the box corners arranged as the vN labels indicate.
v7_____________v6
|\             |\
| \            | \
|  \ _____________\
|   v4         |   v5
|   |          |   |
|   |          |   |
v3--|----------v2  |
\  |           \  |
\ |            \ |
\|             \|
v0_____________v1
xCount: Number of faces in x-direction.
yCount: Number of faces in y-direction.
zCount: Number of faces in z-direction.
Returns: A new brep, or null on failure.
Returns: A new box mesh, on null on error.

Rhino.Geometry.Mesh.CreateFromPlanarBoundary(Rhino.Geometry.Curve,Rhino.Geometry.MeshingParameters)
Do not use this overload. Use version that takes a tolerance parameter instead.
boundary: Do not use.
parameters: Do not use.
Returns:
Do not use.

Rhino.Geometry.Mesh.CreateFromPlanarBoundary(Rhino.Geometry.Curve,Rhino.Geometry.MeshingParameters,System.Double)
Attempts to construct a mesh from a closed planar curve.RhinoMakePlanarMeshes
boundary: must be a closed planar curve.
parameters: parameters used for creating the mesh.
tolerance: Tolerance to use during operation.
Returns:
New mesh on success or null on failure.

Rhino.Geometry.Mesh.CreateFromClosedPolyline(Rhino.Geometry.Polyline)
Attempts to create a Mesh that is a triangulation of a closed polyline.
polyline: must be closed
Returns:
New mesh on success or null on failure.

Rhino.Geometry.Mesh.CreatePatch(Rhino.Geometry.Polyline,System.Double,Rhino.Geometry.Surface,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Boolean,System.Int32)
Construct a mesh patch from a variety of input geometry.
outerBoundary: (optional: can be null) Outer boundary
polyline, if provided this will become the outer boundary of the
resulting mesh. Any of the input that is completely outside the outer
boundary will be ignored and have no impact on the result. If any of
the input intersects the outer boundary the result will be
unpredictable and is likely to not include the entire outer boundary.
angleToleranceRadians:
Maximum angle between unit tangents and adjacent verticies. Used to
divide curve inputs that cannot otherwise be represented as a polyline.
innerBoundaryCurves:
(optional: can be null) Polylines to create holes in the output mesh.
If innerBoundaryCurves are the only input then the result may be null
if trimback is set to false (see comments for trimback) because the
resulting mesh could be invalid (all faces created contained vertexes
from the perimeter boundary).
pullbackSurface:
(optional: can be null) Initial surface where 3d input will be pulled
to make a 2d representation used by the function that generates the mesh.
Providing a pullbackSurface can be helpful when it is similar in shape
to the pattern of the input, the pulled 2d points will be a better
representation of the 3d points. If all of the input is more or less
coplanar to start with, providing pullbackSurface has no real benefit.
innerBothSideCurves:
(optional: can be null) These polylines will create faces on both sides
of the edge. If there are only input points(innerPoints) there is no
way to guarantee a triangulation that will create an edge between two
particular points. Adding a line, or polyline, to innerBothsideCurves
that includes points from innerPoints will help guide the triangulation.
innerPoints:
(optional: can be null) Points to be used to generate the mesh. If
outerBoundary is not null, points outside of that boundary after it has
been pulled to pullbackSurface (or the best plane through the input if
pullbackSurface is null) will be ignored.
trimback:
Only used when a outerBoundary has not been provided. When that is the
case, the function uses the perimeter of the surface as the outer boundary
instead. If true, any face of the resulting triangulated mesh that
contains a vertex of the perimeter boundary will be removed.
divisions:
Only used when a outerBoundary has not been provided. When that is the
case, division becomes the number of divisions each side of the surface's
perimeter will be divided into to create an outer boundary to work with.
Returns: mesh on success; null on failure

Rhino.Geometry.Mesh.CreateFromCurvePipe(Rhino.Geometry.Curve,System.Double,System.Int32,System.Int32,Rhino.Geometry.MeshPipeCapStyle,System.Boolean,System.Collections.Generic.IEnumerable{Rhino.Geometry.Interval})
Constructs a new mesh pipe from a curve.
curve: A curve to pipe.
radius: The radius of the pipe.
segments: The number of segments in the pipe.
accuracy: The accuracy of the pipe.
capType: The type of cap to be created at the end of the pipe.
faceted: Specifies whether the pipe is faceted, or not.
intervals: A series of intervals to pipe. This value can be null.
Returns: A new mesh, or null on failure.

Rhino.Geometry.Mesh.WithShutLining(System.Boolean,System.Double,System.Collections.Generic.IEnumerable{Rhino.Geometry.ShutLiningCurveInfo})
Constructs new mesh from the current one, with shut lining applied to it.
faceted: Specifies whether the shutline is faceted.
tolerance: The tolerance of the shutline.
curves: A collection of curve arguments.
Returns: A new mesh with shutlining. Null on failure.
Throws System.ArgumentNullException: If curves is null.
Throws System.InvalidOperationException: If displacement failed
because of an error. The exception message specifies the error.

Rhino.Geometry.Mesh.WithDisplacement(Rhino.Geometry.MeshDisplacementInfo)
Constructs new mesh from the current one, with displacement applied to it.
displacement: Information on mesh displacement.
Returns: A new mesh with shutlining.
Throws System.ArgumentNullException: If displacer is null.
Throws System.InvalidOperationException: If displacement failed
because of an error. The exception message specifies the error.

Rhino.Geometry.Mesh.WithEdgeSoftening(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Double)
Constructs new mesh from the current one, with edge softening applied to it.
softeningRadius: The softening radius.
chamfer: Specifies whether to chamfer the edges.
faceted: Specifies whether the edges are faceted.
force: Specifies whether to soften edges despite too large a radius.
angleThreshold: Threshold angle (in degrees) which controls whether an edge is softened or not.
The angle refers to the angles between the adjacent faces of an edge.
Returns: A new mesh with soft edges.
Throws System.InvalidOperationException: If displacement failed
because of an error. The exception message specifies the error.

Rhino.Geometry.Mesh.NonConstOperation
Clear local cache on non const calls

Rhino.Geometry.Mesh.HasCachedTextureCoordinates
Will return true if SetCachedTextureCoordinates has been called;
otherwise will return false.

Rhino.Geometry.Mesh.Faces
Gets access to the mesh face list.

Rhino.Geometry.Mesh.Ngons
Gets access to the mesh ngon list.
Ngons represent groups of Faces (triangles + quads).
Faces are used to tessellate an Ngon internally.
When a triangle or quad is referenced in the Ngon list, it is no longer visualized and
conceived as a single entity, but takes part of the Ngon.
If you need to get access to both Ngons and the faces that are not referenced by Ngons,
that is, all polygons that are visible in the mesh, then use the
Rhino.Geometry.Mesh.GetNgonAndFacesEnumerable helper method.

Rhino.Geometry.Mesh.ComponentStates
Gets access to the vertex hidden/visibility collection in this mesh.
This is a runtime property and it is not saved in the 3dm file.

Rhino.Geometry.Mesh.ClearTextureData
Removes all texture coordinate information from this mesh.

Rhino.Geometry.Mesh.ClearSurfaceData
Removes surface parameters, curvature parameters and surface statistics from the mesh.

Rhino.Geometry.Mesh.DestroyTopology
Removes topology data, forcing all topology information to be recomputed.

Rhino.Geometry.Mesh.DestroyTree
Destroys the mesh vertex access tree.

Rhino.Geometry.Mesh.DestroyPartition
Destroys mesh partition.

Rhino.Geometry.Mesh.SetTextureCoordinates(Rhino.Render.TextureMapping,Rhino.Geometry.Transform,System.Boolean)
Set texture coordinates using given mapping and applying given transform.
Set lazy to false to generate texture coordinates right away.
tm: Texture mapping
xf: Transform to apply to the texture mapping
lazy: Whether to generate lazily (true) or right away (false)

Rhino.Geometry.Mesh.SetCachedTextureCoordinates(Rhino.Render.TextureMapping,Rhino.Geometry.Transform@)
Set cached texture coordinates using the specified mapping.
tm:
xf:

Rhino.Geometry.Mesh.GetCachedTextureCoordinates(System.Guid)
Call this method to get cached texture coordinates for a texture
mapping with the specified Id.
textureMappingId:
Texture mapping Id
Returns:
Object which allows access to coordinates and other props.

Rhino.Geometry.Mesh.Volume
Removes any unreferenced objects from arrays, reindexes as needed
and shrinks arrays to minimum required size.
Returns: true on success, false on failure.

Rhino.Geometry.Mesh.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.MeshSmoothingCoordinateSystem)
Smooths a mesh by averaging the positions of curve and surface control points
and mesh vertices in a specified region.
smoothFactor: The smoothing factor, which controls how much control points move towards the average of the neighboring points.
bXSmooth: When true control points move in X axis direction.
bYSmooth: When true control points move in Y axis direction.
bZSmooth: When true Vertices along naked edges will not be modified.
bFixBoundaries: When true ertices along naked edges will not be modified.
coordinateSystem: The coordinates to determine the direction of the smoothing.
Returns:

Rhino.Geometry.Mesh.Unweld(System.Double,System.Boolean)
Makes sure that faces sharing an edge and having a difference of normal greater
than or equal to angleToleranceRadians have unique vertexes along that edge,
adding vertices if necessary.
angleToleranceRadians: Angle at which to make unique vertices.
modifyNormals:
Determines whether new vertex normals will have the same vertex normal as the original (false)
or vertex normals made from the corrsponding face normals (true)

Rhino.Geometry.Mesh.Weld(System.Double)
Makes sure that faces sharing an edge and having a difference of normal greater
than or equal to angleToleranceRadians share vertexes along that edge, vertex normals
are averaged.
angleToleranceRadians: Angle at which to weld vertices.

Rhino.Geometry.Mesh.RebuildNormals
Removes mesh normals and reconstructs the face and vertex normals based
on the orientation of the faces.

Rhino.Geometry.Mesh.ExtractNonManifoldEdges(System.Boolean)
Extracts, or removes, non-manifold mesh edges.
selective: If true, then extract hanging faces only.
Returns: A mesh containing the extracted non-manifold parts if successful, null otherwise.

Rhino.Geometry.Mesh.HealNakedEdges(System.Double)
Attempts to "heal" naked edges in a mesh based on a given distance.
First attempts to move vertexes to neighboring vertexes that are within that
distance away. Then it finds edges that have a closest point to the vertex within
the distance and splits the edge. When it finds one it splits the edge and
makes two new edges using that point.
distance: Distance to not exceed when modifying the mesh.
Returns: true if successful, false otherwise.

Rhino.Geometry.Mesh.FillHoles
Attempts to determine "holes" in the mesh by chaining naked edges together.
Then it triangulates the closed polygons adds the faces to the mesh.
Returns: true if successful, false otherwise.
Remarks: This function does not differentiate between inner and outer naked edges.
If you need that, it would be better to use Mesh.FillHole.

Rhino.Geometry.Mesh.FileHole(System.Int32)
Given a starting "naked" edge index, this function attempts to determine a "hole"
by chaining additional naked edges together until if returns to the start index.
Then it triangulates the closed polygon and either adds the faces to the mesh.
topologyEdgeIndex: Starting naked edge index.
Returns: true if successful, false otherwise.

Rhino.Geometry.Mesh.UnifyNormals
Attempts to fix inconsistencies in the directions of mesh faces in a mesh. This function
does not modify mesh vertex normals, it rearranges the mesh face winding and face
normals to make them all consistent. Note, you may want to call Mesh.Normals.ComputeNormals()
to recompute vertex normals after calling this functions.
Returns: number of faces that were modified.

Rhino.Geometry.Mesh.UnifyNormals(System.Boolean)
Attempts to fix inconsistencies in the directions of mesh faces in a mesh. This function
does not modify mesh vertex normals, it rearranges the mesh face winding and face
normals to make them all consistent. Note, you may want to call Mesh.Normals.ComputeNormals()
to recompute vertex normals after calling this functions.
countOnly: If true, then only the number of faces that would be modified is determined.
Returns: If countOnly=false, the number of faces that were modified. If countOnly=true, the number of faces that would be modified.

Rhino.Geometry.Mesh.GetOutlines(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Plane)
Constructs the outlines of a mesh.
viewportInfo: The viewport info that provides the outline direction.
plane: Usually the view's construction plane. If a parallel projection and view plane is parallel to this, then project the results to the plane.
Returns: An array of polylines, or null on error.

Rhino.Geometry.Mesh.ColorAt(System.Int32,System.Double,System.Double,System.Double,System.Double)
Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must
be assigned in accordance with the rules as defined by MeshPoint.T.
faceIndex: Index of triangle or quad to evaluate.
t0: First barycentric coordinate.
t1: Second barycentric coordinate.
t2: Third barycentric coordinate.
t3: Fourth barycentric coordinate. If the face is a triangle, this coordinate will be ignored.
Returns: The interpolated vertex color on the mesh or Color.Transparent if the faceIndex is not valid,
if the barycentric coordinates could not be evaluated, or if there are no colors defined on the mesh.
Remarks: Coordinate 0,0,0,0 is not a valid set of barycentric coordinates. The sum of t0 to t3 should be 1.

Rhino.Geometry.Mesh.CollapseFacesByEdgeLength(System.Boolean,System.Double)
Collapses multiple mesh faces, with greater/less than edge length, based on the principles
found in Stan Melax's mesh reduction PDF,
see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
bGreaterThan: Determines whether edge with lengths greater than or less than edgeLength are collapsed.
edgeLength: Length with which to compare to edge lengths.
Returns: Number of edges (faces) that were collapsed.
Remarks:
This number may differ from the initial number of edges that meet
the input criteria because the lengths of some initial edges may be altered as other edges are collapsed.

Rhino.Geometry.Mesh.CollapseFacesByArea(System.Double,System.Double)
Collapses multiple mesh faces, with areas less than LessThanArea and greater than GreaterThanArea,
based on the principles found in Stan Melax's mesh reduction PDF,
see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
lessThanArea: Area in which faces are selected if their area is less than or equal to.
greaterThanArea: Area in which faces are selected if their area is greater than or equal to.
Returns: Number of faces that were collapsed in the process.
Remarks:
This number may differ from the initial number of faces that meet
the input criteria because the areas of some initial faces may be altered as other faces are collapsed.
The face area must be both less than LessThanArea AND greater than GreaterThanArea in order to be considered.
Use large numbers for lessThanArea or zero for greaterThanArea to simulate an OR.

Rhino.Geometry.Mesh.CollapseFacesByByAspectRatio(System.Double)
Collapses a multiple mesh faces, determined by face aspect ratio, based on criteria found in Stan Melax's polygon reduction,
see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
aspectRatio: Faces with an aspect ratio less than aspectRatio are considered as candidates.
Returns: Number of faces that were collapsed in the process.
Remarks:
This number may differ from the initial number of faces that meet
the input criteria because the aspect ratios of some initial faces may be altered as other faces are collapsed.

Rhino.Geometry.Mesh.GetUnsafeLock(System.Boolean)
Allows to obtain unsafe pointers to the underlying unmanaged data structures of the mesh.
writable: true if user will need to write onto the structure. false otherwise.
Returns: A lock that needs to be released.
Remarks: The lock implements the IDisposable interface, and one call of its
System.IDisposable.Dispose or Rhino.Geometry.Mesh.ReleaseUnsafeLock(Rhino.Geometry.MeshUnsafeLock) will update the data structure as required.
This can be achieved with a using statement (Using in Vb.Net).

Rhino.Geometry.Mesh.ReleaseUnsafeLock(Rhino.Geometry.MeshUnsafeLock)
Updates the Mesh data with the information that was stored via the Rhino.Geometry.MeshUnsafeLock.
meshData: The data that will be unlocked.

Rhino.Geometry.Mesh.CreatePartitions(System.Int32,System.Int32)
In ancient times (or modern smartphone times), some rendering engines
were only able to process small batches of triangles and the
CreatePartitions() function was provided to partition the mesh into
subsets of vertices and faces that those rendering engines could handle.
maximumVertexCount:
maximumTriangleCount:
Returns: true on success

Rhino.Geometry.Mesh.PartitionCount
Number of partition information chunks stored on this mesh based
on the last call to CreatePartitions

Rhino.Geometry.Mesh.GetPartition(System.Int32)
Retrieves a partition. See Rhino.Geometry.Mesh.CreatePartitions(System.Int32,System.Int32) for details.
which: The partition index.
Returns:

Rhino.Geometry.Mesh.GetNgonAndFacesEnumerable
Retrieves a complete enumerable, i.e., one that provides an iterator over every face that is present,
no matter if defined as a triangle, a quad, or a strictly over-four-sided ngon.
Returns: The enumerator capable of enumerating through Mesh.Ngons> Mesh.Ngons and Faces

Rhino.Geometry.Mesh.GetNgonAndFacesCount
Retrieves the count of items that Rhino.Geometry.Mesh.GetNgonAndFacesEnumerable will provide.
Returns: The amount of faces that are not part of an ngon + the amount of ngons.

Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean)
Reduce polygon count
desiredPolygonCount: desired or target number of faces
allowDistortion:
If true mesh appearance is not changed even if the target polygon count is not reached
accuracy: Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results
normalizeSize: If true mesh is fitted to an axis aligned unit cube until reduction is complete
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.

Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean,System.Threading.CancellationToken,System.IProgress{System.Double},System.String@)
Reduce polygon count
desiredPolygonCount: desired or target number of faces
allowDistortion:
If true mesh appearance is not changed even if the target polygon count is not reached
accuracy: Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results
normalizeSize: If true mesh is fitted to an axis aligned unit cube until reduction is complete
cancelToken:
progress:
problemDescription:
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.

Rhino.Geometry.Mesh.Reduce(Rhino.Geometry.ReduceMeshParameters)
Reduce polygon count
parameters: Parameters
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.

Rhino.Geometry.Mesh.ComputeThickness(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double)
Compute thickness metrics for this mesh.
meshes: Meshes to include in thickness analysis.
maximumThickness: Maximum thickness to consider. Use as small a thickness as possible to speed up the solver.
Returns: Array of thickness measurements.

Rhino.Geometry.Mesh.ComputeThickness(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double,System.Threading.CancellationToken)
Compute thickness metrics for this mesh.
meshes: Meshes to include in thickness analysis.
maximumThickness: Maximum thickness to consider. Use as small a thickness as possible to speed up the solver.
cancelToken: Computation cancellation token.
Returns: Array of thickness measurements.

Rhino.Geometry.Mesh.ComputeThickness(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double,System.Double,System.Threading.CancellationToken)
Compute thickness metrics for this mesh.
meshes: Meshes to include in thickness analysis.
maximumThickness: Maximum thickness to consider. Use as small a thickness as possible to speed up the solver.
sharpAngle: Sharpness angle in radians.
cancelToken: Computation cancellation token.
Returns: Array of thickness measurements.

Rhino.Geometry.Mesh.CreateFromLines(Rhino.Geometry.Curve[],System.Int32,System.Double)
Creates a mesh by analizing the edge structure that could result from the extraction
of edges from an original mesh.
lines: Lines to use for computation.
maxFaceValence: The maximum valence for faces to be probed.
tolerance: The distance after which two end points of lines are considered
coincident.
Returns: A new mesh, or null if no mesh is constructed.

Rhino.Geometry.Mesh.CreateRefinedLoopMesh(Rhino.Geometry.Mesh,Rhino.Geometry.MeshRefinements.LoopFormula,Rhino.Geometry.MeshRefinements.RefinementSettings)
Instantiates a new mesh that represents a Loop subdivision of the mesh.
mesh: The mesh to subdivide.
formula: The Loop subdivision formula.
settings: An instance of the settings class, or null for defaults.
Returns: A new mesh. null is never returned.

Rhino.Geometry.Mesh.CreateRefinedCatmullClarkMesh(Rhino.Geometry.Mesh,Rhino.Geometry.MeshRefinements.RefinementSettings)
Instantiates a new mesh that represents a Catmull-Clark subdivision of the mesh.
mesh: The mesh to subdivide.
settings: An instance of the settings class, or null for defaults.
Returns: A new mesh. null is never returned.

Rhino.Geometry.Mesh.ComputeAutoCreaseInformation
Do not use this method.
Length: top.Mesh.Vertices.Count
Returns: An array that is bound to change.

Rhino.Geometry.Mesh.ExtendSelectionByEdgeRidge(System.Int32[],System.Int32,System.Boolean)
Suggests an extension of a selection set by using information related with topology and alignment.
preselectedEdges: An array of edges that were already selected.
newEdge: A new edge index.
iterative:
Returns: An array of edges that are in a visual relationship with newEdge.
Throws System.ArgumentOutOfRangeException: If newEdge is less than 0 or larger than the topology edge count.

Rhino.Geometry.Mesh.ExtendSelectionByFaceLoop(System.Int32[],System.Int32,System.Boolean)
Suggests an extension of a face selection set by using information related with topology and alignment.
preselectedFaces: An array of faces that were already selected.
newFace: A new face index. If this index is already part of the selection, no extension is suggested.
iterative:
Returns: An array of faces that are in a visual relationship with newFace.
Throws System.ArgumentOutOfRangeException: If newFace is less than 0 or larger than the face count.