Rhino.DocObjects.RhinoObject.FromRuntimeSerialNumber(System.UInt32)
Get a Rhino object for a unique runtime serial number
serialNumber:
Returns:

Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)
Mesh Rhino Objects
rhinoObjects: Objects to mesh
parameters: The parameters used to create the meshes
meshes:
attributes:
Returns:

Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters@,System.Boolean@,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)
Mesh Rhino Objects
rhinoObjects: Objects to mesh
parameters: The parameters used to create the meshes
simpleDialog:
meshes:
attributes:
Returns:

Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters@,System.Int32@,Rhino.Geometry.Transform,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)
Mesh Rhino Objects
rhinoObjects: Objects to mesh
parameters: The parameters used to create the meshes
uiStyle: 0 = simple dialog, 1 = details dialog, 2 = script or batch mode
xform: transform to be used for export with origin, or Z to Y up, etc.
meshes:
attributes:
Returns:

Rhino.DocObjects.RhinoObject.SelectSubObject(Rhino.Geometry.ComponentIndex,System.Boolean,System.Boolean,System.Boolean)
Reports if an object can be selected.
componentIndex: Index of subobject to check.
select: The new selection state; true activates selection.
syncHighlight:
(default=true)
If true, then the object is highlighted if it is selected
and unhighlighted if is is not selected.
persistentSelect: When true, selection persists even after the current command
terminates.
Returns:
0: object is not selected
1: object is selected
2: object is selected persistently.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.

Rhino.DocObjects.RhinoObject.Description(Rhino.FileIO.TextLog)
Get a brief description of a object, including it's attributes and geometry.
textLog: A textlog for collecting the description.

Rhino.DocObjects.RhinoObject.SupportsRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,System.Boolean)
Determines if custom render meshes will be built for a particular object.
viewport: The viewport being rendered.
preview:
Type of mesh to build. If attrs is non-null then a smaller mesh may be
generated in less time, false is meant when actually rendering.
Returns:
Returns true if custom render mesh(es) will get built for this object.

Rhino.DocObjects.RhinoObject.SupportsRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes)
Determines if custom render meshes will be built for a particular object.
viewport: The viewport being rendered.
attrs:
Type of mesh to build. If attrs is non-null then a smaller mesh may be
generated in less time, false is meant when actually rendering.
Returns:
Returns true if custom render mesh(es) will get built for this object.

Rhino.DocObjects.RhinoObject.GetRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,System.Boolean)
Build custom render mesh(es) for this object.
viewport: The viewport being rendered.
preview:
Type of mesh to build, if preview is true then a smaller mesh may be
generated in less time, false is meant when actually rendering.
Returns:
Returns a RenderPrimitiveList if successful otherwise returns null.

Rhino.DocObjects.RhinoObject.GetRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes)
Build custom render mesh(es) for this object.
viewport: The viewport being rendered.
attrs:
Attributes for the view mode you are supplying meshes for.  Will be null if this is a modal rendering.
Returns:
Returns a RenderPrimitiveList if successful otherwise returns null.

Rhino.DocObjects.RhinoObject.TryGetRenderPrimitiveBoundingBox(Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Geometry.BoundingBox@)
Get the bounding box for the custom render meshes associated with this
object.
viewport: The viewport being rendered.
preview:
Type of mesh to build, if preview is true then a smaller mesh may be
generated in less time, false is meant when actually rendering.
boundingBox:
This will be set to BoundingBox.Unset on failure otherwise it will be
the bounding box for the custom render meshes associated with this
object.
Returns:
Returns true if the bounding box was successfully calculated otherwise
returns false on error.

Rhino.DocObjects.RhinoObject.TryGetRenderPrimitiveBoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes,Rhino.Geometry.BoundingBox@)
Get the bounding box for the custom render meshes associated with this
object.
viewport: The viewport being rendered.
attrs:
Attributes for the view mode you are supplying meshes for.  Will be null if this is a modal rendering.
boundingBox:
This will be set to BoundingBox.Unset on failure otherwise it will be
the bounding box for the custom render meshes associated with this
object.
Returns:
Returns true if the bounding box was successfully calculated otherwise
returns false on error.

Rhino.DocObjects.RhinoObject.GetSubObjects
Gets an array of sub-objects.
Returns: An array of subobjects, or null if there are none.

Rhino.DocObjects.RhinoObject.GetTextureMapping(System.Int32)
channel:
Returns:

Rhino.DocObjects.RhinoObject.GetTextureMapping(System.Int32,Rhino.Geometry.Transform@)
Get objects texture mapping
channel:
objectTransform:
Returns:

Rhino.DocObjects.RhinoObject.SetTextureMapping(System.Int32,Rhino.Render.TextureMapping)
channel:
tm:
Returns:

Rhino.DocObjects.RhinoObject.HasTextureMapping
Returns true if this object has a texture mapping form any source (pluginId)
Returns:

Rhino.DocObjects.RhinoObject.GetTextureChannels
Get a list of the texture mapping channel Id's associated with object.
Returns:
Returns an array of channel Id's or an empty list if there are not mappings.

Rhino.DocObjects.RhinoObject.RenderMaterial
Gets the render material associated with this object or null if there
is none.  This does not pay attention to the material source and will
not check parent objects or layers for a RenderMaterial.

Rhino.DocObjects.RhinoObject.GetRenderMaterial(System.Boolean)
Gets the RenderMaterial that this object uses based on it's attributes
and the document that the object is associated with. If there is no
RenderMaterial associated with this object then null is returned.  If
null is returned you should call GetMaterial to get the material used
to render this object.
frontMaterial:
If true, gets the material used to render the object's front side
otherwise; gets the material used to render the back side of the
object.
Returns:
If there is a RenderMaterial associated with this objects' associated
Material then it is returned otherwise; null is returned.

Rhino.DocObjects.RhinoObject.GetRenderMaterial(Rhino.Geometry.ComponentIndex,System.Guid,Rhino.DocObjects.ObjectAttributes)
Gets the RenderMaterial associated with this object if there is one. If
there is no RenderMaterial associated with this object then null is
returned.  If null is returned you should call GetMaterial to get the
material used to render this object.
componentIndex:
Returns the RenderMaterial associated with the specified sub object or
the objects top level material if it is set to
Rhino.Geometry.ComponentIndex.Unset
plugInId:
The plug-in specific material to look for.
attributes:
Optional object attributes used to determine the material source, if
null the objects attributes are used.
Returns:
Returns the Rhino.DocObjects.RhinoObject.RenderMaterial associated with the sub object
identified by componentIndex if the component index is set to
Rhino.Geometry.ComponentIndex.Unset then the top level
RenderMaterail is returned.  If this method returns null it means there
is no RenderMaterial associated with the object or  sub object so you
should may GetMaterial get the objects generic material.

Rhino.DocObjects.RhinoObject.GetRenderMaterial(Rhino.Geometry.ComponentIndex,System.Guid)
Gets the RenderMaterial associated with this object if there is one. If
there is no RenderMaterial associated with this object then null is
returned.  If null is returned you should call GetMaterial to get the
material used to render this object.
componentIndex:
Returns the RenderMaterial associated with the specified sub object or
the objects top level material if it is set to
Rhino.Geometry.ComponentIndex.Unset
plugInId:
The plug-in specific material to look for.
Returns:
Returns the Rhino.DocObjects.RhinoObject.RenderMaterial associated with the sub object
identified by componentIndex if the component index is set to
Rhino.Geometry.ComponentIndex.Unset then the top level
RenderMaterail is returned.  If this method returns null it means there
is no RenderMaterial associated with the object or sub object so you
should may GetMaterial get the objects generic material.

Rhino.DocObjects.RhinoObject.GetRenderMaterial(Rhino.Geometry.ComponentIndex)
Gets the RenderMaterial associated with this object if there is one. If
there is no RenderMaterial associated with this object then null is
returned.  If null is returned you should call GetMaterial to get the
material used to render this object.
componentIndex:
Returns the RenderMaterial associated with the specified sub object or
the objects top level material if it is set to ComponentIndex.Unset
Returns:
Returns the Rhino.DocObjects.RhinoObject.RenderMaterial associated with the sub object
identified by componentIndex if the component index is set to
Rhino.Geometry.ComponentIndex.Unset then the top level
RenderMaterail is returned.  If this method returns null it means there
is no RenderMaterial associated with the object or  sub object so you
should may GetMaterial get the objects generic material.

Rhino.DocObjects.RhinoObject.HasSubobjectMaterials
Will be true if the object contains sub object meshes with materials
that are different than the top level object.

Rhino.DocObjects.RhinoObject.SubobjectMaterialComponents


Rhino.DocObjects.RhinoObject.ComponentType
Returns Rhino.DocObjects.ModelComponentType.ModelGeometry.

Rhino.DocObjects.RhinoObject.GetMaterial(Rhino.Geometry.ComponentIndex,System.Guid,Rhino.DocObjects.ObjectAttributes)
Get the Material associated with the sub object
identified by componentIndex if the component index is
set to ComponentIndex.Unset then the top level material
is returned.
componentIndex:
Returns the material associated with the specified sub object or the
objects top level material if it is set to ComponentIndex.Unset
plugInId:
The plug-in specific material to look for.
attributes:
Optional object attributes used to determine the material source, if
null the objects attributes are used.
Returns:
Returns the Material associated with the sub object
identified by componentIndex if the component index is set to
ComponentIndex.Unset then the top level material is returned.

Rhino.DocObjects.RhinoObject.GetMaterial(Rhino.Geometry.ComponentIndex,System.Guid)
Get the Material associated with the sub object
identified by componentIndex if the component index is
set to ComponentIndex.Unset
then the top level material is returned.
componentIndex:
Returns the material associated with the specified sub object or the
objects top level material if it is set to ComponentIndex.Unset
plugInId:
The plug-in specific material to look for.
Returns:
Returns the Material associated with the sub object
identified by componentIndex if the component index is set to
ComponentIndex.Unset
then the top level material is returned.

Rhino.DocObjects.RhinoObject.GetMaterial(Rhino.Geometry.ComponentIndex)
Get the Material associated with the sub object
identified by componentIndex if the component index is
set to ComponentIndex.Unset
then the top level material is returned.
componentIndex:
Returns the material associated with the specified sub object or the
objects top level material if it is set to ComponentIndex.Unset
Returns:
Returns the Material associated with the sub object
identified by componentIndex if the component index is
set to ComponentIndex.Unset then the top level material
is returned.

Rhino.DocObjects.RhinoObject.GetCustomRenderMeshParameter(System.Guid,System.String)
Query the object for the value of a given named custom render mesh parameter.
providerId: Id of the custom render mesh provider
parameterName: Name of the parameter
Returns: IConvertible. Note that you can't directly cast from object, instead you have to use the Convert mechanism.

Rhino.DocObjects.RhinoObject.SetCustomRenderMeshParameter(System.Guid,System.String,System.Object)
Set the named custom render mesh parameter value for this object.
providerId: Id of the custom render mesh provider
parameterName:
value:
Returns: