Rhino.FileIO.File3dmObject.ComponentType
Returns Rhino.DocObjects.ModelComponentType.ModelGeometry.

Rhino.FileIO.File3dmObject.Equals(Rhino.FileIO.File3dmObject)
Verified that two File3dmObject items refer to the same object in a document.
other: The other item to test.
Returns: true is the two objects coincide.