Rhino.DocObjects.Tables.HatchPatternTable.FindName(System.String)
Finds the hatch pattern with a given name. Search ignores case.
name: The name of the hatch patter to be found.
Returns: Hatch pattern with the given name. Null if no hatch pattern found.

Rhino.DocObjects.Tables.HatchPatternTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a HatchPattern given its name hash.
nameHash: The name hash of the HatchPattern to be searched.
Returns: An Linetype, or null on error.

Rhino.DocObjects.Tables.HatchPatternTable.FindIndex(System.Int32)
Retrieves a HatchPattern object based on Index. This seach type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A HatchPattern object, or null if none was found.