Rhino.PlugIns.DigitizerPlugIn.SendPoint(Rhino.Geometry.Point3d,Rhino.UI.MouseButton,System.Boolean,System.Boolean)
If the digitizer is enabled, call this function to send a point to Rhino.
Call this function as much as you like.  The digitizers that Rhino currently
supports send a point every 15 milliseconds or so. This function should be
called when users press or release any digitizer button.
point: 3d point in digitizer coordinates.
mousebuttons: corresponding digitizer button is down.
shiftKey: true if the Shift keyboard key was pressed. Otherwise, false.
controlKey: true if the Control keyboard key was pressed. Otherwise, false.

Rhino.PlugIns.DigitizerPlugIn.SendRay(Rhino.Geometry.Ray3d,Rhino.UI.MouseButton,System.Boolean,System.Boolean)
If the digitizer is enabled, call this function to send a point and direction to Rhino.
Call this function as much as you like.  The digitizers that Rhino currently
supports send a point every 15 milliseconds or so. This function should be
called when users press or release any digitizer button.
ray: 3d ray in digitizer coordinates.
mousebuttons: corresponding digitizer button is down.
shiftKey: true if the Shift keyboard key was pressed. Otherwise, false.
controlKey: true if the Control keyboard key was pressed. Otherwise, false.