Rhino.Geometry.PointCloud.AddRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Appends a collection of points to this point cloud.
points: Points to append.

Rhino.Geometry.PointCloud.AddRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Vector3d})
Appends a collection of points and normal vectors to this point cloud.
Throws System.ArgumentException: thrown if points and normals have differing numbers of elements
points: Points to append.
normals: Normal Vectors to append.

Rhino.Geometry.PointCloud.AddRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{System.Drawing.Color})
Appends a collection of points and normal vectors to this point cloud.
points: Points to append.
colors: Colors to append.

Rhino.Geometry.PointCloud.AddRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Vector3d},System.Collections.Generic.IEnumerable{System.Drawing.Color})
Appends a collection of points and normal vectors to this point cloud.
points: Points to append.
colors: Colors to append.
normals: Normal Vectors to append.