Rhino.Geometry.RadialDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.AnnotationType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initialize Dimension parameters
dimStyle:
dimtype:
plane:
centerpoint:
radiuspoint:
dimlinepoint:
Returns:

Rhino.Geometry.RadialDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Update Dimension geometry from point locations
plane:
centerpoint:
radiuspoint:
dimlinepoint:
rotationInPlane:
Returns:

Rhino.Geometry.RadialDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
centerpoint:
radiuspoint:
kneepoint:
dimlinepoint:
Returns: