Rhino.DocObjects.Tables.LayerTable.Find(System.String,System.Boolean)
Finds the layer with a given name. If multiple layers exist that have the same name, the
first match layer index will be returned.
Deleted layers have no name.
layerName: name of layer to search for. The search ignores case.
ignoreDeletedLayers: true means don't search deleted layers.
Returns:
index of the layer with the given name.
If no layer is found, the index of the default layer, -1, is returned.

Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String)
Use FindName(name, index).
index: Do not use.
layerName: Do not use.
Returns: Do not use.

Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Int32)
Searches for a layer using the fully qualified name, that includes ancestors.
Deleted layers have no name.
layerPath: The full layer name.
notFoundReturnValue: Should be -1 to get the index of the OpenNURBS default layer,
or UnsetIntIndex to get an always-out-of-bound value.
Returns: The index of the found layer, or notFoundReturnValue.

Rhino.DocObjects.Tables.LayerTable.Find(System.Guid,System.String,System.Boolean)
Finds a layer with a given name and matching parent ID.
parentId: A valid layer ID.
layerName: name of layer to search for. The search ignores case.
ignoreDeletedLayers: If true, deleted layers are not checked. NOT SUPPORTED FOR NAME SEARCH, only for Guids.
Returns:
>=0 index of the layer with the given name
-1  no layer has the given name.

Rhino.DocObjects.Tables.LayerTable.Find(System.Guid,System.String,System.Int32)
Finds a layer with a given name and matching parent ID.
parentId: A valid layer ID.
layerName: name of layer to search for. The search ignores case.
notFoundReturnValue: Should be -1 to get the index of the OpenNURBS default layer,
or UnsetIntIndex to get an always-out-of-bound value.
Returns: The index of the found layer, or notFoundReturnValue.

Rhino.DocObjects.Tables.LayerTable.Find(System.Guid,System.Boolean,System.Int32)
Finds a layer with a matching ID.
layerId: A valid layer ID.
ignoreDeletedLayers: If true, deleted layers are not checked.
notFoundReturnValue: Should be -1 to get the index of the OpenNURBS default layer,
or UnsetIntIndex to get an always-out-of-bound value.
Returns: The index of the found layer, or notFoundReturnValue.

Rhino.DocObjects.Tables.LayerTable.FindName(System.String)
Finds the layer with a given name. If multiple layers exist that have the same name, the
first match layer index will be returned.
Deleted layers have no name.
The default layer is NOT included in the search. If required, use the overload with startIndex input.
layerName: name of layer to search for. The search ignores case.
Returns:
A layer, or null.

Rhino.DocObjects.Tables.LayerTable.FindName(System.String,System.Int32)
Finds the next layer that has an index equal or higher than the searched value.
Search in case-insensitive.
startIndex: If you specify RhinoMath.UnsetIntIndex, then also default layers will be included.
This is the first index that will be tested.
layerName: The layer to search for.
Returns: A layer, or null.

Rhino.DocObjects.Tables.LayerTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a Layer given its name hash.
nameHash: The name hash of the Layer to be searched.
Returns: An Layer, or null on error.

Rhino.DocObjects.Tables.LayerTable.FindIndex(System.Int32)
Retrieves a Layer object based on Index. This seach type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Layer object, or null if none was found.

Rhino.DocObjects.Tables.LayerTable.Modify(Rhino.DocObjects.Layer,System.Guid,System.Boolean)
Modifies layer settings.
newSettings: This information is copied.
layerId:
Id of layer.
quiet: if true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if layerIndex is out of range or the settings attempt
to lock or hide the current layer.

Rhino.DocObjects.Tables.LayerTable.UndoModify(System.Int32)
Restores the layer to its previous state,
if the layer has been modified and the modification can be undone.
layerIndex: The layer index to be used.
Returns: true if this layer had been modified and the modifications were undone.

Rhino.DocObjects.Tables.LayerTable.UndoModify(System.Guid,System.UInt32)
Restores the layer to its previous state,
if the layer has been modified and the modification can be undone.
layerId: The layer Id to be used.
undoRecordSerialNumber: The undo record serial number. Pass 0 not to specify one.
Returns: true if this layer had been modified and the modifications were undone.

Rhino.DocObjects.Tables.LayerTable.UndoModify(System.Guid)
Restores the layer to its previous state,
if the layer has been modified and the modification can be undone.
layerId: The layer Id to be used.
Returns: true if this layer had been modified and the modifications were undone.

Rhino.DocObjects.Tables.LayerTable.Delete(System.Int32,System.Boolean)
Deletes layer.
layerIndex:
zero based index of layer to delete. This must be in the range 0 <= layerIndex < LayerTable.Count.
quiet:
If true, no warning message box appears if a layer the layer cannot be
deleted because it is the current layer or it contains active geometry.
Returns:
true if successful. false if layerIndex is out of range or the the layer cannot be
deleted because it is the current layer or because it layer contains active geometry.

Rhino.DocObjects.Tables.LayerTable.Delete(Rhino.DocObjects.Layer)
Deletes layer.
layer:
Layer to be deleted.
///
Returns:
true if successful. false if layerIndex is out of range or the the layer cannot be
deleted because it is the current layer or because it layer contains active geometry.

Rhino.DocObjects.Tables.LayerTable.Delete(System.Guid,System.Boolean)
Deletes layer.
layerId:
Id of the layer to be deleted.
quiet:
If true, no warning message box appears if a layer the layer cannot be
deleted because it is the current layer or it contains active geometry.
Returns:
true if successful. false if layerIndex is out of range or the the layer cannot be
deleted because it is the current layer or because it layer contains active geometry.

Rhino.DocObjects.Tables.LayerTable.Delete(Rhino.DocObjects.Layer,System.Boolean)
Deletes layer.
layer:
Layer to be deleted.
quiet:
If true, no warning message box appears if a layer the layer cannot be
deleted because it is the current layer or it contains active geometry.
Returns:
true if successful. false if layerIndex is out of range or the the layer cannot be
deleted because it is the current layer or because it layer contains active geometry.

Rhino.DocObjects.Tables.LayerTable.Purge(System.Int32,System.Boolean)
Deletes a layer and all geometry objects on a layer
layerIndex:
zero based index of layer to delete. This must be in the range 0 <= layerIndex < LayerTable.Count.
quiet:
If true, no warning message box appears if a layer the layer cannot be
deleted because it is the current layer.
Returns:
true if successful. false if layerIndex is out of range or the the layer cannot be
deleted because it is the current layer.

Rhino.DocObjects.Tables.LayerTable.Purge(System.Guid,System.Boolean)
Deletes a layer and all geometry objects on a layer.
layerId:
Id of the layer to purge.
quiet:
If true, no warning message box appears if a layer the layer cannot be
deleted because it is the current layer.
Returns:
true if successful. false if layerIndex is out of range or the the layer cannot be
deleted because it is the current layer.

Rhino.DocObjects.Tables.LayerTable.GetUnusedLayerName
Gets the next unused layer name used as default when creating new layers.
Returns: An unused layer name string.

Rhino.DocObjects.Tables.LayerTable.GetSelected(System.Collections.Generic.List{System.Int32}@)
Returns the indices of layers that are selected on the Layer user interface.
layerIndices: The indices of selected layers.
Returns: true if the layer user inteface is visible, false otherwise.

Rhino.DocObjects.Tables.LayerTable.Select(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Selects layers in the Layer user interface.
layerIndices: The indices of layers to select.
bDeselect: If true, then any previously selected layers will be unselected.
Returns: true if the layer user inteface is visible, false otherwise.