Rhino.ApplicationSettings.AppearanceSettings.GetPaintColor(Rhino.ApplicationSettings.PaintColor)
Gets the .Net library color that is currently associated with a paint color.
whichColor: A color association.
Returns: A .Net library color.

Rhino.ApplicationSettings.AppearanceSettings.SetPaintColor(Rhino.ApplicationSettings.PaintColor,System.Drawing.Color)
Sets the logical paint color association to a spacific .Net library color, without forced UI update.
whichColor: A logical color association.
c: A .Net library color.

Rhino.ApplicationSettings.AppearanceSettings.SetPaintColor(Rhino.ApplicationSettings.PaintColor,System.Drawing.Color,System.Boolean)
Sets the logical paint color association to a spacific .Net library color.
whichColor: A logical color association.
c: A .Net library color.
forceUiUpdate: true if the UI should be forced to update.

Rhino.ApplicationSettings.AppearanceSettings.UsePaintColors
Gets or sets a value indicating if logical paint colors should be used.

Rhino.ApplicationSettings.AppearanceSettings.GetWidgetColor(Rhino.ApplicationSettings.WidgetColor)
Gets the .Net library color that is currently associated with a widget color.
whichColor: A color association.
Returns: A .Net library color.

Rhino.ApplicationSettings.AppearanceSettings.SetWidgetColor(Rhino.ApplicationSettings.WidgetColor,System.Drawing.Color)
Sets the logical widget color association to a spacific .Net library color, without forced UI update.
whichColor: A logical color association.
c: A .Net library color.

Rhino.ApplicationSettings.AppearanceSettings.SetWidgetColor(Rhino.ApplicationSettings.WidgetColor,System.Drawing.Color,System.Boolean)
Sets the logical widget color association to a spacific .Net library color.
whichColor: A logical color association.
c: A .Net library color.
forceUiUpdate: true if the UI should be forced to update.

Rhino.ApplicationSettings.AppearanceSettings.EditCandidateColor
Gets or sets the color of objects that are eligible to be edited.

Rhino.ApplicationSettings.AppearanceSettings.ShowSideBar
Should the side bar be displayed

Rhino.ApplicationSettings.AppearanceSettings.InitialMainWindowPosition(System.Drawing.Rectangle@)
Location where the Main Rhino window attempts to show when the application is first
started.
bounds: The rectangle in which the main window attempts to shows is assigned to this out parameter during the call.
Returns: false if the information could not be retrieved.