Rhino.Geometry.Collections.NurbsCurveKnotList.RemoveMultipleKnots(System.Int32,System.Int32,System.Double)
Remove multiple knots from this curve.
minimumMultiplicity:
Remove knots with multiplicity >= minimumKnotMultiplicity.
maximumMultiplicity:
Remove knots with multiplicity <= maximumKnotMultiplicity.
tolerance:
When you remove knots, the shape of the curve is changed.
If tolerance is RhinoMath.UnsetValue, any amount of change is permitted.
If tolerance is >=0, the maximum distance between the input and output
curve is restricted to be <= tolerance.
Returns: number of knots removed on success. 0 if no knots were removed

Rhino.Geometry.Collections.NurbsCurveKnotList.RemoveKnots(System.Int32,System.Int32)
Remove knots from a curve and adjusts the remaining control points to maintain curve position as closely as possible.
The knots from Knots[index0] through Knots[index1 - 1] will be removed.
index0: The starting knot index, where Degree-1 < index0 < index1 <= Points.Count-1.
index1: The ending knot index, where Degree-1 < index0 < index1 <= Points.Count-1.
Returns: true if successful, false on failure.

Rhino.Geometry.Collections.NurbsCurveKnotList.RemoveKnotAt(System.Double)
Remove a knot from a curve and adjusts the remaining control points to maintain curve position as closely as possible.
t: The parameter on the curve that is closest to the knot to be removed.
Returns: true if successful, false on failure.

Rhino.Geometry.Collections.NurbsCurveKnotList.EpsilonEquals(Rhino.Geometry.Collections.NurbsCurveKnotList,System.Double)
Checks that all values in the other list are sequentially equal within epsilon to the values in this list.
other: The other list.
epsilon: The epsilon value.
Returns: True if values are, orderly, equal within epsilon. False otherwise.

Rhino.Geometry.Collections.NurbsCurveKnotList.IndexOf(System.Double)
Returns the first item in the list.
item: The value.
Returns: The index, or -1 if no index is found.

Rhino.Geometry.Collections.NurbsCurveKnotList.Contains(System.Double)
Returns an indication of the presence of a value in the knot list.
item: The item.
Returns: true if present, false otherwise.

Rhino.Geometry.Collections.NurbsCurveKnotList.CopyTo(System.Double[],System.Int32)
Copies the list to an array.
array: The array to copy to.
arrayIndex: The index into copy will begin.