Rhino.RhinoMath.UnsetIntIndex
When signed int values are used in a context where
0 and small negative values are valid indices and there needs
to be a value that indicates the index is not set,
OpenNURBS uses this index.  This value is -2147483647,
or Int32.MinValue + 1. This value paralles ON_UNSET_INT_INDEX.

Rhino.RhinoMath.IntIndexToString(System.Int32)
Portrays an System.Int32 index in text.
index: System.Int32 number express as string.
Returns: The text representation of the int index.

Rhino.RhinoMath.ParseNumber(System.String)
Evaluates command line math expression.
expression:
Returns: result
Throws System.ArgumentNullException: expression is null.
Throws System.FormatException: expression cannot be parsed.

Rhino.RhinoMath.TryParseNumber(System.String,System.Double@)
Evaluates command line math expression.
expression:
result:
Returns: true if successfull otherwise false

Rhino.RhinoMath.EpsilonEquals(System.Double,System.Double,System.Double)
Compare two doubles for equality within some "epsilon" range
x:
y:
epsilon:
Returns:

Rhino.RhinoMath.EpsilonEquals(System.Single,System.Single,System.Single)
Compare to floats for equality within some "epsilon" range
x:
y:
epsilon:
Returns: