Rhino.Geometry.ReduceMeshParameters.#ctor
Constructs a polygon reduction parameter object with default values.
Users of this class should not rely on default values to stay constant
across service releases.

Rhino.Geometry.ReduceMeshParameters.DesiredPolygonCount
Desired or target number of faces

Rhino.Geometry.ReduceMeshParameters.AllowDistortion
If true mesh appearance is not changed even if the target polygon count is not reached

Rhino.Geometry.ReduceMeshParameters.Accuracy
Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results

Rhino.Geometry.ReduceMeshParameters.NormalizeMeshSize
If true mesh is fitted to an axis aligned unit cube until reduction is complete

Rhino.Geometry.ReduceMeshParameters.Error


Rhino.Geometry.ReduceMeshParameters.FaceTags


Rhino.Geometry.ReduceMeshParameters.LockedComponents
List of topological mesh vertices and mesh vertices that will not be moved or deleted in reduction process.
Each mesh vertex will lock the corresponding topological mesh vertex. In other words it is not possible to have a
locked and non-locked mesh vertex at the same location.

Rhino.Geometry.ReduceMeshParameters.CancelToken


Rhino.Geometry.ReduceMeshParameters.ProgressReporter
