Rhino.Geometry.MorphControl.Curve
Returns the morph control's curve.  While this should never be null, the
calling function should check.

Rhino.Geometry.MorphControl.Surface
Returns the morph control's surface.  While this should never be null, the
calling function should check.