Rhino.Geometry.Morphs.BendSpaceMorph.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Boolean)
Constructs a bend space morph.
start: Start of spine that represents the original orientation of the object.
end: End of spine.
point: Point to bend through.
straight: If false, then point determines the region to bend. If true, only the spine region is bent.
symmetric: If false, then only one end of the object bends. If true, then the object will bend symmetrically around the center if you start the spine in the middle of the object.

Rhino.Geometry.Morphs.BendSpaceMorph.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Boolean,System.Boolean)
Constructs a bend space morph.
start: Start of spine that represents the original orientation of the object.
end: End of spine.
point: Used for bend direction.
angle: Bend angle in radians.
straight: If false, then point determines the region to bend. If true, only the spine region is bent.
symmetric: If false, then only one end of the object bends. If true, then the object will bend symmetrically around the center if you start the spine in the middle of the object.

Rhino.Geometry.Morphs.BendSpaceMorph.IsValid
Returns true if the space morph definition is valid, false otherwise.

Rhino.Geometry.Morphs.BendSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point.
point: A point that will be morphed by this object.
Returns: Resulting morphed point.

Rhino.Geometry.Morphs.BendSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.