Rhino.Geometry.Ellipse.IsValid
Returns an indication of the validity of this ellipse.

Rhino.Geometry.Ellipse.EpsilonEquals(Rhino.Geometry.Ellipse,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns: