Rhino.Runtime.RiskyAction.#ctor(System.String,System.String,System.String,System.Int32)
Always create this in a using block
description:
file:
member:
line:

Rhino.Runtime.RiskyAction.Dispose
IDisposable implementation