Rhino.Input.Custom.GetPoint.SetCursor(Rhino.UI.CursorStyle)
Sets cursor that will be used when Get() is called and snap is not
happening.
cursor:

Rhino.Input.Custom.GetPoint.EnableObjectSnapCursors(System.Boolean)
Enables or disables object snap cursors. By default, object snap cursors are enabled.
enable: If true then object snap cursors (plus sign with "near", "end", etc.)
are used when the point snaps to a object.

Rhino.Input.Custom.GetPoint.EnableNoRedrawOnExit(System.Boolean)
The default functionality of the getpoint operation is to perform a redraw on exit.
Calling this function with true turns off automatic redraw at the end of GetPoint.
May be needed in some commands for flicker free feedback.
When set to true, the caller is responsible for cleaning up the screen
after GetPoint.
noRedraw:

Rhino.Input.Custom.GetPoint.Get(System.Boolean,System.Boolean)
After setting up options and so on, call this method to get a 2d or 3d point.
onMouseUp:
If false, the point is returned when the left mouse button goes down.
If true, the point is returned when the left mouse button goes up.
get2DPoint: If true then get a 2d point otherwise get a 2d point
Returns: Rhino.Input.GetResult.Point if the user chose a 3d point; Rhino.Input.GetResult.Point2d if the user chose a 2d point; other enumeration value otherwise.