Rhino.Geometry.Box.ToExtrusion
Constructs an extrusion representation of this box.
Returns: An Extrusion representation of this box or null.

Rhino.Geometry.Box.EpsilonEquals(Rhino.Geometry.Box,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns: