Rhino.DocObjects.InstanceDefinition.IsDeleted


Rhino.DocObjects.InstanceDefinition.ComponentType
Returns Rhino.DocObjects.ModelComponentType.InstanceDefinition.

Rhino.DocObjects.InstanceDefinition.ArchiveFileStatus
Returns the archive file status of a linked instance definition.