Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer class.

Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.Count
Gets the amount of elements in this array.

Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.Dispose
Actively reclaims unmanaged resources that this instance uses.