Rhino.UI.RhinoHelp.Show(System.String)
Call this method to display standard Rhino help
helpLink:
Rhino help links are formatted like this:
http://docs.mcneel.com/rhino/6/help/en-us/index.htm#commands/line.htm
This parameter would be equal to "#commands/line.htm" in the link
above.  Rhino will calculate the string up to and including the
index.html and append this value to the end.
Returns: