Rhino.UI.IStackedDialogPageService.GetImageHandle(System.Drawing.Image,System.Boolean)
Convert image to platform specific unmanaged pointer
image:
canBeNull:
Returns:

Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Object@)
Get the unmanaged pointer associated with the pages content control
pageObject:
nativeWindowObject:
Returns:

Rhino.UI.IStackedDialogPageService.RedrawPageControl(System.Object)
Redraw the specified control.
pageControl:
Control to redraw