Rhino.FileIO.NameHash
Contains information that is useful to uniquly identify an object name.
Remarks: This object is immutable.

Rhino.FileIO.NameHash.m_sha1_hash
SHA-1 hash of ordinal minimum mapped unicode (UTF-32) code points.

Rhino.FileIO.NameHash.#ctor(System.String)
Creates a new NameHash, representing a piece of text.
name: A name. This can be null and can refer to a nonexisting path.
Returns:

Rhino.FileIO.NameHash.#ctor(System.String,System.Guid)
Creates a new NameHash, representing a piece of text.
name: A name. This can be null and can refer to a nonexisting path.
parentId: The id of the parent layer. This is only useful with layers.
Returns:

Rhino.FileIO.NameHash.Sha1Hash
Gets the 20-bytes long SHA-1 hash of ordinal minimum mapped unicode (UTF-32) code points.

Rhino.FileIO.NameHash.MappedCodePoints
Gets the NameHash flags. In some cases = number of mapped code points.

Rhino.FileIO.NameHash.ParentId
Only useful if this participates in a tree structure, as with layers.

Rhino.FileIO.NameHash.GetDisposableHandle
Be resposible: call Dispose()

Rhino.FileIO.NameHash.CreateFilePathHash(System.String)
Creates a new NameHash, representing the name of a file.
path: A path. This can be null and can refer to a nonexisting path.
Returns:

Rhino.FileIO.NameHash.Clone
Creates a copy of this name hash.
Because content hash is immutable, this can be used as a deep copy.
Returns: A different instance of the same name hash.

Rhino.FileIO.NameHash.Equals(Rhino.FileIO.NameHash)
Determines if another name hash has the same value.
other: The other name hash to compare.
Returns: True if the two hashes are equal.

Rhino.FileIO.NameHash.op_Equality(Rhino.FileIO.NameHash,Rhino.FileIO.NameHash)
Determines if two NameHash instances are equal by value.
left: The first hash.
right: The second hash.
Returns: True if they are equal by value, otherwise false.

Rhino.FileIO.NameHash.op_Inequality(Rhino.FileIO.NameHash,Rhino.FileIO.NameHash)
Determines if two NameHash instances are different by value.
left: The first hash.
right: The second hash.
Returns: True if they are different by value, otherwise false.