Rhino.Render.PreviewLighting.CppPointer
CppPointer for PreivewLighting

Rhino.Render.PreviewLighting.#ctor(System.IntPtr)
Constructor for PreivewLighting

Rhino.Render.PreviewLighting.SetUpPreview(System.IntPtr)
SetUpPreview

Rhino.Render.PreviewLighting.ElementKind
ElementKind