Rhino.Geometry.SubD.VertexFacetType
Summarizes the number of edges in faces in the whole object.

Rhino.Geometry.SubD.VertexFacetType.Unset
Not a valid vertex face type.

Rhino.Geometry.SubD.VertexFacetType.Tri
All faces are triangular.

Rhino.Geometry.SubD.VertexFacetType.Quad
All faces are quads.

Rhino.Geometry.SubD.VertexFacetType.Ngon
Edge count of faces is constant and > 4.

Rhino.Geometry.SubD.VertexFacetType.Mixed
Edge count of faces is not constant.