Rhino.DocObjects.MaterialRefs.Create(Rhino.DocObjects.MaterialRefCreateParams)
Call this method to create a MaterialRef which can be used when calling
one of the Add methods.
createParams:
Values used to initialize the MaterialRef
Returns:
A temporary MaterialRef object, the caller is responsible for disposing
of this object.

Rhino.DocObjects.MaterialRefs.GetEnumerator
Returns an enumerator that iterates through this dictionary.
Returns:
A IEnumerator that can be used to iterate this dictionary.

Rhino.DocObjects.MaterialRefs.System#Collections#IEnumerable#GetEnumerator
Returns an enumerator that iterates through this dictionary.
Returns:
An System.Collections.IEnumerator object that can be used to iterate
through this dictionary.

Rhino.DocObjects.MaterialRefs.Add(System.Guid,Rhino.DocObjects.MaterialRef)
Add or replace an element with the provided key and value to this dictionary.
key:
The plug-in associated with this MaterialRef
value:
MaterialRef to add to this dictionary
Throws System.ArgumentNullException:
value is null.
Throws System.ArgumentException:
key is empty.

Rhino.DocObjects.MaterialRefs.Clear
Removes all items from this dictionary.

Rhino.DocObjects.MaterialRefs.Count
Gets the number of elements contained in this dictionary

Rhino.DocObjects.MaterialRefs.IsReadOnly
IDictionary required property, always returns false for this dictionary.

Rhino.DocObjects.MaterialRefs.ContainsKey(System.Guid)
Determines whether this dictionary contains an MaterialRef with the
specified plug-in id.
key:
The plug-in Id used to locate a MaterialRef in this dictionary.
Returns:
true if this dictionary contains an element with the specified plug-in
Id; otherwise, false.

Rhino.DocObjects.MaterialRefs.Remove(System.Guid)
Removes the MaterialRef with the specified plug-in Id from this
dictionary.
key:
The plug-in Id for the MaterialRef to remove.
Returns:
true if the MaterialRef is successfully removed; otherwise, false. This
method also returns false if key was not found in the original dictionary.

Rhino.DocObjects.MaterialRefs.TryGetValue(System.Guid,Rhino.DocObjects.MaterialRef@)
Gets the value associated with the specified key.
key:
The plug-in Id whose MaterialRef to get.
value:
When this method returns, the MaterialRef associated with the specified
key, if the key is found; otherwise, null. This parameter is passed
uninitialized.
Returns:
true if this dictionary contains a MaterialRef with the specified key;
otherwise, false.

Rhino.DocObjects.MaterialRefs.Keys
Gets an ICollection containing the plug-in Id's in this dictionary.

Rhino.DocObjects.MaterialRefs.Values
Gets an ICollection containing the MaterialRef objects in this
dictionary.