Rhino.UI.Controls.UndoRecord.#ctor(System.String,Rhino.UI.Controls.IRdkViewModel)
UndoRecord Constructor
description:
viewModel:
Returns: Return the undo record

Rhino.UI.Controls.UndoRecord.Dispose
UndoRecord Dispose