Rhino.FileIO.File3dmInstanceDefinitionTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.InstanceDefinition.

Rhino.FileIO.File3dmInstanceDefinitionTable.FindName(System.String)
Finds an InstanceDefinitionGeometry given its name.
name: The name of the InstanceDefinitionGeometry to be searched.
Returns: An InstanceDefinitionGeometry, or null on error.

Rhino.FileIO.File3dmInstanceDefinitionTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a InstanceDefinitionGeometry given its name hash.
nameHash: The name hash of the InstanceDefinitionGeometry to be searched.
Returns: An InstanceDefinitionGeometry, or null on error.