Rhino.Geometry.SubDEdgePtr
Efficiently manages a reference to an edge in a SubD.
Contains connection information to faces and vertices.

Rhino.Geometry.SubDEdgePtr.Previous
Links to previous edge on this level.

Rhino.Geometry.SubDEdgePtr.Next
Links to next edge on this level.