Rhino.Geometry.Intersect.Intersection.CurveLine(Rhino.Geometry.Curve,Rhino.Geometry.Line,System.Double,System.Double)
Intersects a curve and an infinite line.
curve: Curve for intersection.
line: Infinite line to intesect.
tolerance: Intersection tolerance. If the curves approach each other to within tolerance,
an intersection is assumed.
overlapTolerance: The tolerance with which the curves are tested.
Returns: A collection of intersection events.

Rhino.Geometry.Intersect.Intersection.CurveBrep(Rhino.Geometry.Curve,Rhino.Geometry.Brep,System.Double,System.Double,System.Double[]@)
Intersect a curve with a Brep. This function returns the intersection parameters on the curve.
curve: Curve.
brep: Brep.
tolerance: Absolute tolerance for intersections.
angleTolerance: Angle tolerance in radians.
t: Curve parameters at intersections.
Returns: True on success, false on failure.

Rhino.Geometry.Intersect.Intersection.ProjectPointsToMeshesEx(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Vector3d,System.Double,System.Int32[]@)
Projects points onto meshes.
meshes: the meshes to project on to.
points: the points to project.
direction: the direction to project.
tolerance:
Projection tolerances used for culling close points and for line-mesh intersection.
indices: Return points[i] is a projection of points[indices[i]]
Returns:
Array of projected points, or null in case of any error or invalid input.

Rhino.Geometry.Intersect.Intersection.ProjectPointsToBrepsEx(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Vector3d,System.Double,System.Int32[]@)
Projects points onto breps.
breps: The breps projection targets.
points: The points to project.
direction: The direction to project.
tolerance: The tolerance used for intersections.
indices: Return points[i] is a projection of points[indices[i]]
Returns:
Array of projected points, or null in case of any error or invalid input.