Rhino.UI.Gumball.GumballObject.SetFromBoundingBox(Rhino.Geometry.Plane,Rhino.Geometry.BoundingBox)
Sets the gumball bounding box with respect to a frame.
frame: The frame.
frameBoundingBox: Bounding box with respect to frame.
Returns:
true if input is valid and gumball is set. false if input is not valid.
In this case, gumball is set to the default.