Rhino.Input.Custom.GetCone.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Input.Custom.GetCone.ConeConstraint
State of the cone/cyl constraint option. When the cone/cyl option is
selected, the circle is being made as a base for a cone/cyl.
By default the vertical cone/cyl option not available but is not
selected.  By default the "Vertical" option applies to VerticalCircle.

Rhino.Input.Custom.GetCone.DefaultSize
Default radius or diameter (based on InDiameterMode)

Rhino.Input.Custom.GetCone.InDiameterMode
Determines if the "size" value is reperesenting a radius or diameter

Rhino.Input.Custom.GetCone.Get(Rhino.Geometry.Cone@)
Perform the 'get' operation.
cone:
Returns: