Rhino.Runtime.ZooClientParameters.#ctor(System.Guid,System.String,System.Int32,Rhino.PlugIns.LicenseCapabilities,System.String,System.String,System.Object,Rhino.Runtime.LicenseTypes,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate)
ZooClientParameters Constructor
productGuid: Guid that identifies the product seeking a license
productTitle: Title of product displayed in user interface
productBuildType:
capabilities: Enum that declares whether this product supports evalation, licensing, purchasing, and cloud zoo
licenseEntryTextMask: Text mask used to limit input. EG: RH50-AAAA-AAAA-AAAA-AAAA-AAAA
productPath: Full path to DLL implementing product
parentWindow: Object used to parent UI DLLs
selectedLicenseType: Type of license currently used by this product
validateProductKey: Delegate called to validate the structure of a license key
onLeaseChangedDelegate: Delegate called when a cloud zoo lease changes
verifyLicenseKeyDelegate: Delegate called to verify the structure of a license key
verifyPreviousVersionLicenseKeyDelegate: Delegate called to verify the structure of an upgrade license key

Rhino.Runtime.ZooClientParameters.ProductGuid
Guid used by ZooClient to save license keys and request license keys from the Zoo and CloudZoo

Rhino.Runtime.ZooClientParameters.ProductTitle
Title of the product, "Rhinoceros 6" for example.

Rhino.Runtime.ZooClientParameters.ProductBuildType
Product build type. Must be one of LicenseBuildType values.

Rhino.Runtime.ZooClientParameters.Capabilities
LicenseCapabilities flags that set options for how licenses can be obtained for this product

Rhino.Runtime.ZooClientParameters.LicenseEntryTextMask
Text mask in the form @"RH4A-AAAA-AAAA-AAAA-AAAA-AAAA" that informs the user what numbers they are looking for

Rhino.Runtime.ZooClientParameters.ProductPath
Path to the application calling ZooClient

Rhino.Runtime.ZooClientParameters.ParentWindow
Parent window assigned to any licensing dialogs that appear. If null, the Rhino main window is used.

Rhino.Runtime.ZooClientParameters.SelectedLicenseType
License type selected by default when user is prompted to enter a license key

Rhino.Runtime.ZooClientParameters.OnLeaseChanged
Delegate called by ZooClient when a cloud zoo lease is changed

Rhino.Runtime.ZooClientParameters.VerifyPreviousVersionLicense(System.String,System.String,System.String@)
When a caller calls GetLicense, ZooClient may call VerifyPreviousVersionLicense to ensure
previousVersionLicense is legitimate and can be used to upgrade license.
license: License key for current product. This was returned by a previous call to VerifyLicenseKey or ValidateProductKey.
previousVersionLicense: License key entered by user to show upgrade eligibility for license.
errorMessage: Error message to be displayed to user if something isn't correct.
Returns:

Rhino.Runtime.ZooClientParameters.VerifyLicenseKey(System.String,System.String,System.DateTime,System.Boolean,Rhino.PlugIns.LicenseData@)
Called by GetLicense to ensure that the license key entered by the user is legitimate and can be used.
licenseKey: License key string entered by user
validationCode: Validation code entered by user (only if a previous call to VerifyLicenseKey set LicenseData.RequiresOnlineValidation to true).
validationCodeInstallDate: Date that validation code was entered by user (only if a previous call to VerifyLicenseKey set LicenseData.RequiresOnlineValidation to true).
gracePeriodExpired: Date by which license validation must complete successfully.
licenseData: Output parameter where return data about the license is set.
Returns: