Rhino.FileIO.FilePdf.Create
Create a new instance of a FilePdf class
Returns:

Rhino.FileIO.FilePdf.AddPage(Rhino.Display.ViewCaptureSettings)
Add a new page to this document
settings:
Returns: page number on success

Rhino.FileIO.FilePdf.Write(System.String)
Write pdf to a file
filename:

Rhino.FileIO.FilePdf.Write(System.IO.Stream)
Write pdf to a stream
stream:

Rhino.FileIO.FilePdf.PdfDocumentImplementation
Get actual implementation of PdfDocument class
Returns: