Rhino.Geometry.SubD
Represents a surface geometry type that is defined by a control net,
crease information and a refinement level.
This is often called a subdivision surface.
Warning: this object is exposed for early testing. It might change without notice.

Rhino.Geometry.SubD.#ctor
Initializes a new empty SubD surface.

Rhino.Geometry.SubD.Vertices
Gets access to vertices.

Rhino.Geometry.SubD.Edges
Gets access to edges.

Rhino.Geometry.SubD.Faces
Gets access to faces.

Rhino.Geometry.SubD.ChamferVertex(System.Int32,Rhino.Geometry.DistancingMode,System.Double)
Removes a vertex and inserts a face using some parameters.
vertexIndex: The index of the vertex where insertion should happen.
mode: The distance mode.
distance: The distance, in terms defined with mode: units or unary values, where 0 is start and 1 is end.