Rhino.DocObjects.Linetype.ComponentType
Returns Rhino.DocObjects.ModelComponentType.LinePattern.

Rhino.DocObjects.Linetype.SetSegment(System.Int32,System.Double,System.Boolean)
Sets the length and type of the segment at index.
index: Zero based index of the segment.
length: The length of the segment to be added in millimeters.
isSolid:
If true, the length is interpreted as a line. If false,
then the length is interpreted as a space.
Returns: true if the operation was successful; otherwise false.

Rhino.DocObjects.Linetype.GetSegment(System.Int32,System.Double@,System.Boolean@)
Gets the segment information at a index.
index: Zero based index of the segment.
length: The length of the segment in millimeters.
isSolid:
If the length is interpreted as a line, true is assigned during the call to this out parameter.
If the length is interpreted as a space, then false is assigned during the call to this out parameter.
Throws System.IndexOutOfRangeException: If the index is unacceptable.