Rhino.Geometry.MeshNgon.Create(System.Collections.Generic.IList{System.Int32},System.Collections.Generic.IList{System.Int32})
Constructs an ngon from lists of mesh vertex and face indexes.
meshVertexIndexList:
A list of mesh vertex indexes that define the outer boundary of the ngon. The mesh vertex indexes must be in the correct order.
meshFaceIndexList:
A list of mesh face indexes that define the interior of the ngon. The mesh face indexes
may be in any order.
Returns:

Rhino.Geometry.MeshNgon.Empty
Gets an empty MeshNgon.

Rhino.Geometry.MeshNgon.BoundaryVertexCount
Get the number of vertices in this ngon.
Rhino.Geometry.MeshNgon about length information.

Rhino.Geometry.MeshNgon.FaceCount
Get the number of faces in this ngon.

Rhino.Geometry.MeshNgon.BoundaryVertexIndexList
Get the outer boundary mesh vertex list of the ngon.
Vertices are sorted counterclockwise with respect to the direction of the face,
although the degree by which vertex normals will respect this might vary.
Returns: A list of mesh vertex indexes.
Rhino.Geometry.MeshNgon about length information.

Rhino.Geometry.MeshNgon.FaceIndexList
Get the ngon's mesh face index list.
Returns: A list of mesh face indexes.

Rhino.Geometry.MeshNgon.Set(System.Collections.Generic.IList{System.Int32},System.Collections.Generic.IList{System.Int32})
Set the ngon vertex and face index lists.
meshVertexIndexList:
A list of mesh vertex indexes that define the outer boundary of the ngon. The mesh vertex indexes must be in the correct order.
meshFaceIndexList:
A list of mesh face indexes that define the interior of the ngon. The mesh face indexes
may be in any order.

Rhino.Geometry.MeshNgon.Equals(Rhino.Geometry.MeshNgon)
Determines if this ngon and otherNgon are identical.
otherNgon: The other ngon for comparison.
Returns: true if otherNgon is identical to this ngon; otherwise false.

Rhino.Geometry.MeshNgon.GetHashCode
Returns a runtime-stable hashcode for the current mesh ngon.
You are not allowed to rely on persistance of this hashcode in
serialization, but for each instance of the application, this hashcode
will be the same for ngons with identical vertex and face lists.
Returns: A non-unique integer that represents this mesh ngon.

Rhino.Geometry.MeshNgon.op_Equality(Rhino.Geometry.MeshNgon,Rhino.Geometry.MeshNgon)
Determines whether two Rhino.Geometry.MeshNgon structures have equal values.
a: The first MeshNgon.
b: The second MeshNgon.
Returns: true if the vertex and face index lists are identical; otherwise false.

Rhino.Geometry.MeshNgon.op_Inequality(Rhino.Geometry.MeshNgon,Rhino.Geometry.MeshNgon)
Determines whether two Rhino.Geometry.MeshNgon structures have different values.
a: The first MeshNgon.
b: The second MeshNgon.
Returns: true if the vertex or face index lists are different in any way; otherwise false.

Rhino.Geometry.MeshNgon.CompareTo(Rhino.Geometry.MeshNgon)
Compares this Rhino.Geometry.MeshNgon with otherNgon
and returns a value of 1, 0, or -1.
Priority is for vertex count, then face count,
then vertex index list values, then face index list values.
otherNgon: The other Rhino.Geometry.MeshNgon to use in comparison.
Returns:
0: if this is identical to otherNgon
-1: if this < otherNgon.
+1: if this > otherNgon.