Rhino.DocObjects.InstanceDefinitionArchiveFileStatus
The archive file of a linked instance definition can have the following possible states.
Use InstanceObject.ArchiveFileStatus to query a instance definition's archive file status.