Rhino.FileIO.BinaryArchiveWriter.BeginWrite3dmChunk(System.UInt32,System.Int32,System.Int32)
Begins writing a chunk
typecode: chunk's typecode
majorVersion:
minorVersion:
Returns:
True if input was valid and chunk was started.  In this case you must call
EndWrite3dmChunk(), even if something goes wrong while you attempt to write
the contents of the chunk.
False if input was not valid or the write failed.

Rhino.FileIO.BinaryArchiveWriter.EndWrite3dmChunk
updates length in chunk header
Returns:

Rhino.FileIO.BinaryArchiveWriter.EnableCRCCalculation(System.Boolean)
Expert user function to control CRC calculation while reading and writing.
Typically this is used when seeking around and reading/writing information
in non-serial order.
enable:
Returns:
Current state of CRC calculation.  Use the returned value to restore the
CRC calculation setting after you are finished doing your fancy pants
expert IO.

Rhino.FileIO.BinaryArchiveWriter.WriteUtf8String(System.String)
Writes a System.String value to the archive.
value: A value to write.

Rhino.FileIO.BinaryArchiveWriter.WriteCompressedBuffer(System.Collections.Generic.IEnumerable{System.Byte})
Writes a list, an array, or any enumerable of System.Byte to the archive as a compressed buffer.
The return will always be an array.
value: A value to write.

Rhino.FileIO.BinaryArchiveWriter.WriteObjRef(Rhino.DocObjects.ObjRef)
Writes a Rhino.DocObjects.ObjRef to the archive
Returns: the element that was read

Rhino.FileIO.BinaryArchiveWriter.WriteObjRefArray(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})
Writes a list, an array, or any enumerable of Rhino.DocObjects.ObjRef to the archive.
The return will always be an array.
objrefs: A value to write.

Rhino.FileIO.BinaryArchiveWriter.WriteRenderSettings(Rhino.Render.RenderSettings)
Writes a Rhino.Render.RenderSettings value to the archive.
value: A value to write.

Rhino.FileIO.BinaryArchiveWriter.WriteEmptyCheckSum
Reads a legacy ON_CheckSum, only provided to read data chunks from old
V5 files, the CheckSum read is discarded