Rhino.UI.DrawingUtilities.IconFromResource(System.String,System.Reflection.Assembly)
Load a Icon from an embedded resource.
resourceName:
The case-sensitive name of the icon manifest resource being requested.
assembly:
The assembly containing the manifest resource, will use the calling
assembly if null.
Returns:
The Icon resource if found and loaded otherwise null.

Rhino.UI.DrawingUtilities.IconFromResource(System.String,System.Drawing.Size,System.Reflection.Assembly)
Load a Icon from an embedded resource.
resourceName:
The case-sensitive name of the icon manifest resource being requested.
size:
The desired size of the icon.
assembly:
The assembly containing the manifest resource, will use the calling
assembly if null.
Returns:
The Icon resource if found and loaded otherwise null.

Rhino.UI.DrawingUtilities.BitmapFromIconResource(System.String,System.Drawing.Size,System.Reflection.Assembly)
Load a Icon from an embedded resource and convert it to a bitmap of the
specified size.  Will look for a icon image that is greater than or
equal to the requested size, if all images are less than the requested
size the largest image will be used.
resourceName:
bitmapSize:
Desired bitmap size
assembly:
The assembly containing the manifest resource, will use the calling
assembly if null.
Returns:

Rhino.UI.DrawingUtilities.ImageFromResource(System.String,System.Reflection.Assembly)
Load a Image from an embedded resource.
resourceName:
The case-sensitive name of the image manifest resource being requested.
assembly:
The assembly containing the manifest resource, will use the calling
assembly if null.
Returns:
The Image resource if found and loaded otherwise null.

Rhino.UI.DrawingUtilities.LoadBitmapWithScaleDown(System.String,System.Int32,System.Reflection.Assembly)
Loads an icon from an embedded resource and converts it to a bitmap.
If the icon is not a standard size, this function scales down a larger
image.
iconName:
The case-sensitive name of the icon manifest resource being requested.
sizeDesired:
The desired size, in pixels, of the icon.
assembly:
The assembly containing the manifest resource.
Returns:
The icon converted to a bitmap if successful, null otherwise.
Throws System.ArgumentException:
Thrown when iconName is not found as an embedded resource in the
specified assembly.

Rhino.UI.DrawingUtilities.LoadIconWithScaleDown(System.String,System.Int32,System.Reflection.Assembly)
Loads an icon from an embedded resource.
If the icon is not a standard size, this function scales down a larger
image.
iconName:
The case-sensitive name of the icon manifest resource being requested.
sizeDesired:
The desired size, in pixels, of the icon.
assembly:
The assembly containing the manifest resource.
Returns: The icon if successful, null otherwise.
Throws System.ArgumentException:
Thrown when iconName is not found as an embedded resource in the
specified assembly.

Rhino.UI.DrawingUtilities.CreateMeshPreviewImage(Rhino.Geometry.Mesh,System.Drawing.Color,System.Drawing.Size)
Creates a preview image of a mesh.
mesh: The mesh.
color: The draw color.
size: The size of the preview image.
Returns: A bitmap if successful, null othewise.

Rhino.UI.DrawingUtilities.CreateMeshPreviewImage(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{System.Drawing.Color},System.Drawing.Size)
Creates a preview image of one or more meshs.
meshes: The meshes.
colors: The draw colors, one for each mesh.
size: The size of the preview image.
Returns: A bitmap if successful, null othewise.