Rhino.Geometry.OrdinateDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)
Initialize Dimension parameters
dimStyle:
plane:
direction:
basepoint:
defpoint:
leaderpoint:
kinkoffset1:
kinkoffset2:
Returns:

Rhino.Geometry.OrdinateDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)
Update Dimension geometry from point locations
plane:
direction:
basepoint:
defpoint:
leaderpoint:
kinkoffset1:
kinkoffset2:
Returns:

Rhino.Geometry.OrdinateDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
basepoint:
defpoint:
leaderpoint:
kinkpoint1:
kinkpoint2:
Returns: