Rhino.DocObjects.Custom.UserDataList.Remove(Rhino.DocObjects.Custom.UserData)
Remove the userdata from this list
userdata:
Returns: true if the user data was successfully removed

Rhino.DocObjects.Custom.UserDataList.GetEnumerator
Get enumerator for UserDataList
Returns:

Rhino.DocObjects.Custom.UserDataList.Purge
Removes all user data from this geometry.
Remarks: User Rhino.DocObjects.Custom.UserDataList.Remove(Rhino.DocObjects.Custom.UserData) to delete a single, known, item.