Rhino.Render.GroundPlane.#ctor
Create an utility object not associated with any document

Rhino.Render.GroundPlane.#ctor(Rhino.Render.GroundPlane)
Create an utility object not associated with any document from another object
g:

Rhino.Render.GroundPlane.Changed
This event is raised when a GroundPlane property value is changed.

Rhino.Render.GroundPlane.Enabled
Determines whether the document ground plane is enabled.

Rhino.Render.GroundPlane.ShadowOnly
Determines whether the ground plane shows the material assigned, or whether it is transparent, but captures shadows.

Rhino.Render.GroundPlane.AutoAltitude
Determines whether the ground plane is fixed by the Altitude property, or whether it is automatically placed at the lowest point in the model.

Rhino.Render.GroundPlane.ShowUnderside
If this is off, the ground plane will not be visible when seen from below.

Rhino.Render.GroundPlane.Altitude
Height above world XY plane in model units.

Rhino.Render.GroundPlane.MaterialInstanceId
Id of material in material table for this ground plane.

Rhino.Render.GroundPlane.TextureOffset
Texture mapping offset in world units.

Rhino.Render.GroundPlane.TextureSize
Texture mapping single UV span size in world units.

Rhino.Render.GroundPlane.TextureRotation
Texture mapping rotation around world origin + offset in degrees.

Rhino.Render.GroundPlane.TextureSizeLocked
Texture size locked.

Rhino.Render.GroundPlane.TextureOffsetLocked
Texture offset locked.