Rhino.Geometry.Collections.NurbsSurfacePointList.GetGrevillePoint(System.Int32,System.Int32)
Gets the 2-D Greville point associated with the control point at the given (u, v) index.
u: Index of control point in the surface U direction.
v: Index of control point in the surface V direction.
Returns: A Surface UV coordinate on success, Point2d.Unset on failure.

Rhino.Geometry.Collections.NurbsSurfacePointList.GetControlPoint(System.Int32,System.Int32)
Gets the control point at the given (u, v) index.
u: Index of control point in the surface U direction.
v: Index of control point in the surface V direction.
Returns: The control point at the given (u, v) index.

Rhino.Geometry.Collections.NurbsSurfacePointList.SetControlPoint(System.Int32,System.Int32,Rhino.Geometry.ControlPoint)
Sets the control point at the given (u, v) index.
u: Index of control point in the surface U direction.
v: Index of control point in the surface V direction.
cp: The control point to set.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsSurfacePointList.SetControlPoint(System.Int32,System.Int32,Rhino.Geometry.Point3d)
Sets the control point at the given (u, v) index.
u: Index of control point in the surface U direction.
v: Index of control point in the surface V direction.
cp: The control point location to set (weight is assumed to be 1.0).
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsSurfacePointList.SetPoint(System.Int32,System.Int32,System.Double,System.Double,System.Double)
Sets a world 3-D, or Euclidean, control point at the given (u, v) index.
The 4-D representation is (x, y, z, 1.0).
u: Index of control point in the surface U direction.
v: Index of control point in the surface V direction.
x: X coordinate of control point.
y: Y coordinate of control point.
z: Z coordinate of control point.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsSurfacePointList.SetPoint(System.Int32,System.Int32,System.Double,System.Double,System.Double,System.Double)
Sets a homogeneous control point at the given (u, v) index, where the 4-D representation is (x, y, z, w).
The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
u: Index of control point in the surface U direction.
v: Index of control point in the surface V direction.
x: X coordinate of control point.
y: Y coordinate of control point.
z: Z coordinate of control point.
weight: Weight of control point.
Returns: true on success, false on failure.
Remarks:
For expert use only. If you do not understand homogeneous coordinates, then
use an override that accepts world 3-D, or Euclidean, coordinates as input.

Rhino.Geometry.Collections.NurbsSurfacePointList.SetPoint(System.Int32,System.Int32,Rhino.Geometry.Point3d)
Sets a world 3-D, or Euclidean, control point at the given (u, v) index.
The 4-D representation is (x, y, z, 1.0).
u: Index of control point in the surface U direction.
v: Index of control point in the surface V direction.
point: Coordinate of control point.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsSurfacePointList.SetPoint(System.Int32,System.Int32,Rhino.Geometry.Point4d)
Sets a homogeneous control point at the given (u, v) index, where the 4-D representation is (x, y, z, w).
The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
u: Index of control point in the surface U direction.
v: Index of control point in the surface V direction.
point: Coordinate and weight of control point.
Returns: true on success, false on failure.
Remarks:
For expert use only. If you do not understand homogeneous coordinates, then
use an override that accepts world 3-D, or Euclidean, coordinates as input.

Rhino.Geometry.Collections.NurbsSurfacePointList.SetPoint(System.Int32,System.Int32,Rhino.Geometry.Point3d,System.Double)
Sets a world 3-D, or Euclidean, control point and weight at a given index.
The 4-D representation is (x*w, y*w, z*w, w).
u: Index of control point in the surface U direction.
v: Index of control point in the surface V direction.
point: Coordinates of the control point.
weight: Weight of control point.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsSurfacePointList.GetPoint(System.Int32,System.Int32,Rhino.Geometry.Point3d@)
Gets a world 3-D, or Euclidean, control point at the given (u, v) index.
The 4-D representation is (x, y, z, 1.0).
u: Index of control point in the surface U direction.
v: Index of control point in the surface V direction.
point: Coordinate of control point.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.NurbsSurfacePointList.GetPoint(System.Int32,System.Int32,Rhino.Geometry.Point4d@)
Gets a homogeneous control point at the given (u, v) index, where the 4-D representation is (x, y, z, w).
The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
u: Index of control point in the surface U direction.
v: Index of control point in the surface V direction.
point: Coordinate and weight of control point.
Returns: true on success, false on failure.
Remarks:
For expert use only. If you do not understand homogeneous coordinates, then
use the override that returns world 3-D, or Euclidean, coordinates.

Rhino.Geometry.Collections.NurbsSurfacePointList.SetWeight(System.Int32,System.Int32,System.Double)
Sets the weight of a control point at the given (u, v) index.
Note, if the surface is non-rational, it will be converted to rational.
u: Index of control-point along surface U direction.
v: Index of control-point along surface V direction.
weight: The control point weight.
Returns: true if successful, false otherwise.

Rhino.Geometry.Collections.NurbsSurfacePointList.GetWeight(System.Int32,System.Int32)
Gets the weight of a control point at the given (u, v) index.
Note, if the surface is non-rational, the weight will be 1.0.
u: Index of control-point along surface U direction.
v: Index of control-point along surface V direction.
Returns: The control point weight if successful, Rhino.Math.UnsetValue otherwise.

Rhino.Geometry.Collections.NurbsSurfacePointList.ValidateSpacing(System.Double,System.Double,Rhino.IndexPair[]@,Rhino.IndexPair[]@)
Simple check of distance between adjacent control points
closeTolerance:
stackTolerance:
closeIndices:
stackedIndices:
Returns:

Rhino.Geometry.Collections.NurbsSurfacePointList.EpsilonEquals(Rhino.Geometry.Collections.NurbsSurfacePointList,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns: