Rhino.Geometry.Brep.CreateFromMesh(Rhino.Geometry.Mesh,System.Boolean)
Create a brep representation of a mesh
mesh:
trimmedTriangles:
if true, triangles in the mesh will be represented by trimmed planes in
the brep. If false, triangles in the mesh will be represented by
untrimmed singular bilinear NURBS surfaces in the brep.
Returns:

Rhino.Geometry.Brep.CreateTrimmedPlane(Rhino.Geometry.Plane,Rhino.Geometry.Curve)
Create a Brep trimmed plane.
plane: Plane that will be trimmed.
curve: A simple (no self intersections) closed curve that defines the outer boundary of the trimmed plane.
Returns: Resulting brep or null on failure.

Rhino.Geometry.Brep.CreateTrimmedPlane(Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Create a Brep trimmed plane.
plane: Plane that will be trimmed.
curves: A list of curves that form a simple (no self intersections) closed curve that defines the outer boundary of the trimmed plane.
Returns: Resulting brep or null on failure.

Rhino.Geometry.Brep.CreatePlanarBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Constructs a set of planar breps as outlines by the loops.
inputLoops: Curve loops that delineate the planar boundaries.
tolerance:
Returns: An array of Planar Breps.

Rhino.Geometry.Brep.CreatePlanarBreps(Rhino.Geometry.Curve,System.Double)
Constructs a set of planar breps as outlines by the loops.
inputLoop: A curve that should form the boundaries of the surfaces or polysurfaces.
tolerance:
Returns: An array of Planar Breps.

Rhino.Geometry.Brep.CreateTrimmedSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Surface,System.Double)
Constructs a Brep using the trimming information of a brep face and a surface.
Surface must be roughly the same shape and in the same location as the trimming brep face.
trimSource: BrepFace which contains trimmingSource brep.
surfaceSource: Surface that trims of BrepFace will be applied to.
tolerance:
Returns: A brep with the shape of surfaceSource and the trims of trimSource or null on failure.

Rhino.Geometry.Brep.CreatePlanarBreps(Rhino.Collections.CurveList)
Constructs a set of planar Breps as outlines by the loops.
inputLoops: Curve loops that delineate the planar boundaries.
Returns: An array of Planar Breps or null on error.

Rhino.Geometry.Brep.CreatePlanarBreps(Rhino.Collections.CurveList,System.Double)
Constructs a set of planar Breps as outlines by the loops.
inputLoops: Curve loops that delineate the planar boundaries.
tolerance:
Returns: An array of Planar Breps.

Rhino.Geometry.Brep.CreateFromOffsetFace(Rhino.Geometry.BrepFace,System.Double,System.Double,System.Boolean,System.Boolean)
Offsets a face including trim information to create a new brep.
face: the face to offset.
offsetDistance: An offset distance.
offsetTolerance:
Use 0.0 to make a loose offset. Otherwise, the document's absolute tolerance is usually sufficient.
bothSides: When true, offset to both sides of the input face.
createSolid: When true, make a solid object.
Returns:
A new brep if successful. The brep can be disjoint if bothSides is true and createSolid is false,
or if createSolid is true and connecting the offsets with side surfaces fails.
null if unsuccessful.

Rhino.Geometry.Brep.CreateSolid(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Constructs closed polysurfaces from surfaces and polysurfaces that bound a region in space.
breps:
The intersecting surfaces and polysurfaces to automatically trim and join into closed polysurfaces.
tolerance:
The trim and join tolerance. If set to RhinoMath.UnsetValue, Rhino's global absolute tolerance is used.
Returns: The resulting polysurfaces on success or null on failure.

Rhino.Geometry.Brep.MergeSurfaces(Rhino.Geometry.Surface,Rhino.Geometry.Surface,System.Double,System.Double)
Merges two surfaces into one surface at untrimmed edges.
surface0: The first surface to merge.
surface1: The second surface to merge.
tolerance: Surface edges must be within this tolerance for the two surfaces to merge.
angleToleranceRadians: Edge must be within this angle tolerance in order for contiguous edges to be combined into a single edge.
Returns: The merged surfaces as a Brep if successful, null if not successful.

Rhino.Geometry.Brep.MergeSurfaces(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double,System.Double)
Merges two surfaces into one surface at untrimmed edges. Both surfaces must be untrimmed and share an edge.
brep0: The first single-face Brep to merge.
brep1: The second single-face Brep to merge.
tolerance: Surface edges must be within this tolerance for the two surfaces to merge.
angleToleranceRadians: Edge must be within this angle tolerance in order for contiguous edges to be combined into a single edge.
Returns: The merged Brep if successful, null if not successful.

Rhino.Geometry.Brep.MergeSurfaces(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double,System.Double,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,System.Double,System.Boolean)
Merges two surfaces into one surface at untrimmed edges. Both surfaces must be untrimmed and share an edge.
brep0: The first single-face Brep to merge.
brep1: The second single-face Brep to merge.
tolerance: Surface edges must be within this tolerance for the two surfaces to merge.
angleToleranceRadians: Edge must be within this angle tolerance in order for contiguous edges to be combined into a single edge.
point0: 2D pick point on the first single-face Brep. The value can be unset.
point1: 2D pick point on the second single-face Brep. The value can be unset.
roundness: Defines the roundness of the merge. Acceptable values are between 0.0 (sharp) and 1.0 (smooth).
smooth: The surface will be smooth. This makes the surface behave better for control point editing, but may alter the shape of both surfaces.
Returns: The merged Brep if successful, null if not successful.

Rhino.Geometry.Brep.CreatePatch(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.Surface,System.Double)
Constructs a brep patch.
This is the simple version of fit that uses a specified starting surface.
geometry:
Combination of Curves, BrepTrims, Points, PointClouds or Meshes.
Curves and trims are sampled to get points. Trims are sampled for
points and normals.
startingSurface: A starting surface (can be null).
tolerance:
Tolerance used by input analysis functions for loop finding, trimming, etc.
Returns:
Brep fit through input on success, or null on error.

Rhino.Geometry.Brep.CreatePatch(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Int32,System.Int32,System.Double)
Constructs a brep patch.
This is the simple version of fit that uses a plane with u x v spans.
It makes a plane by fitting to the points from the input geometry to use as the starting surface.
The surface has the specified u and v span count.
geometry:
A combination of curves, brep trims,
points, point clouds or meshes.
Curves and trims are sampled to get points. Trims are sampled for
points and normals.
uSpans: The number of spans in the U direction.
vSpans: The number of spans in the V direction.
tolerance:
Tolerance used by input analysis functions for loop finding, trimming, etc.
Returns:
A brep fit through input on success, or null on error.

Rhino.Geometry.Brep.CreatePatch(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.Surface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Double,System.Double,System.Double,System.Boolean[],System.Double)
Constructs a brep patch using all controls
geometry:
A combination of curves, brep trims,
points, point clouds or meshes.
Curves and trims are sampled to get points. Trims are sampled for
points and normals.
startingSurface: A starting surface (can be null).
uSpans:
Number of surface spans used when a plane is fit through points to start in the U direction.
vSpans:
Number of surface spans used when a plane is fit through points to start in the U direction.
trim:
If true, try to find an outer loop from among the input curves and trim the result to that loop
tangency:
If true, try to find brep trims in the outer loop of curves and try to
fit to the normal direction of the trim's surface at those locations.
pointSpacing:
Basic distance between points sampled from input curves.
flexibility:
Determines the behavior of the surface in areas where its not otherwise
controlled by the input.  Lower numbers make the surface behave more
like a stiff material; higher, less like a stiff material.  That is,
each span is made to more closely match the spans adjacent to it if there
is no input geometry mapping to that area of the surface when the
flexibility value is low.  The scale is logrithmic. Numbers around 0.001
or 0.1 make the patch pretty stiff and numbers around 10 or 100 make the
surface flexible.
surfacePull:
Tends to keep the result surface where it was before the fit in areas where
there is on influence from the input geometry
fixEdges:
Array of four elements. Flags to keep the edges of a starting (untrimmed)
surface in place while fitting the interior of the surface.  Order of
flags is left, bottom, right, top
tolerance:
Tolerance used by input analysis functions for loop finding, trimming, etc.
Returns:
A brep fit through input on success, or null on error.

Rhino.Geometry.Brep.CreatePipe(Rhino.Geometry.Curve,System.Double,System.Boolean,Rhino.Geometry.PipeCapMode,System.Boolean,System.Double,System.Double)
Creates a single walled pipe
rail: the path curve for the pipe
radius: radius of the pipe
localBlending:
If True, Local (pipe radius stays constant at the ends and changes more rapidly in the middle) is applied.
If False, Global (radius is linearly blended from one end to the other, creating pipes that taper from one radius to the other) is applied
cap: end cap mode
fitRail:
If the curve is a polycurve of lines and arcs, the curve is fit and a single surface is created;
otherwise the result is a polysurface with joined surfaces created from the polycurve segments.
absoluteTolerance:
The sweeping and fitting tolerance. If you are unsure what to use, then use the document's absolute tolerance
angleToleranceRadians:
The angle tolerance. If you are unsure what to use, then either use the document's angle tolerance in radians
Returns: Array of created pipes on success

Rhino.Geometry.Brep.CreatePipe(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean,Rhino.Geometry.PipeCapMode,System.Boolean,System.Double,System.Double)
Creates a single walled pipe
rail: the path curve for the pipe
railRadiiParameters:
one or more normalized curve parameters where changes in radius occur.
Important: curve parameters must be normalized - ranging between 0.0 and 1.0.
radii: An array of radii - one at each normalized curve parameter in railRadiiParameters.
localBlending:
If True, Local (pipe radius stays constant at the ends and changes more rapidly in the middle) is applied.
If False, Global (radius is linearly blended from one end to the other, creating pipes that taper from one radius to the other) is applied
cap: end cap mode
fitRail:
If the curve is a polycurve of lines and arcs, the curve is fit and a single surface is created;
otherwise the result is a polysurface with joined surfaces created from the polycurve segments.
absoluteTolerance:
The sweeping and fitting tolerance. If you are unsure what to use, then use the document's absolute tolerance
angleToleranceRadians:
The angle tolerance. If you are unsure what to use, then either use the document's angle tolerance in radians
Returns: Array of created pipes on success

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Double)
General 1 rail sweep. If you are not producing the sweep results that you are after, then
use the SweepOneRail class with options to generate the swept geometry
rail: Rail to sweep shapes along
shape: Shape curve
closed: Only matters if shape is closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double)
General 1 rail sweep. If you are not producing the sweep results that you are after, then
use the SweepOneRail class with options to generate the swept geometry
rail: Rail to sweep shapes along
shapes: Shape curves
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Double)
General 2 rail sweep. If you are not producing the sweep results that you are after, then
use the SweepTwoRail class with options to generate the swept geometry
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
shape: Shape curve
closed: Only matters if shape is closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double)
General 2 rail sweep. If you are not producing the sweep results that you are after, then
use the SweepTwoRail class with options to generate the swept geometry
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
shapes: Shape curves
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results

Rhino.Geometry.Brep.CreateFromTaperedExtrude(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,System.Double,Rhino.Geometry.ExtrudeCornerType,System.Double,System.Double)
Extrude a curve to a taper making a brep (potentially more than 1)
curveToExtrude: the curve to extrude
distance: the distance to extrude
direction: the direction of the extrusion
basePoint: the basepoint of the extrusion
draftAngleRadians: angle of the extrusion
cornerType:
tolerance: tolerance to use for the extrusion
angleToleranceRadians: angle tolerance to use for the extrusion
Returns: array of breps on success

Rhino.Geometry.Brep.CreateFromTaperedExtrude(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,System.Double,Rhino.Geometry.ExtrudeCornerType)
Extrude a curve to a taper making a brep (potentially more than 1)
curveToExtrude: the curve to extrude
distance: the distance to extrude
direction: the direction of the extrusion
basePoint: the basepoint of the extrusion
draftAngleRadians: angle of the extrusion
cornerType:
Returns: array of breps on success
Remarks: tolerances used are based on the active doc tolerance

Rhino.Geometry.Brep.CreateBlendSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.BrepEdge,Rhino.Geometry.Interval,System.Boolean,Rhino.Geometry.BlendContinuity,Rhino.Geometry.BrepFace,Rhino.Geometry.BrepEdge,Rhino.Geometry.Interval,System.Boolean,Rhino.Geometry.BlendContinuity)
Makes a surface blend between two surface edges.
face0: First face to blend from.
edge0: First edge to blend from.
domain0: The domain of edge0 to use.
rev0: If false, edge0 will be used in its natural direction. If true, edge0 will be used in the reversed direction.
continuity0: Continuity for the blend at the start.
face1: Second face to blend from.
edge1: Second edge to blend from.
domain1: The domain of edge1 to use.
rev1: If false, edge1 will be used in its natural direction. If true, edge1 will be used in the reversed direction.
continuity1: Continuity for the blend at the end.
Returns: Array of Breps if successful.

Rhino.Geometry.Brep.CreateBlendShape(Rhino.Geometry.BrepFace,Rhino.Geometry.BrepEdge,System.Double,System.Boolean,Rhino.Geometry.BlendContinuity,Rhino.Geometry.BrepFace,Rhino.Geometry.BrepEdge,System.Double,System.Boolean,Rhino.Geometry.BlendContinuity)
Makes a curve blend between points on two surface edges. The blend will be tangent to the surfaces and perpendicular to the edges.
face0: First face to blend from.
edge0: First edge to blend from.
t0: Location on first edge for first end of blend curve.
rev0: If false, edge0 will be used in its natural direction. If true, edge0 will be used in the reversed direction.
continuity0: Continuity for the blend at the start.
face1: Second face to blend from.
edge1: Second edge to blend from.
t1: Location on second edge for second end of blend curve.
rev1: If false, edge1 will be used in its natural direction. If true, edge1 will be used in the reversed direction.
continuity1: >Continuity for the blend at the end.
Returns: The blend curve on success. null on failure

Rhino.Geometry.Brep.CreateFilletSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Double)
Creates a constant-radius round surface between two surfaces.
face0: First face to fillet from.
uv0: A parameter face0 at the side you want to keep after filleting.
face1: Second face to fillet from.
uv1: A parameter face1 at the side you want to keep after filleting.
radius: The fillet radius.
extend: If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
tolerance: The tolerance. In in doubt, the the document's model absolute tolerance.
Returns: Array of Breps if successful.

Rhino.Geometry.Brep.CreateFilletSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Boolean,System.Double,Rhino.Geometry.Brep[]@,Rhino.Geometry.Brep[]@)
Creates a constant-radius round surface between two surfaces.
face0: First face to fillet from.
uv0: A parameter face0 at the side you want to keep after filleting.
face1: Second face to fillet from.
uv1: A parameter face1 at the side you want to keep after filleting.
radius: The fillet radius.
trim: If true, the input faces will be trimmed, if false, the input faces will be split.
extend: If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
tolerance: The tolerance. In in doubt, the the document's model absolute tolerance.
outBreps0: The trim or split results of the Brep owned by face0.
outBreps1: The trim or split results of the Brep owned by face1.
Returns: Array of Breps if successful.

Rhino.Geometry.Brep.CreateChamferSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Double)
Creates a ruled surface as a bevel between two input surface edges.
face0: First face to chamfer from.
uv0: A parameter face0 at the side you want to keep after chamfering.
radius0: The distance from the intersection of face0 to the edge of the chamfer.
face1: Second face to chamfer from.
uv1: A parameter face1 at the side you want to keep after chamfering.
radius1: The distance from the intersection of face1 to the edge of the chamfer.
extend: If true, then when one input surface is longer than the other, the chamfer surface is extended to the input surface edges.
tolerance: The tolerance. In in doubt, the the document's model absolute tolerance.
Returns: Array of Breps if successful.

Rhino.Geometry.Brep.CreateChamferSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Boolean,System.Double,Rhino.Geometry.Brep[]@,Rhino.Geometry.Brep[]@)
Creates a ruled surface as a bevel between two input surface edges.
face0: First face to chamfer from.
uv0: A parameter face0 at the side you want to keep after chamfering.
radius0: The distance from the intersection of face0 to the edge of the chamfer.
face1: Second face to chamfer from.
uv1: A parameter face1 at the side you want to keep after chamfering.
radius1: The distance from the intersection of face1 to the edge of the chamfer.
trim: If true, the input faces will be trimmed, if false, the input faces will be split.
extend: If true, then when one input surface is longer than the other, the chamfer surface is extended to the input surface edges.
tolerance: The tolerance. In in doubt, the the document's model absolute tolerance.
outBreps0: The trim or split results of the Brep owned by face0.
outBreps1: The trim or split results of the Brep owned by face1.
Returns: Array of Breps if successful.

Rhino.Geometry.Brep.CreateFilletEdges(Rhino.Geometry.Brep,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},Rhino.Geometry.BlendType,Rhino.Geometry.RailType,System.Double)
Fillets, chamfers, or blends the edges of a brep.
brep: The brep to fillet, chamfer, or blend edges.
edgeIndices: An array of one or more edge indices where the fillet, chamfer, or blend will occur.
startRadii: An array of starting fillet, chamfer, or blend radaii, one for each edge index.
endRadii: An array of ending fillet, chamfer, or blend radaii, one for each edge index.
blendType: The blend type.
railType: The rail type.
tolerance: The tolerance to be used to perform calculations.
Returns: Array of Breps if successful.

Rhino.Geometry.Brep.CreateOffsetBrep(Rhino.Geometry.Brep,System.Double,System.Boolean,System.Boolean,System.Double,Rhino.Geometry.Brep[]@,Rhino.Geometry.Brep[]@)
Offsets a Brep.
brep: The Brep to offset.
distance:
The distance to offset. This is a signed distance value with respect to
face normals and flipped faces.
solid:
If true, then the function makes a closed solid from the input and offset
surfaces by lofting a ruled surface between all of the matching edges.
extend:
If true, then the function maintains the sharp corners when the original
surfaces have sharps corner. If False, then the function creates fillets
at sharp corners in the original surfaces.
tolerance: The offset tolerance.
outBlends: The results of the calculation.
outWalls: The results of the calculation.
Returns:
Array of Breps if successful. If the function succeeds in offsetting, a
single Brep will be returned. Otherwise, the array will contain the
offset surfaces, outBlends will contain the set of blends used to fill
in gaps (if extend is false), and outWalls will contain the set of wall
surfaces that was supposed to join the offset to the original (if solid
is true).

Rhino.Geometry.Brep.CreateFromJoinedEdges(Rhino.Geometry.Brep,System.Int32,Rhino.Geometry.Brep,System.Int32,System.Double)
Joins two naked edges, or edges that are coincident or close together, from two Breps.
brep0: The first Brep.
edgeIndex0: The edge index on the first Brep.
brep1: The second Brep.
edgeIndex1: The edge index on the second Brep.
joinTolerance: The join tolerance.
Returns: The resulting Brep if successful, null on failure.

Rhino.Geometry.Brep.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double,System.Boolean)
Compute the Boolean Union of a set of Breps.
breps: Breps to union.
tolerance: Tolerance to use for union operation.
manifoldOnly: If true, non-manifold input breps are ignored.
Returns: An array of Brep results or null on failure.

Rhino.Geometry.Brep.CreateBooleanIntersection(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double,System.Boolean)
Compute the Solid Intersection of two sets of Breps.
firstSet: First set of Breps.
secondSet: Second set of Breps.
tolerance: Tolerance to use for intersection operation.
manifoldOnly: If true, non-manifold input breps are ignored.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function

Rhino.Geometry.Brep.CreateBooleanIntersection(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double,System.Boolean)
Compute the Solid Intersection of two Breps.
firstBrep: First Brep for boolean intersection.
secondBrep: Second Brep for boolean intersection.
tolerance: Tolerance to use for intersection operation.
manifoldOnly: If true, non-manifold input breps are ignored.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function

Rhino.Geometry.Brep.CreateBooleanDifference(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double,System.Boolean)
Compute the Solid Difference of two sets of Breps.
firstSet: First set of Breps (the set to subtract from).
secondSet: Second set of Breps (the set to subtract).
tolerance: Tolerance to use for difference operation.
manifoldOnly: If true, non-manifold input breps are ignored.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function

Rhino.Geometry.Brep.CreateBooleanDifference(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double,System.Boolean)
Compute the Solid Difference of two Breps.
firstBrep: First Brep for boolean difference.
secondBrep: Second Brep for boolean difference.
tolerance: Tolerance to use for difference operation.
manifoldOnly: If true, non-manifold input breps are ignored.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function

Rhino.Geometry.Brep.CreateShell(Rhino.Geometry.Brep,System.Collections.Generic.IEnumerable{System.Int32},System.Double,System.Double)
Creates a hollowed out shell from a solid Brep. Function only operates on simple, solid, manifold Breps.
brep: The solid Brep to shell.
facesToRemove: The indices of the Brep faces to remove. These surfaces are removed and the remainder is offset inward, using the outer parts of the removed surfaces to join the inner and outer parts.
distance: The distance, or thickness, for the shell. This is a signed distance value with respect to face normals and flipped faces.
tolerance: The offset tolerane. When in doubt, use the document's absolute tolerance.
Returns: An array of Brep results or null on failure.

Rhino.Geometry.Brep.MergeBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Combines two or more breps into one. A merge is like a boolean union that keeps the inside pieces. This
function creates non-manifold Breps which in general are unusual in Rhino. You may want to consider using
JoinBreps or CreateBooleanUnion functions instead.
brepsToMerge: must contain more than one Brep.
tolerance: the tolerance to use when merging.
Returns: Single merged Brep on success. Null on error.
Rhino.Geometry.Brep.JoinBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)

Rhino.Geometry.Brep.#ctor
Initializes a new empty brep

Rhino.Geometry.Brep.Vertices


Rhino.Geometry.Brep.Surfaces
Parametric surfaces used by faces

Rhino.Geometry.Brep.Trims
Gets the brep trims list accessor.

Rhino.Geometry.Brep.Curves2D
Parameter space trimming curves (used by trims)

Rhino.Geometry.Brep.Curves3D
Pointers to 3d curves (used by edges)

Rhino.Geometry.Brep.IsSurface
Returns true if the Brep has a single face and that face is geometrically the same
as the underlying surface.  I.e., the face has trivial trimming.
In this case, the surface is the first face surface. The flag
Brep.Faces[0].OrientationIsReversed records the correspondence between the surface's
natural parametric orientation and the orientation of the Brep.
trivial trimming here means that there is only one loop curve in the brep
and that loop curve is the same as the underlying surface boundary.

Rhino.Geometry.Brep.DuplicateNakedEdgeCurves(System.Boolean,System.Boolean)
Duplicate naked edges of this Brep
outer:
inner:
Returns:

Rhino.Geometry.Brep.UnjoinEdges(System.Collections.Generic.IEnumerable{System.Int32})
Unjoins, or separates, edges within the Brep. Note, seams in closed surfaces will not separate.
edgesToUnjoin: The indices of the Brep edges to unjoin.
Returns: This Brep is not modified, the trim results are returned in an array.

Rhino.Geometry.Brep.JoinEdges(System.Int32,System.Int32,System.Double,System.Boolean)
Joins two naked edges, or edges that are coincident or close together.
edgeIndex0: The first edge index.
edgeIndex1: The second edge index.
joinTolerance: The join tolerance.
compact:
If joining more than one edge pair and want the edge indices of subsequent pairs to remain valid,
set to false. But then call Brep.Compact() on the final result.
Returns: true if successful, false otherwise.

Rhino.Geometry.Brep.TransformComponent(System.Collections.Generic.IEnumerable{Rhino.Geometry.ComponentIndex},Rhino.Geometry.Transform,System.Double,System.Double,System.Boolean)
Transform an array of Brep components, bend neighbors to match, and leave the rest fixed.
components: The Brep components to transform.
xform: The transformation to apply.
tolerance: The desired fitting tolerance to use when bending faces that share edges with both fixed and transformed components.
timeLimit:
If the deformation is extreme, it can take a long time to calculate the result.
If time_limit > 0, then the value specifies the maximum amount of time in seconds you want to spend before giving up.
useMultipleThreads: True if multiple threads can be used.
Returns: true if successful, false otherwise.

Rhino.Geometry.Brep.AddTrimCurve(Rhino.Geometry.Curve)
Add a 2d curve used by the brep trims
curve:
Returns:
Index used to reference this geometry in the trimming curve list

Rhino.Geometry.Brep.AddEdgeCurve(Rhino.Geometry.Curve)
Add a 3d curve used by the brep edges
curve:
Returns:
Index used to reference this geometry in the edge curve list

Rhino.Geometry.Brep.Append(Rhino.Geometry.Brep)
Appends a copy of another brep to this and updates indices of appended
brep parts.  Duplicates are not removed
other:

Rhino.Geometry.Brep.SetVertices
This function can be used to compute vertex information for a
b-rep when everything but the Vertices array is properly filled in.
It is intended to be used when creating a Brep from a
definition that does not include explicit vertex information.

Rhino.Geometry.Brep.SetTrimIsoFlags
This function can be used to set the BrepTrim::m_iso
flag. It is intended to be used when creating a Brep from
a definition that does not include compatible parameter space
type information.

Rhino.Geometry.Brep.SetTolerancesBoxesAndFlags
Set tolerances and flags in a Brep.

Rhino.Geometry.Brep.SetTolerancesBoxesAndFlags(System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Set tolerances and flags in a Brep.
bLazy: If true, only flags and tolerances that are not set will be calculated.
bSetVertexTolerances: Set true to compute BrepVertex tolerances.
bSetEdgeTolerances: Set true to compute BrepEdge tolerances.
bSetTrimTolerances: Set true to compute BrepTrim tolerances.
bSetTrimIsoFlags: Set true to compute BrepTrim.IsoStatus values.
bSetTrimTypeFlags: Set true to compute BrepTrim.TrimType values.
bSetLoopTypeFlags: Set true to compute BrepLoop.BrepLoopType values.
bSetTrimBoxes: Set true to compute BrepTrim bounding boxes.

Rhino.Geometry.Brep.MakeValidForV2
No support is available for this function.
Expert user function that converts all geometry in brep to nurbs form.
Remarks:
Don't call this function unless you know exactly what you are doing.

Rhino.Geometry.Brep.Repair(System.Double)
Fills in missing or fixes incorrect component information from a Brep.
Useful when reading Brep information from other file formats that do not
provide as complete of a Brep definition as requried by Rhino.
tol: The repair tolerance. When in doubt, use the document's model absolute tolerance.
Returns: True on success.