Rhino.Render.RenderContentStyles.SharedUI
Content supports UI sharing between contents of the same type id.

Rhino.Render.RenderContentStyles.Fields
Content uses fields to facilitate data storage and undo support. See Fields()

Rhino.Render.RenderContentStyles.ModalEditing
Content supports editing in a modal editor.

Rhino.Render.RenderContentStyles.DynamicFields
The content's fields are dynamic. Dynamic fields can be created during loading.