Rhino.UI.Gumball.GumballMode
Transformation modes for gumballs.

Rhino.UI.Gumball.GumballMode.Menu
gumball menu button was picked.

Rhino.UI.Gumball.GumballMode.ScaleX
GumballFrame.ScaleMode is used to enable multi-axis scaling.  This
indicates which control is being dragged.

Rhino.UI.Gumball.GumballMode.ScaleY
GumballFrame.ScaleMode is used to enable multi-axis scaling.  This
indicates which control is being dragged.

Rhino.UI.Gumball.GumballMode.ScaleZ
GumballFrame.ScaleMode is used to enable multi-axis scaling.  This
indicates which control is being dragged.