Rhino.UI.StackedDialogPage.Children
List of child (sub) pages of this page

Rhino.UI.StackedDialogPage.HasChildren
Will be true if this page contains sub pages.

Rhino.UI.StackedDialogPage.AddChildPage(Rhino.UI.StackedDialogPage)
Currently only supported on Windows.  Call this method to add a child
page to a page after the parent dialog has been created.
pageToAdd:

Rhino.UI.StackedDialogPage.Modified
Check to see if the page has been marked as modified or not.  Marking
the page as modified will cause the Apply button to get enabled if this
is currently the visible page and the page includes the Apply button.

Rhino.UI.StackedDialogPage.Handle
When running on Windows return the window handle for the parent of this
page otherwise; return IntPtr.Zero.

Rhino.UI.StackedDialogPage.RemovePage
Remove this page from the dialog box

Rhino.UI.StackedDialogPage.MakeActivePage
Make this page the active, visible page

Rhino.UI.StackedDialogPage.PageControl
Return the control that represents this page. Rhino Windows supports
classes that implement the IWin32Windows interface or are derived from
some form of System.Windows.FrameworkElement or Eto.Forms.Control.  Mac
Rhino supports controls that are derived from NSview or
Eto.Forms.Control.

Rhino.UI.StackedDialogPage.OnCreateParent(System.IntPtr)
Called when the parent window has been created on Windows platforms
only.
hwndParent:

Rhino.UI.StackedDialogPage.OnSizeParent(System.Int32,System.Int32)
Called when the parent window has been resized
width:
height:

Rhino.UI.StackedDialogPage.SetEnglishPageTitle(System.String)
Change the title passed to the constructor and, this will cause
LocalPageTitle to get called also.
newPageTile:

Rhino.UI.StackedDialogPage.EnglishPageTitle
English string used when scripting this page and a user prefixes a
command option with "_"

Rhino.UI.StackedDialogPage.LocalPageTitle
Localized page title that will appear on a tab or other page navigation
control.  This is also uses as a command line option when scripting
this page.

Rhino.UI.StackedDialogPage.PageImage
Optionally override to provide a image to display in
the Mac Rhino UI
The page image.

Rhino.UI.StackedDialogPage.ShowApplyButton
Called when this page is activated
Returns:
true  : if the page wants the "Apply" button to appear.
false : if the page does not want the "Apply" button to appear.
Default returns false
Note: If true is returned OnApply will get called when the button is
clicked.

Rhino.UI.StackedDialogPage.OnHelp
Called when the parent dialog requests help for this page.

Rhino.UI.StackedDialogPage.NavigationTextIsBold
Currently only used by Windows Rhino.  If this is set to true then the
tree control item text will be bold.

Rhino.UI.StackedDialogPage.NavigationTextColor
Currently only used by Windows Rhino.  If this is set to true then the
tree control item text be drawn using this color.  Set the color to
System.Drawing.Color.Empty to use the default color.