Rhino.Runtime.Interop.FontFromPointer(System.IntPtr)
Create managed Font from native ON_Font*
ptrManagedFont:
Returns:

Rhino.Runtime.Interop.ViewCaptureFromPointer(System.IntPtr)
Create a ViewCaptureSettings class from a native const CRhinoPrintInfo*
The pointer values are copied
ptrViewCapture:
Returns:

Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Display.ViewCaptureSettings)
Get a CRhinoPrintInfo* for a given ViewCaptureSettings class
settings:
Returns:

Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.DocObjects.ViewportInfo)
Get ON_Viewport* from a ViewportInfo instance
viewport:
Returns:

Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Display.RhinoViewport)
Get CRhinoViewport* from a RhinoViewport instance
viewport:
Returns:

Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Display.DisplayPipeline)
Get CRhinoDisplayPipeline* for a DisplayPipeline instance
pipeline:
Returns:

Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Input.Custom.GetPoint)
Get CRhinoGetPoint* from a GetPoint instance
getPoint:
Returns:

Rhino.Runtime.Interop.FileWriteOptionsConstPointer(Rhino.FileIO.FileWriteOptions)
Returns the underlying const CRhinoFileWriteOptions* for a Rhino.FileIO.FileWriteOptions object.
You should only be interested in using this function if you are writing C++ code.
options: A FileWriteOptions object.
Returns: A pointer to the Rhino const object.

Rhino.Runtime.Interop.FileReadOptionsConstPointer(Rhino.FileIO.FileReadOptions)
Returns the underlying const CRhinoFileReadOptions* for a Rhino.FileIO.FileReadOptions object.
You should only be interested in using this function if you are writing C++ code.
options: A FileReadOptions object.
Returns: A pointer to the Rhino const object.