Rhino.Geometry.Morphs.StretchSpaceMorph.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Constructs a stretch space morph.
start: Start of stretch axis.
end: End of stretch axis.>
point: End of new stretch axis.

Rhino.Geometry.Morphs.StretchSpaceMorph.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Constructs a stretch space morph.
start: Start of stretch axis.
end: End of stretch axis.>
length: Length of new stretch axis.

Rhino.Geometry.Morphs.StretchSpaceMorph.IsValid
Returns true if the space morph definition is valid, false otherwise.

Rhino.Geometry.Morphs.StretchSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point.
point: A point that will be morphed by this object.
Returns: Resulting morphed point.

Rhino.Geometry.Morphs.StretchSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.