Rhino.DocObjects.MaterialRef.MaterialSource
Determines if the simple material should come from the object or from
it's layer.

Rhino.DocObjects.MaterialRef.PlugInId
Identifies a rendering plug-in

Rhino.DocObjects.MaterialRef.FrontFaceMaterialId
The Id of the Material used to render the front of an object.

Rhino.DocObjects.MaterialRef.BackFaceMaterialId
The Id of the Material used to render the back of an object.

Rhino.DocObjects.MaterialRef.FrontFaceMaterialIndex
The index of the material used to render the front of an object

Rhino.DocObjects.MaterialRef.BackFaceMaterialIndex
The index of the material used to render the back of an object