Rhino.FileIO.File3dmLayerTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.Layer.

Rhino.FileIO.File3dmLayerTable.FindName(System.String,System.Guid)
Finds a Layer given its name.
name: The name of the Layer to be searched.
parentId: The id of the parent Layer to be searched.
Returns: A Layer, or null on error.

Rhino.FileIO.File3dmLayerTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a Layer given its name hash.
nameHash: The name hash of the Layer to be searched.
Returns: An Layer, or null on error.

Rhino.FileIO.File3dmLayerTable.FindIndex(System.Int32)
Retrieves a Layer object based on Index. This seach type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Layer object, or null if none was found.