Rhino.Geometry.HiddenLineDrawingObject.Geometry
Returns the geometry in world coordinates if UseXform is false.
Otherwise, the geometry in object space coordinates is returned.

Rhino.Geometry.HiddenLineDrawingObject.Transform
Returns the transformation passed into the Add... function
when setting up the hidden line drawing parameters.

Rhino.Geometry.HiddenLineDrawingObject.Tag
Returns the extra data used to cross-reference the object specified in
HiddenLineDrawing.AddObject.