Rhino.DocObjects.Worksession.Document
Gets the document that owns this worksession.

Rhino.DocObjects.Worksession.FileName
Returns the path to the open worksession, or .rws, file.
If there is no worksession file open, or the active worksession
has not yet been saved, then null is returned.

Rhino.DocObjects.Worksession.ModelCount
Returns the number of models in the worksession. The active model will included
in this count whether or not it has been saved.

Rhino.DocObjects.Worksession.ModelPaths
Returns the paths to the models used by the worksession. If the active model has
not been saved, then it will not be included in the output array.