Rhino.Geometry.Point3d.FromPoint3f(Rhino.Geometry.Point3f)
Converts a single-precision point in a double-precision point.
point: A point.
Returns: The resulting point.

Rhino.Geometry.Point3d.EpsilonEquals(Rhino.Geometry.Point3d,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:

Rhino.Geometry.Point3d.DistanceToSquared(Rhino.Geometry.Point3d)
Computes the square of the distance between two points.
This method is usually largely faster than DistanceTo().
other: Other point for squared distance measurement.
Returns: The squared length of the line between this and the other point; or 0 if any of the points is not valid.