Rhino.Render.ChangeQueue.ClippingPlane.IsEnabled
True if clipping plane is enabled

Rhino.Render.ChangeQueue.ClippingPlane.Plane
Get the plane that represents this clipping plane

Rhino.Render.ChangeQueue.ClippingPlane.Attributes
Get the ClippingPlaneObject for this clipping plane

Rhino.Render.ChangeQueue.ClippingPlane.Id
Get Guid for this clipping plane

Rhino.Render.ChangeQueue.ClippingPlane.ViewIds
Get list of View IDs this clipping plane is supposed to clip.