Rhino.Input.RhinoGet.StringToCommandOptionName(System.String)
Convert some arbitrary string value to a valid command option name
removing any invalid characters.
stringToConvert:
String to convert.
Returns:
Returns null if the string is null or empty or if it contains nothing
but invalid characters.  If the converted string is one or more
characters in length then the converted value is returned.

Rhino.Input.RhinoGet.StringToCommandOptionName(System.String,System.String)
Convert some arbitrary string value to a valid command option name
removing any invalid characters.
englishString:
English string to convert.
localizedString:
Optional localized string to convert.
Returns:
Returns null if the strings are null or empty or if they contain
nothing but invalid characters.  If the converted string is one or more
charcters in length then a Rhino.UI.LocalizeStringPair is returned
characters the converted string values.  If the localized string is
null or empty then the English string is used as the localized value.

Rhino.Input.RhinoGet.InGetPoint(Rhino.RhinoDoc)
Returns true if currently in a GetPoint.Get()

Rhino.Input.RhinoGet.InGetObject(Rhino.RhinoDoc)
Returns true if currently in a GetObject.GetObjects()

Rhino.Input.RhinoGet.GetRectangle(System.String,Rhino.Geometry.Point3d[]@)
Gets a 3d rectangle.
firstPrompt:
corners: corners of the rectangle in counter-clockwise order.
Returns: Commands.Result.Success if successful.

Rhino.Input.RhinoGet.GetRectangleWithCounts(System.Int32,System.Int32@,System.Int32,System.Int32@,Rhino.Geometry.Point3d[]@)
Gets a 3d rectangle with prompts for counts in X and Y directions.
xMin: Minimum value allowed for count in the x direction.
xCount: Count in the x direction.
yMin: Minimum value allowed for count in the y direction.
yCount: Count in the y direction.
corners: corners of the rectangle in counter-clockwise order.
Returns: Commands.Result.Success if successful.

Rhino.Input.RhinoGet.GetBoxWithCounts(System.Int32,System.Int32@,System.Int32,System.Int32@,System.Int32,System.Int32@,Rhino.Geometry.Point3d[]@)
Gets a 3d box with prompts for counts in X, Y and Z directions.
xMin: Minimum value allowed for count in the x direction.
xCount: Count in the x direction.
yMin: Minimum value allowed for count in the y direction.
yCount: Count in the y direction.
zMin: Minimum value allowed for count in the z direction.
zCount: Count in the z direction.
corners: corners of the bottom rectangle in counter-clockwise order, followed by top recatngle.
Returns: Commands.Result.Success if successful.

Rhino.Input.RhinoGet.GetView(System.String,Rhino.Display.RhinoView@)
Allows the user to interactively pick a viewport.
commandPrompt: The command prompt during the request.
view: The view that the user picked.
If the operation is successful, then this out parameter is assigned the correct view during this call.
Returns: The result based on user choice.

Rhino.Input.RhinoGet.GetAngle(System.String,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double@)
Allows user to interactively pick an angle
commandPrompt: if null, a default prompt will be displayed
basePoint:
referencePoint:
defaultAngleRadians:
angleRadians:
Returns:

Rhino.Input.RhinoGet.GetFileName(Rhino.Input.Custom.GetFileNameMode,System.String,System.String,System.Object)
