Rhino.Geometry.SubDFacePtr
Efficiently manages a reference to a polygonal face in a SubD, with any number of sides.
Contains connection information to vertices and edges.

Rhino.Geometry.SubDFacePtr.Previous
Links to previous face on this level.

Rhino.Geometry.SubDFacePtr.Next
Links to next face on this level.