Rhino.Render.InternalUtilities.GenerateQuickContentPreview(Rhino.Render.RenderContent,System.Int32,System.Int32,Rhino.Render.PreviewSceneServer,System.Boolean,System.Int32,System.UInt32@)
Generate a quick render content preview
c: Render Content
width: Image width
heigth: Image heigth
psc: PreviewSceneServer
bSuppressLocalMapping: SuppressLocalMapping
reason:  ContentChanged = 0, ViewChanged = 1, RefreshDisplay = 2, Other = 99
rValue: Reference to RCPResult value
Returns: The Bitmap of the quick render content preview