Rhino.Runtime.Notifications.NotificationButtonClickedArgs.#ctor(Rhino.Runtime.Notifications.Notification,Rhino.Runtime.Notifications.ButtonType)
Creates a new instance.
notification: The notification whose button was clicked.
buttonClicked: The button that was clicked.

Rhino.Runtime.Notifications.NotificationButtonClickedArgs.Notification
The notification whose button was clicked.

Rhino.Runtime.Notifications.NotificationButtonClickedArgs.ButtonClicked
The button that was clicked.