Rhino.Symbols.DegreeSymbol
Degree symbol used for angles

Rhino.Symbols.RadiusSymbol
Radius symbol

Rhino.Symbols.DiameterSymbol
Diameter symbol

Rhino.Symbols.PlusMinusSymbol
Plus-Minus tolerance symbol