Rhino.FileIO.SHA1OpenNURBS.#ctor
Constructs a new instance of the SHA1 algorithm.

Rhino.FileIO.SHA1OpenNURBS.Initialize
Resets this instance of the algorithm, so that it can be used again.
It is not required to call this method after creation.

Rhino.FileIO.SHA1OpenNURBS.StringHash(System.String)
Computes the SHA1 hash of a string, converted to UTF8.
input:
Returns: A 20-byte long SHA1 hash.
Throws System.ArgumentNullException: When input is null.