Rhino.Geometry.Collections.MeshVertexColorList.Capacity
Gets or sets the total number of vertex colors the internal data structure can hold without resizing.

Rhino.Geometry.Collections.MeshVertexColorList.Destroy
Releases all memory allocated to store vertex colors. The list capacity will be 0 after this call.
Subsequent calls can add new items.