Rhino.Geometry.Collections.BrepFaceList.SplitFacesAtTangents
Splits all of the faces of a Brep at tangent locations.
Returns: True if successful, false otherwise.

Rhino.Geometry.Collections.BrepFaceList.SplitFaceAtTangents(System.Int32)
Splits the face of a Brep at tangent locations.
faceIndex: The index of the face to split.
Returns: True if successful, false otherwise.

Rhino.Geometry.Collections.BrepFaceList.StandardizeFaceSurfaces
Standardize all faces in the brep.

Rhino.Geometry.Collections.BrepFaceList.Add(System.Int32)
Create and add a new face to this list. An incomplete face is added.
The caller must create and fill in the loops used by the face.
surfaceIndex: index of surface in brep's Surfaces list
Returns:

Rhino.Geometry.Collections.BrepFaceList.Add(Rhino.Geometry.Surface)
Add a new face to a brep.  This creates a complete face with
new vertices at the surface corners, new edges along the surface
boundary, etc.  The loop of the returned face has four trims that
correspond to the south, east, north, and west side of the
surface in that order.  If you use this version of Add to
add an exiting brep, then you are responsible for using a tool
like JoinEdges() to hook the new face to its neighbors.
surface: surface is copied
Returns:

Rhino.Geometry.Collections.BrepFaceList.AddRuledFace(Rhino.Geometry.BrepEdge,System.Boolean,Rhino.Geometry.BrepEdge,System.Boolean)
Add a new face to the brep whose surface geometry is a
ruled surface between two edges.
edgeA:
The south side of the face's surface will run along edgeA.
revEdgeA:
true if the new face's outer boundary orientation along
edgeA is opposite the orientation of edgeA.
edgeB:
The north side of the face's surface will run along edgeA
revEdgeB:
true if the new face's outer boundary orientation along
edgeB is opposite the orientation of edgeB
Returns:

Rhino.Geometry.Collections.BrepFaceList.AddConeFace(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepEdge,System.Boolean)
Add a new face to the brep whose surface geometry is a
ruled cone with the edge as the base and the vertex as
the apex point.
vertex:
The apex of the cone will be at this vertex.
The north side of the surface's parameter
space will be a singular point at the vertex.
edge:
The south side of the face's surface will run along this edge.
revEdge:
true if the new face's outer boundary orientation along
the edge is opposite the orientation of edge.
Returns:

Rhino.Geometry.Collections.BrepFaceList.RemoveSlits
Remove slit trims and slit boundaries from each face.
Returns: true if any slits were removed