Rhino.Render.RealtimeDisplayModeClassInfo.Name
Get human-facing class description for RealtimeDisplayMode
implementation. This string might show up in the Rhino
UI.

Rhino.Render.RealtimeDisplayModeClassInfo.GUID
Get the RealtimeDisplayMode implementation GUID

Rhino.Render.RealtimeDisplayModeClassInfo.DrawOpenGl
Return true if the RealtimeDisplayMode draws its result
using OpenGL. RenderWindow usage will then be skipped.

Rhino.Render.RealtimeDisplayModeClassInfo.RealtimeDisplayModeType
Get the type being registered.

Rhino.Render.RealtimeDisplayModeClassInfo.DontRegisterAttributesOnStart
Override and return true when you don't want your class info
to cause display attributes to be registered with the system.