Rhino.UI.Controls.FactoryBase.Get(System.Guid)
Override this method to return a new instance of your class for the given ID
id:
Returns:

Rhino.UI.Controls.FactoryBase.Register(Rhino.PlugIns.PlugIn)
Call this function during the startup of your plug-in to ensure that all classes that support factory creation
are registed
plugin:
Returns:

Rhino.UI.Controls.FactoryBase.Register
Call this function during startup of current assembly to load classes with factory creation support
are registed
Returns: