Rhino.UI.Dialogs.SetCustomColorDialog(System.EventHandler{Rhino.UI.GetColorEventArgs})


Rhino.UI.Dialogs.ShowTextDialog(System.String,System.String)
Display a text dialog similar to the dialog used for the "What" command.
message: Text to display as the message content.
title: Test to display as the form title.

Rhino.UI.Dialogs.ShowMessageBox(System.String,System.String)
Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
message:
title:
Returns:

Rhino.UI.Dialogs.ShowMessageBox(System.String,System.String,System.Windows.Forms.MessageBoxButtons,System.Windows.Forms.MessageBoxIcon)
Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
message:
title:
buttons:
icon:
Returns:

Rhino.UI.Dialogs.ShowMessage(System.String,System.String)
Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
message: Message box text content.
title: Message box title text.
Returns: One of the ShowMessageBoxResult values.

Rhino.UI.Dialogs.ShowMessage(System.String,System.String,Rhino.UI.ShowMessageButton,Rhino.UI.ShowMessageIcon)
Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
message: Message box text content.
title: Message box title text.
buttons: Which buttons to display in the message box.
icon: Which icon to display in the message box.
Returns: One of the ShowMessageBoxResult values.

Rhino.UI.Dialogs.ShowMessage(System.Object,System.String,System.String,Rhino.UI.ShowMessageButton,Rhino.UI.ShowMessageIcon,Rhino.UI.ShowMessageDefaultButton,Rhino.UI.ShowMessageOptions,Rhino.UI.ShowMessageMode)
Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
parent: Parent window
message: Message box text content.
title: Message box title text.
buttons: Which buttons to display in the message box.
icon: Which icon to display in the message box.
defaultButton: Which button is the default button.
mode: The modality of the message box.
options: Additional message box options.
Returns: One of the ShowMessageBoxResult values.

Rhino.UI.Dialogs.ShowColorDialog(System.Windows.Forms.IWin32Window,Rhino.Display.Color4f@,System.Boolean)
Displays the standard modal color picker dialog for floating point colors.
parent: Parent window for this dialog, should always pass this if calling from a form or user control.
color: The initial color to set the picker to and also accepts the user's choice.
allowAlpha: Specifies if the color picker should allow changes to the alpha channel or not.
Returns: true if a color was picked, false if the user canceled the picker dialog.

Rhino.UI.Dialogs.ShowColorDialog(System.Object,Rhino.Display.Color4f@,System.Boolean)
Displays the standard modal color picker dialog for floating point colors.
parent: Parent window for this dialog, should always pass this if calling from a form or user control.
color: The initial color to set the picker to and also accepts the user's choice.
allowAlpha: Specifies if the color picker should allow changes to the alpha channel or not.
Returns: true if a color was picked, false if the user canceled the picker dialog.

Rhino.UI.Dialogs.ShowColorDialog(System.Object,Rhino.Display.Color4f@,System.Boolean,Rhino.UI.Dialogs.OnColorChangedEvent)
Displays the standard modal color picker dialog for floating point colors.
parent: Parent window for this dialog, should always pass this if calling from a form or user control.
color: The initial color to set the picker to and also accepts the user's choice.
allowAlpha: Specifies if the color picker should allow changes to the alpha channel or not.
colorCallback:
May be optionally passed to ShowColorDialog and will get called when
the color value changes in the color dialog.
Returns: true if a color was picked, false if the user canceled the picker dialog.

Rhino.UI.Dialogs.ShowColorDialog(Rhino.Display.Color4f@,System.Boolean)
Displays the standard modal color picker dialog for floating point colors.
color: The initial color to set the picker to and also accepts the user's choice.
allowAlpha: Specifies if the color picker should allow changes to the alpha channel or not.
Returns: true if a color was picked, false if the user canceled the picker dialog.

Rhino.UI.Dialogs.ShowSunDialog(Rhino.Render.Sun)
Show the tabbed sun dialog.
Returns:
Returns true if the user clicked OK, or false if the user cancelled.

Rhino.UI.Dialogs.ShowSelectLayerDialog(System.Int32@,System.String,System.Boolean,System.Boolean,System.Boolean@)
Displays Rhino's single layer selection dialog.
layerIndex:
Initial layer for the dialog, and will receive selected
layer if function returns DialogResult.OK.
dialogTitle: The dialog title.
showNewLayerButton: true if the new layer button will be visible.
showSetCurrentButton: true if the set current button will be visible.
initialSetCurrentState: true if the current state will be initially set.
Returns:
True if the dialog was closed with the OK button. False if the dialog was closed with escape.

Rhino.UI.Dialogs.ShowSelectMultipleLayersDialog(System.Collections.Generic.IEnumerable{System.Int32},System.String,System.Boolean,System.Int32[]@)
Returns:
True if the dialog was closed with the OK button. False if the dialog was closed with escape.

Rhino.UI.Dialogs.ShowSelectLinetypeDialog(System.Int32@,System.Boolean)
Displays Rhino's single linetype selection dialog.
linetypeIndex:
Initial linetype for the dialog, and will receive selected
linetype if function returns true.
displayByLayer: Displays the "ByLayer" linetype in the list. Defaults to false.
Returns:
True if the dialog was closed with the OK button. False if the dialog was closed with escape.

Rhino.UI.Dialogs.ShowEditBox(System.String,System.String,System.String,System.Boolean,System.String@)
Display dialog prompting the user to enter a string.
Returns:
True if the dialog was closed with the OK button. False if the dialog was closed with escape.

Rhino.UI.Dialogs.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)
Returns:
True if the dialog was closed with the OK button. False if the dialog was closed with escape.