Rhino.Geometry.MeshingParameters.#ctor(System.Double)
Initializes a new instance with simple values,
similar to that of Rhino's meshing slider interface.
density:
The density and number of mesh polygons, where 0.0 <= density <= 1.0,
where 0 quickly creates coarse meshes, and 1 slowly creates dense meshes.

Rhino.Geometry.MeshingParameters.#ctor(System.Double,System.Double)
Initializes a new instance with simple values,
similar to that of Rhino's meshing slider interface.
density:
The density and number of mesh polygons, where 0.0 <= density <= 1.0,
where 0 quickly creates coarse meshes, and 1 slowly creates dense meshes.
minimumEdgeLength: The minimum allowed mesh edge length.

Rhino.Geometry.MeshingParameters.Default
Gets mesh creation parameters to create the default render mesh.
Only use this if you plan on specifying your own custom meshing
parameters.

Rhino.Geometry.MeshingParameters.Coarse
Gets mesh creation parameters for coarse meshing.
This corresponds with the "Jagged and Faster" default in Rhino.

Rhino.Geometry.MeshingParameters.FastRenderMesh
Gets mesh creation parameters to create the a render mesh when
meshing speed is prefered over mesh quality.

Rhino.Geometry.MeshingParameters.Smooth
Gets mesh creation parameters for smooth meshing.
This corresponds with the "Smooth and Slower" default in Rhino.

Rhino.Geometry.MeshingParameters.QualityRenderMesh
Gets mesh creation parameters to create the a render mesh when mesh
quality is prefered over meshing speed.

Rhino.Geometry.MeshingParameters.DefaultAnalysisMesh
Gets mesh creation parameters to create the default analysis mesh.

Rhino.Geometry.MeshingParameters.ClosedObjectPostProcess
Gets or sets a value indicating whether or not to post process non-closed meshes
that should be closed. If the Brep being meshed is closed, JaggedSeams = false,
and ClosedObjectPostProcess = true, and the resulting mesh is not closed, then a
post meshing process is applied to find and close gaps in the mesh. Typically the
resulting mesh is not closed because the input Brep has a geometric flaw, like
loops in trimming curve.