Rhino.Render.Fields.Field.Name
Field name value string passed to the constructor.

Rhino.Render.Fields.Field.Key
Field name value string passed to the constructor

Rhino.Render.Fields.Field.Tag
Gets or sets an object that contains data to associate with the field.
Returns:
An object that contains information that is associated with the field.