Rhino.Geometry.Collections.MeshTextureCoordinateList.Capacity
Gets or sets the total number of texture coordinates the internal data structure can hold without resizing.

Rhino.Geometry.Collections.MeshTextureCoordinateList.Destroy
Releases all memory allocated to store texture coordinates. The list capacity will be 0 after this call.
Subsequent calls can add new items.

Rhino.Geometry.Collections.MeshTextureCoordinateList.ToFloatArray
Copies all vertices to a linear array of float in u,v order
Returns: The float array.