Rhino.Geometry.BrepTrim.Brep
Gets the Brep that owns this trim.

Rhino.Geometry.BrepTrim.Loop
Loop that this trim belongs to

Rhino.Geometry.BrepTrim.Face
Brep face this trim belongs to

Rhino.Geometry.BrepTrim.Edge
Brep edge this trim belongs to. This will be null for singular trims

Rhino.Geometry.BrepTrim.TrimCurveIndex
Gets the Brep.Curves2D 2d curve index of the 2d curve geometry used by this trim, or -1.

Rhino.Geometry.BrepTrim.TrimCurve
Gets the Brep.Curves2D 2d curve geometry used by this trim, or null.

Rhino.Geometry.BrepTrim.TrimIndex
Gets the index of this trim in the Brep.Trims collection.

Rhino.Geometry.BrepTrim.TrimType
Type of trim

Rhino.Geometry.BrepTrim.IsoStatus


Rhino.Geometry.BrepTrim.IsReversed
Get orientation of trim with respect to it's corresponding edge.
Returns: true if the 2d trim and 3d edge have opposite orientations

Rhino.Geometry.BrepTrim.GetTrimParameter(System.Double,System.Double@)
Get corresponding trim parameter at given edge parameter.
edgeParameter:
trimParameter:
Returns: true on success

Rhino.Geometry.BrepTrim.GetTolerances(System.Double@,System.Double@)
The values in tolerance[] record the accuracy of the parameter space
trimming curves.
Remarks:
tolerance[0] = accuracy of parameter space curve in first ("u") parameter
tolerance[1] = accuracy of parameter space curve in second ("v") parameter
A value of RhinoMath.UnsetValue indicates that the tolerance should be computed.
If the value >= 0.0, then the tolerance is set.
If the value is RhinoMath.UnsetValue, then the tolerance needs to be computed.
If the trim is not singular, then the trim must have an edge. If P is a
3d point on the edge's curve and surface(u,v) = Q is the point on the
surface that is closest to P, then there must be a parameter t in the
interval [m_t[0], m_t[1]] such that
|u - curve2d(t)[0]| <= tolerance[0]
and
|v - curve2d(t)[1]| <= tolerance[1]
If P is the 3d point for the vertex brep.m_V[m_vi[k]] and (uk,vk) is the
corresponding end of the trim's parameter space curve, then there must be
a surface parameter (u,v) such that:
the distance from the 3d point surface(u,v) to P is <= brep.m_V[m_vi[k]].m_tolerance,
|u-uk| <= tolerance[0].
|v-vk| <= tolerance[1].
toleranceU:
toleranceV:

Rhino.Geometry.BrepTrim.SetTolerances(System.Double,System.Double)
The values in tolerance[] record the accuracy of the parameter space
trimming curves.
Remarks:
tolerance[0] = accuracy of parameter space curve in first ("u") parameter
tolerance[1] = accuracy of parameter space curve in second ("v") parameter
A value of RhinoMath.UnsetValue indicates that the tolerance should be computed.
If the value >= 0.0, then the tolerance is set.
If the value is RhinoMath.UnsetValue, then the tolerance needs to be computed.
If the trim is not singular, then the trim must have an edge. If P is a
3d point on the edge's curve and surface(u,v) = Q is the point on the
surface that is closest to P, then there must be a parameter t in the
interval [m_t[0], m_t[1]] such that
|u - curve2d(t)[0]| <= tolerance[0]
and
|v - curve2d(t)[1]| <= tolerance[1]
If P is the 3d point for the vertex brep.m_V[m_vi[k]] and (uk,vk) is the
corresponding end of the trim's parameter space curve, then there must be
a surface parameter (u,v) such that:
the distance from the 3d point surface(u,v) to P is <= brep.m_V[m_vi[k]].m_tolerance,
|u-uk| <= tolerance[0].
|v-vk| <= tolerance[1].
toleranceU:
toleranceV:

Rhino.Geometry.BrepTrim.SetTrimCurve(System.Int32)
Set 2d curve geometry used by a b-rep trim.
curve2dIndex: index of 2d curve in m_C2[] array
Returns: true if successful

Rhino.Geometry.BrepTrim.StartVertex
BrepVertex at start of trim

Rhino.Geometry.BrepTrim.EndVertex
BrepVertex at end of trim

Rhino.Geometry.BrepTrim.SetTrimCurve(System.Int32,Rhino.Geometry.Interval)
Set 2d curve geometry used by a b-rep trim.
curve2dIndex: index of 2d curve in m_C2[] array
subDomain:
Returns: true if successful