Rhino.Geometry.SubD.PatchType.Unset
Not a valid patch type.

Rhino.Geometry.SubD.PatchType.Bicubic
Entire subdivision face is an exact bicubic patch.

Rhino.Geometry.SubD.PatchType.BicubicQuadrant
A quadrant of the subdivision face is an exact bicubic patch.

Rhino.Geometry.SubD.PatchType.ApproximateBicubic
Entire subdivision face is approximately a bicubic patch.

Rhino.Geometry.SubD.PatchType.ApproximateBicubicQuadrant
A quadrant of the subdivision face is approximately a bicubic patch.

Rhino.Geometry.SubD.PatchType.None
A patch cannot be calculated at the current subdivision level.