Rhino.Runtime.PythonScript.ScriptContextCommand
Command associated with this script. Used for localiation

Rhino.Runtime.PythonScript.SetupScriptContext(System.Object)
Setups the script context. Use a RhinoDoc instance unless unsure.
doc: Document.