Rhino.Geometry.SubD.SubDType
Subdivision algorithm.

Rhino.Geometry.SubD.SubDType.Unset
Not a valid subdivision type.

Rhino.Geometry.SubD.SubDType.TriLoopWarren
Built-in Loop-Warren triangle with Bernstein-Levin-Zorin creases and darts.

Rhino.Geometry.SubD.SubDType.QuadCatmullClark
Built-in Catmull-Clark quad with Bernstein-Levin-Zorin creases and darts.

Rhino.Geometry.SubD.SubDType.CustomTri
Custom triangle face algorithm. (Not built-in. Provided for use by 3rd party developers.)

Rhino.Geometry.SubD.SubDType.CustomQuad
Custom quad facet algorithm. (Not built-in. Provided for use by 3rd party developers.)

Rhino.Geometry.SubD.SubDType.Custom
Custom algorithm. (Not built-in. Provided for use by 3rd party developers.)