Rhino.Input.Custom.GetArc.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Input.Custom.GetArc.AllowDeformable
Allow for deformable options

Rhino.Input.Custom.GetArc.Deformable
Is the deformable option set

Rhino.Input.Custom.GetArc.DefaultRadius
Default radius used for start and end radius

Rhino.Input.Custom.GetArc.Get(Rhino.Geometry.Arc@)
Perform the 'get' operation.
arc:
Returns: