Rhino.DocObjects.InstanceObject.UsesDefinition(System.Int32,System.Int32@)
Determine if this reference uses an instance definition
definitionIndex:
nestingLevel:
If the instance definition is used, this is the definition's nesting depth
Returns: true or false depending on if the deifinition is used