Rhino.Render.RealtimeDisplayMode
Base class for implementing real-time display modes in .NET

Rhino.Render.RealtimeDisplayMode.RegisterDisplayModes(Rhino.PlugIns.PlugIn)
Find and register classes that derive from RealtimeDisplayMode
from the given plug-in.
plugin:
Returns:

Rhino.Render.RealtimeDisplayMode.RegisterDisplayModes(System.Reflection.Assembly,System.Guid)
Find and register classes that derive from RealtimeDisplayMode
from the given plug-in. The plug-in is found in the given assembly
assembly:
pluginId:
Returns:

Rhino.Render.RealtimeDisplayMode.SignalRedraw
Use to signal the underlying pipeline a redraw is wanted. This can be used
for instance when a renderer has completed a pass which should be
updated in the associated viewport.

Rhino.Render.RealtimeDisplayMode.ComputeViewportCrc(Rhino.DocObjects.ViewInfo)
Compute viewport CRC for the given ViewInfo
view:
Returns: the CRC for the given view

Rhino.Render.RealtimeDisplayMode.SetView(Rhino.DocObjects.ViewInfo)
Set ViewInfo for this RealtimeDisplayMode instance.
view: The ViewInfo to set for subsequent tests.

Rhino.Render.RealtimeDisplayMode.GetView
Get ViewInfo that has been registered with this RealtimeDisplayMode instance.
Returns:

Rhino.Render.RealtimeDisplayMode.LinearWorkflow
Returns the LinearWorkflow data for this realitime display mode.

Rhino.Render.RealtimeDisplayMode.RemoveRealtimeViewport(System.IntPtr)
Remove RealtimeDisplayMode instance from internal dictionary.
realtimeViewport: IntPtr to the RealtimeDisplayMode instance to remove.

Rhino.Render.RealtimeDisplayMode.GetRealtimeViewport(System.IntPtr)
Retrieve RealtimeDisplayMode instance that the IntPtr refers to.
realtimeViewport: IntPtr of the instance searched for. If
the instance doesn't exist, a new one is created.
Returns:

Rhino.Render.RealtimeDisplayMode.GetRealtimeViewport(System.IntPtr,System.Boolean)
Retrieve RealtimeDisplayMode instance. If create is set to true
then a new instance is created if not found, null is returned for false.
realtimeViewport: IntPtr
create: true to create if not found, false to return null if not found.
Returns:

Rhino.Render.RealtimeDisplayMode.CreateWorld(Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.Display.DisplayPipelineAttributes)
Implement if you need to handle the initial CreateWorld call initiated by the display pipeline system. Note
that this is not the same as the CreateWorld call in Rhino.Render.ChangeQueue.ChangeQueue, although
related.
doc: Rhino document
viewInfo: active viewport info
displayPipelineAttributes: display pipeline attributes

Rhino.Render.RealtimeDisplayMode.GetRenderSize(System.Int32@,System.Int32@)
Get the current render resolution for the running render session.
width:
height:

Rhino.Render.RealtimeDisplayMode.StartRenderer(System.Int32,System.Int32,Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Render.RenderWindow)
Override to start your render engine
w: Width of resolution
h: Height of resolution
doc: Rhino document
view: active view
viewportInfo: active viewport info
forCapture: true if renderer is started for capture purposes (ViewCaptureTo*), false for regular interactive rendering
renderWindow: RenderWindow to hold render results in.
Returns: Return true when your render engine started correctly, false when that failed

Rhino.Render.RealtimeDisplayMode.ShutdownRenderer
Override to shutdown your render engine

Rhino.Render.RealtimeDisplayMode.LastRenderedPass
Implement to communicate last completed pass to the underlying system.
Returns: the last completed pass

Rhino.Render.RealtimeDisplayMode.ShowCaptureProgress
Override if you want to i.e. hide the progress dialog for capture progress.
Returns: Return true to show, false to hide

Rhino.Render.RealtimeDisplayMode.CaptureProgress
Override to communicate the progress of a capture.
Returns: A number between 0.0 and 1.0 inclusive. 1.0 means 100%.

Rhino.Render.RealtimeDisplayMode.OnRenderSizeChanged(System.Int32,System.Int32)
Override to restart your render engine
width:
height:
Returns:

Rhino.Render.RealtimeDisplayMode.IsRendererStarted
Override to tell the started state of your render engine.
Returns: true if render engine is ready and rendering

Rhino.Render.RealtimeDisplayMode.IsFrameBufferAvailable(Rhino.DocObjects.ViewInfo)
Implement to tell the render pipeline that a framebuffer is ready
view:
Returns: Return true when a framebuffer is ready. This is generally the
case when StartRenderer as returned successfully.

Rhino.Render.RealtimeDisplayMode.IsCompleted
Implement to tell if your render engine has completed a frame for drawing into the viewport
Returns:

Rhino.Render.RealtimeDisplayMode.UseFastDraw
Implement and return true if you want the display pipeline to not
wait for IsFramebufferAvailable during the MiddleGround draw phase.
This will also tell the pipeline to draw a complete middleground pass in OpenGL.

Rhino.Render.RealtimeDisplayMode.SetUseDrawOpenGl(System.Boolean)
During run-time change whether to use OpenGL drawing of results or not. For instance
offline rendering (viewcapture* with different resolution than viewport) could use
RenderWindow instead of direct OpenGL drawing.
use: Set to true if OpenGL drawing is wanted, set to false if RenderWindow
method is needed.

Rhino.Render.RealtimeDisplayMode.HudProductName
Override to return the name of your product. This will be printed in
the HUD.
Returns: Name of the product.

Rhino.Render.RealtimeDisplayMode.HudCustomStatusText
Override to display status of the render engine.
Returns: Status text to display

Rhino.Render.RealtimeDisplayMode.HudMaximumPasses
Override to communicate the maximum passes count currently in use for the render session.
Can be shown in the HUD
Returns: Maximum passes

Rhino.Render.RealtimeDisplayMode.HudLastRenderedPass
Override to communicate the last completed pass. Can be shown in the HUD
Returns: Last completed pass

Rhino.Render.RealtimeDisplayMode.HudRendererPaused
Implement to support pausing and resuming in the viewport
Returns: Return true if the render engine is paused.

Rhino.Render.RealtimeDisplayMode.HudRendererLocked
Implement to support locking in the viewport
Returns: Return true if the render engine is locked.

Rhino.Render.RealtimeDisplayMode.HudAllowEditMaxPasses
Override to allow maximum pass editing. By default disabled.
Returns: Return true to allow users to edit the maximum pass count.

Rhino.Render.RealtimeDisplayMode.HudShowMaxPasses
Override to show maximum passes in HUD. By default disabled.
Returns: Return true to show maximum passes.

Rhino.Render.RealtimeDisplayMode.HudShowPasses
Override to show current pass in HUD. By default disabled.
Returns: Return true to show current pass in HUD.

Rhino.Render.RealtimeDisplayMode.HudShowCustomStatusText
Override to show status text in HUD. By default disabled.
Returns: Return true to show status text in HUD

Rhino.Render.RealtimeDisplayMode.HudShowControls
Show control buttons on the realtime display HUD.
By default these are shown, override this function and
return false if HUD controls aren't needed.
Returns:

Rhino.Render.RealtimeDisplayMode.HudShow
Override if you want to hide the HUD. Shown by default
Returns: Return false to hide the HUD.

Rhino.Render.RealtimeDisplayMode.HudPlayButtonPressed
Listen to this event if you want to handle the play button control.

Rhino.Render.RealtimeDisplayMode.HudPauseButtonPressed
Listen tot his event if you want to handle the pause button control

Rhino.Render.RealtimeDisplayMode.HudLockButtonPressed
Listen tot his event if you want to handle the lock button control

Rhino.Render.RealtimeDisplayMode.HudUnlockButtonPressed
Listen tot his event if you want to handle the unlock button control

Rhino.Render.RealtimeDisplayMode.HudProductNamePressed
Listen tot his event if you want to handle a press on the product name component

Rhino.Render.RealtimeDisplayMode.HudStatusTextPressed
Listen tot his event if you want to handle a press on the status text component

Rhino.Render.RealtimeDisplayMode.HudTimePressed
Listen tot his event if you want to handle a press press on the time component

Rhino.Render.RealtimeDisplayMode.MaxPassesChanged
Listen to this if you want to handle changes in maximum pass count through
the HUD.