Rhino.Runtime.Notifications.Notification
A Notification instance can be used to inform the user about various events. For
a Notification instance to be displayed in Rhino, it must be added to the
Rhino.Runtime.Notifications.NotificationCenter. When added, it will be displayed in the
Notifications panel in Rhino. A Notification contains 1 to 3 buttons that are
automatically wired to its Rhino.Runtime.Notifications.Notification.ButtonClicked Action if it is not null.
The buttons are displayed when the Notification is shown modally by either the user
clicking on a particular notification in the Notifications panel, or by programatically
showing it using Rhino.Runtime.Notifications.Notification.ShowModal.
Currently, only process-wide notifications are
supported; document specific notifications are not possible.
Notification instances contain metadata that can be added, modified, or removed during
its life. The metadata is important for LINQ queries and other patterns.
For example, a particular action may require that multiple notifications be modified.
Thus, a LINQ query can be performed on the Rhino.Runtime.Notifications.NotificationCenter using metadata
to retrieve related Notification objects and modify them as a batch.
Notification objects implement Rhino.Runtime.Notifications.IAssemblyRestrictedObject. By default, a
Notification can only be edited by the assembly that modified it. Cross-assembly editing
is also possible if the allowed assemblies are specified explicitly.
Notification objects are not thread-safe and should only be manipulated in UI thread.

Rhino.Runtime.Notifications.Notification.DateUpdated
The date the notification was last modified.
Remarks: Only visible elements of the notification will cause this property to change.
Changes in metadata or other non-visible members will have no effect on this property.

Rhino.Runtime.Notifications.Notification.AllowedAssemblies
The assemblies that can modify this instance.
Remarks: By default, only the assembly that creates the instance will be included. You
may specify additional assemblies that should have access to an instance at creation time.

Rhino.Runtime.Notifications.Notification.MetadataCopy
A copy of all the metadata for this class.
Remarks: Modifying the returned dictionary will have no effect on the metadata for this notification.

Rhino.Runtime.Notifications.Notification.ButtonClicked
An Action that will be invoked whenever a button for the notification is clicked or the notification is closed.

Rhino.Runtime.Notifications.Notification.Item(System.String)
Gets or sets metadata for this instance.
key: The key to use to get or set metadata.
Returns: null if the key does not map to any metadata; otherwise returns the string representing the metadata.
Throws System.InvalidOperationException: Thrown if setting a value and the calling assembly cannot modify this instance.

Rhino.Runtime.Notifications.Notification.Title
The title of the notification. The title is displayed when the notification is displayed modally in Rhino.
Throws System.InvalidOperationException: Thrown if setting a value and the calling assembly cannot modify this instance.

Rhino.Runtime.Notifications.Notification.Description
The description of the notification. The description is displayed in the Notifications panel in Rhino.
Throws System.InvalidOperationException: Thrown if setting a value and the calling assembly cannot modify this instance.

Rhino.Runtime.Notifications.Notification.Message
The message of the notification. The message is shown only when the instance is displayed modally. It should contain details about the notification.
Throws System.InvalidOperationException: Thrown if setting a value and the calling assembly cannot modify this instance.

Rhino.Runtime.Notifications.Notification.SeverityLevel
The severity of the notification. Changing the severity of the notification may change the way Rhino chooses to display the Notifications panel.
Throws System.InvalidOperationException: Thrown if setting a value and the calling assembly cannot modify this instance.

Rhino.Runtime.Notifications.Notification.CancelButtonTitle
The localized title of the Cancel button.
Throws System.InvalidOperationException: Thrown if setting a value and the calling assembly cannot modify this instance.
Remarks: Notifications can 1 to 3 buttons for user input. Each button can have a localized title. With the exception of the Cancel button,
setting a button title to null (the default) will prevent that button from appearing in the interface. Note that in order for buttons
other than the Cancel button to be displayed, you must set a Rhino.Runtime.Notifications.Notification.ButtonClicked Action.

Rhino.Runtime.Notifications.Notification.ConfirmButtonTitle
The localized title of the Confirm button.
Throws System.InvalidOperationException: Thrown if setting a value and the calling assembly cannot modify this instance.
Remarks: Notifications can 1 to 3 buttons for user input. Each button can have a localized title. With the exception of the Cancel button,
setting a button title to null (the default) will prevent that button from appearing in the interface. Note that in order for buttons
other than the Cancel button to be displayed, you must set a Rhino.Runtime.Notifications.Notification.ButtonClicked Action.

Rhino.Runtime.Notifications.Notification.AlternateButtonTitle
The localized title of the Alternate button.
Throws System.InvalidOperationException: Thrown if setting a value and the calling assembly cannot modify this instance.
Remarks: Notifications can 1 to 3 buttons for user input. Each button can have a localized title. With the exception of the Cancel button,
setting a button title to null (the default) will prevent that button from appearing in the interface. Note that in order for buttons
other than the Cancel button to be displayed, you must set a Rhino.Runtime.Notifications.Notification.ButtonClicked Action.

Rhino.Runtime.Notifications.Notification.ShowEventId
An field used by Rhino for displaying notifications. Not intended for public use.

Rhino.Runtime.Notifications.Notification.#ctor(System.Collections.Generic.IEnumerable{System.Reflection.Assembly})
Creates a new instance that can be edited by the given assemblies.
allowedAssemblies: The assemblies that will be allowed to edit the instance.
If null or empty, any assembly will be able to edit this notification.

Rhino.Runtime.Notifications.Notification.#ctor
Creates a new instance that can only be edited by the assembly that creates it.

Rhino.Runtime.Notifications.Notification.ShowModal
Tells Rhino to display the notification modally.
Remarks: The notification will only be displayed if/once the instance is added to the Rhino.Runtime.Notifications.NotificationCenter.
Rhino keeps a queue of notifications that need to be shown modally, so calling this method does not mean that
this particular notification will be immediately displayed.

Rhino.Runtime.Notifications.Notification.HideModal
Tells Rhino to hide the notification if it is being currently shown as a modal.
Throws System.InvalidOperationException: Thrown if the calling assembly cannot modify this instance.
Remarks: If the notification is not being currently shown but is being queued by Rhino as
a result of calling Rhino.Runtime.Notifications.Notification.ShowModal, then the notification will be dequeued.
If the notification was never queued, then this method has no effect.

Rhino.Runtime.Notifications.Notification.RemoveMetadata(System.String)
Removes metadata from this instance.
key: The key of the metadata to remove.
Returns: true if the metada was removed; otherwise false.
Throws System.InvalidOperationException: Thrown if the calling assembly cannot modify this instance.

Rhino.Runtime.Notifications.Notification.EditableByAssembly(System.Reflection.Assembly)
Determines whether an assembly can modify the instance.
assembly: The assembly that will be considered to verify if it can edit the instance.
Returns: true if the instance can be edited by the assembly, otherwise returns false.
Remarks: Before modifying a notification you are not sure you created (such as a notification returned
from a LINQ query), you should call this method first to ensure you can indeed edit the object.

Rhino.Runtime.Notifications.Notification.PropertyChanged
Triggered whenever a visible property of the instance changes.