Rhino.DocObjects.Tables.LinetypeTable.LoadDefaultLinetypes
Fills in the linetype table with any default linetypes not already included.
Remarks:
New documents only contain the continuous linetype. Other default linetypes
are added, on demand, when the user needs them. Calling this function ensures
that the linetype table is populated with the default linetypes.
Returns: The number of default linetypes added to the linetype table.

Rhino.DocObjects.Tables.LinetypeTable.Find(System.String,System.Boolean)
Obsolete. Use the other overload.
name: search ignores case.
ignoreDeletedLinetypes: If true, deleted linetypes are not checked.
Returns:
>=0 index of the linetype with the given name
-1  no linetype has the given name.

Rhino.DocObjects.Tables.LinetypeTable.Find(System.String)
Finds the linetype with a given name.
name: search ignores case.
Returns:
>=0 index of the linetype with the given name
-1  no linetype has the given name.
Remarks: Suggested new method in place of this: FindName().

Rhino.DocObjects.Tables.LinetypeTable.FindName(System.String)
Finds the linetype with a given name.
name: The name.
Returns:
A linetype, or null if the name does not exist.

Rhino.DocObjects.Tables.LinetypeTable.FindIndex(System.Int32)
Retrieves a Linetype object based on Index. This seach type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Linetype object, or null if none was found.

Rhino.DocObjects.Tables.LinetypeTable.GetUnusedLinetypeName(System.Boolean)
Obsolete. Use the other overload. Gets unused linetype name used as default when creating new linetypes.
ignoreDeleted:
If this is true then a name used by a deleted linetype is allowed.
Returns: The unused linetype name.

Rhino.DocObjects.Tables.LinetypeTable.GetUnusedLinetypeName
Gets unused linetype name used as default when creating new linetypes.
Returns: The unused linetype name.

Rhino.DocObjects.Tables.LinetypeTable.ByParentLinetypeName
Returns the text name of the byparent linetype.