Rhino.UI.ObjectPropertiesPageEventArgs.#ctor(Rhino.UI.ObjectPropertiesPage)
Used by Rhino.UI.ObjectPropertiesPage to notify the page when
updating, modifying or determining if the page should be included
in the navigation bar
page:
Page sending the message

Rhino.UI.ObjectPropertiesPageEventArgs.Page
The page sending these arguments

Rhino.UI.ObjectPropertiesPageEventArgs.Objects
Return a list of Rhino objects to be processed by this object properties page

Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType``1
Return true if any of the selected objects match the given type
Returns:

Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType(Rhino.DocObjects.ObjectType)
objectTypes:
Returns:

Rhino.UI.ObjectPropertiesPageEventArgs.GetObjects``1
Get selected objects of a given type
Returns:

Rhino.UI.ObjectPropertiesPageEventArgs.GetObjects(Rhino.DocObjects.ObjectType)
Get selected objects that match a given filter
filter:
Returns:

Rhino.UI.ObjectPropertiesPageEventArgs.ObjectCount
Returns:

Rhino.UI.ObjectPropertiesPageEventArgs.ObjectTypes


Rhino.UI.ObjectPropertiesPageEventArgs.View
Active view

Rhino.UI.ObjectPropertiesPageEventArgs.Viewport
Active viewport

Rhino.UI.ObjectPropertiesPageEventArgs.DocRuntimeSerialNumber
Document containing the objects and views

Rhino.UI.ObjectPropertiesPageEventArgs.Document
Document containing the objects and views