Rhino.Display.ColorHSV
Represents an HSV (Hue, Saturation, Value) color with double precision floating point channels.
HSV colors (also sometimes called HSB, where B means Brightness) are similar to HSL colors in that they
represent colors in a cylindrical color space, and are intended to provide intuitive means to edit the
brightness of a particular color over RGB color space where each each color channel would need to be
modified to affect the color brightness.

Rhino.Display.ColorHSV.#ctor(System.Drawing.Color)
Constructs a new instance of ColorHSV that is equivalent to an RGB color.
rgb: RGB color to mimic.
Remarks: Exact conversions between color spaces are often not possible.

Rhino.Display.ColorHSV.#ctor(System.Double,System.Double,System.Double)
Constructs a new instance of ColorHSV with custom channel values.
hue: Hue channel value. Hue channels rotate between 0.0 and 1.0.
saturation: Saturation channel value. Channel will be limited to 0~1.
value: Value (Brightness) channel value. Channel will be limited to 0~1.

Rhino.Display.ColorHSV.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a new instance of ColorHSV with custom channel values.
alpha: Alpha channel value. Channel will be limited to 0~1.
hue: Hue channel value. Hue channels rotate between 0.0 and 1.0.
saturation: Saturation channel value. Channel will be limited to 0~1.
value: Value (Brightness) channel value. Channel will be limited to 0~1.

Rhino.Display.ColorHSV.CreateFromHSL(Rhino.Display.ColorHSL)
Constructs the nearest CMYK equivalent of an HSV color.
hsl: Target color in HSL space.
Returns: The HSV equivalent of the HSL color.

Rhino.Display.ColorHSV.CreateFromCMYK(Rhino.Display.ColorCMYK)
Create the nearest HSV equivalent of a CMYK color.
cmyk: Target color in CMYK space.
Returns: The HSV equivalent of the CMYK color.

Rhino.Display.ColorHSV.CreateFromXYZ(Rhino.Display.ColorXYZ)
Create the nearest HSV equivalent of an XYZ color.
xyz: Target color in XYZ space.
Returns: The HSV equivalent of the XYZ color.

Rhino.Display.ColorHSV.CreateFromLAB(Rhino.Display.ColorLAB)
Create the nearest HSV equivalent of a LAB color.
lab: Target color in LAB space.
Returns: The HSV equivalent of the LAB color.

Rhino.Display.ColorHSV.CreateFromLCH(Rhino.Display.ColorLCH)
Create the nearest HSV equivalent of a LCH color.
lch: Target color in LCH space.
Returns: The HSV equivalent of the LCH color.

Rhino.Display.ColorHSV.H
Gets or sets the hue channel value.
Hue channels rotate between 0.0 and 1.0.

Rhino.Display.ColorHSV.S
Gets or sets the saturation channel value.
Saturation channels are limited to a 0~1 range.

Rhino.Display.ColorHSV.V
Gets or sets the value (brightness) channel value.
Value channels are limited to a 0~1 range.

Rhino.Display.ColorHSV.A
Gets or sets the alpha channel value.
Alpha channels are limited to a 0~1 range.

Rhino.Display.ColorHSV.ToArgbColor
Convert HSV color to an equivalent System.Drawing.Color.
Returns: A .Net framework library color value.