Rhino.Geometry.Collections.BrepSurfaceList.Count
Gets the number of surfaces in a brep.

Rhino.Geometry.Collections.BrepSurfaceList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.BrepSurfaceList.GetEnumerator.
Returns: The enumerator.

Rhino.Geometry.Collections.BrepSurfaceList.GetEnumerator
Gets an enumerator that visits all surfaces.
Returns: The enumerator.