Rhino.DocObjects.Layer.CommitChanges


Rhino.DocObjects.Layer.Name
Gets or sets the name of this layer.

Rhino.DocObjects.Layer.Color
Gets or sets the display color for this layer.

Rhino.DocObjects.Layer.PlotColor
Gets or sets the plot color for this layer.

Rhino.DocObjects.Layer.PlotWeight
Gets or sets the thickness of the plotting pen in millimeters.
A thickness of 0.0 indicates the "default" pen weight should be used.

Rhino.DocObjects.Layer.LinetypeIndex
Gets or sets the line-type index for this layer.

Rhino.DocObjects.Layer.RenderMaterialIndex
Gets or sets the index of render material for objects on this layer that have
MaterialSource() == MaterialFromLayer.
A material index of -1 indicates no material has been assigned
and the material created by the default Material constructor
should be used.

Rhino.DocObjects.Layer.IsVisible
Gets or sets the visibility of this layer.

Rhino.DocObjects.Layer.IsLocked
Gets or sets a value indicating the locked state of this layer.

Rhino.DocObjects.Layer.ComponentType
Returns Rhino.DocObjects.ModelComponentType.Layer.

Rhino.DocObjects.Layer.ComponentStatus
Gets or sets the status of the layer.

Rhino.DocObjects.Layer.GetPersistentVisibility
The persistent visbility setting is used for layers whose visibilty can
be changed by a "parent" object. A common case is when a layer is a
child layer (ParentId is not nil). In this case, when a parent layer is
turned off, then child layers are also turned off. The persistent
visibility setting determines what happens when the parent is turned on
again.
Remarks:
Returns true if this layer's visibility is controlled by a parent
object and the parent is turned on (after being off), then this
layer will also be turned on.
Returns false if this layer's visibility is controlled by a parent
object and the parent layer is turned on (after being off), then
this layer will continue to be off.
When the persistent visbility is not explicitly set, this
property returns the current value of IsVisible

Rhino.DocObjects.Layer.SetPersistentVisibility(System.Boolean)
Set the persistent visibility setting for this layer
persistentVisibility:

Rhino.DocObjects.Layer.UnsetPersistentVisibility
Remove any explicit persistent visibility setting from this layer

Rhino.DocObjects.Layer.GetPersistentLocking
The persistent locking setting is used for layers that can be locked by
a "parent" object. A common case is when a layer is a child layer
(Layer.ParentI is not nil). In this case, when a parent layer is locked,
then child layers are also locked. The persistent locking setting
determines what happens when the parent is unlocked again.
Returns:

Rhino.DocObjects.Layer.SetPersistentLocking(System.Boolean)
Set the persistent locking setting for this layer
persistentLocking:

Rhino.DocObjects.Layer.UnsetPersistentLocking
Remove any explicity persistent locking settings from this layer

Rhino.DocObjects.Layer.IsExpanded
Gets or sets a value indicating whether this layer is expanded in the Rhino Layer dialog.

Rhino.DocObjects.Layer.RenderMaterial
Gets or sets the Rhino.Render.RenderMaterial for objects on
this layer that have MaterialSource() == MaterialFromLayer.
A null result indicates that no Rhino.Render.RenderMaterial has
been assigned  and the material created by the default Material
constructor or the Rhino.DocObjects.Layer.RenderMaterialIndex should be used.

Rhino.DocObjects.Layer.Default
Sets layer to default settings.

Rhino.DocObjects.Layer.CopyAttributesFrom(Rhino.DocObjects.Layer)
Copy typical attributes from another layer
otherLayer:

Rhino.DocObjects.Layer.PathSeparator
The string "::" (colon,colon) is used to
separate parent and child layer names.

Rhino.DocObjects.Layer.GetLeafName(System.String)
Get a layer name's "leaf" level name
fullPath:
Returns:
leaf name or String.Empty if fullPath does not contain a leaf

Rhino.DocObjects.Layer.GetLeafName(Rhino.DocObjects.Layer)
Get a layer name's "leaf" level name
layer:
Returns:
leaf name or String.Empty if fullPath does not contain a leaf

Rhino.DocObjects.Layer.GetParentName(System.String)
Get a layer's "parent" path name
fullPath:
Returns:
parent name or String.Empty

Rhino.DocObjects.Layer.GetParentName(Rhino.DocObjects.Layer)
Get a layer's "parent" path name
layer:
Returns:
parent name or String.Empty