Rhino.Runtime.InteropWrappers.SimpleArrayPoint2d.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayPoint2d.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayPoint2d.#ctor
Initializes a new empty Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d instance.

Rhino.Runtime.InteropWrappers.SimpleArrayPoint2d.Count
Gets the amount of points in this array.

Rhino.Runtime.InteropWrappers.SimpleArrayPoint2d.ToArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayPoint2d.Dispose
Actively reclaims unmanaged resources that this instance uses.