Rhino.Runtime.HostUtils.GetPlatformService``1(System.String,System.String)
For internal use only. Loads an assembly for dependency injection via IPlatformServiceLocator.
assemblyPath: The relative path of the assembly, relative to the position of RhinoCommon.dll
typeFullName: The full name of the type that is IPlatformServiceLocator. This is optional.
The type of the service to be instantiated.
Returns: An instance, or null.

Rhino.Runtime.HostUtils.IsManagedDll(System.String)
Inspects a dll to see if it is compiled as native code or as a .NET assembly
path:
Returns:

Rhino.Runtime.HostUtils.DeviceName
Name of the computer running Rhino. If the computer is part of a
Windows Domain, the computer name has "@[DOMAIN]" appended.

Rhino.Runtime.HostUtils.ComputerSerialNumber
Gets the serial number of the computer running Rhino.

Rhino.Runtime.HostUtils.DeviceId
The DeviceId is a unique, stable ID that anonymously identifies the device
that Rhino is running on. It is computed based on hardware information that
should not change when the OS is upgraded, or if commonly modified hardware
are added or removed from the computer. The machine-specific information is
hashed using a cryptographic hash to make it anonymous.

Rhino.Runtime.HostUtils.GetAbsolutePath(System.String,System.Boolean,System.String,System.Boolean,System.String@)
Call this method to convert a relative path to an absolute path
relative to the specified path.
relativePath:
Relative path to convert to an absolute path
bRelativePathisFileName:
If true then lpsFrom is treated as a file name otherwise it is treated
as a directory name
relativeTo:
File or folder the path is relative to
bRelativeToIsFileName:
If true then lpsFrom is treated as a file name otherwise it is treated
as a directory name
pathOut:
Reference to string which will receive the computed absolute path
Returns:
Returns true if parameters are valid and lpsRelativePath is indeed
relative to lpsRelativeTo otherwise returns false

Rhino.Runtime.HostUtils.RecordInitInstanceTime(System.String)
Used to help record times at startup with the -stopwatch flag to help
determine bottlenecks in start up speed
description:

Rhino.Runtime.HostUtils.AutoInstallPlugInFolder(System.Boolean)
Gets the auto install plug-in folder for machine or current user.
currentUser: true if the query relates to the current user.
Returns: The full path to the revelant auto install plug-in directory.

Rhino.Runtime.HostUtils.GetActivePlugInVersionFolders(System.Boolean)
Recurses through the auto install plug-in folders and returns the directories containing "active" versions of plug-ins.
currentUser: Current user (true) or machine (false).
Returns:

Rhino.Runtime.HostUtils.InitializeRhinoCommon_RDK
Makes sure all static RhinoCommon RDK components are set up correctly.
This happens automatically when the RDK is loaded, so you probably won't
have to call this method.
Remarks: Subsequent calls to this method will be ignored.

Rhino.Runtime.HostUtils.ShutDownRhinoCommon_RDK
Makes sure all static RhinoCommon RDK components are de-initialized so they aren't calling into space when the RDK is unloaded.
Remarks: Subsequent calls to this method will be ignored.

Rhino.Runtime.HostUtils.RhinoCommonExceptionHandler(System.String,System.Object,System.Exception)
For internal use only!!!
Unhanded exception handler, writes stack trace to RhinoDotNet.txt file
title:
Exception title to write to text file
sender:
ex:

Rhino.Runtime.HostUtils.UnhandledThreadException(System.Object,System.Threading.ThreadExceptionEventArgs)
Exception handler for exceptions occurring on the UI thread
sender:
e:

Rhino.Runtime.HostUtils.InitializeZooClient
Initializes the ZooClient and Rhino license manager, this should get
called automatically when RhinoCommon is loaded so you probably won't
have to call this method.

Rhino.Runtime.HostUtils.CallFromCoreRhino(System.String)
Don't change this function in ANY way unless you chat with Steve first!
This function is called by Rhino on initial startup and the signature
must be exact
task:
Returns: