Rhino.Geometry.NurbsSurface.CreateFromPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,System.Int32,System.Int32,System.Int32)
Constructs a NURBS surface from a 2D grid of control points.
points: Control point locations.
uCount: Number of points in U direction.
vCount: Number of points in V direction.
uDegree: Degree of surface in U direction.
vDegree: Degree of surface in V direction.
Returns: A NurbsSurface on success or null on failure.
Remarks: uCount multiplied by vCount must equal the number of points supplied.

Rhino.Geometry.NurbsSurface.CreateThroughPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Constructs a NURBS surface from a 2D grid of points.
points: Control point locations.
uCount: Number of points in U direction.
vCount: Number of points in V direction.
uDegree: Degree of surface in U direction.
vDegree: Degree of surface in V direction.
uClosed: true if the surface should be closed in the U direction.
vClosed: true if the surface should be closed in the V direction.
Returns: A NurbsSurface on success or null on failure.
Remarks: uCount multiplied by vCount must equal the number of points supplied.

Rhino.Geometry.NurbsSurface.CreateNetworkSurface(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Int32,System.Double,System.Double,System.Double,System.Int32@)
Builds a surface from an ordered network of curves/edges.
uCurves: An array, a list or any enumerable set of U curves.
uContinuityStart:
continuity at first U segment, 0 = loose, 1 = pos, 2 = tan, 3 = curvature.
uContinuityEnd:
continuity at last U segment, 0 = loose, 1 = pos, 2 = tan, 3 = curvature.
vCurves: An array, a list or any enumerable set of V curves.
vContinuityStart:
continuity at first V segment, 0 = loose, 1 = pos, 2 = tan, 3 = curvature.
vContinuityEnd:
continuity at last V segment, 0 = loose, 1 = pos, 2 = tan, 3 = curvature.
edgeTolerance: tolerance to use along network surface edge.
interiorTolerance: tolerance to use for the interior curves.
angleTolerance: angle tolerance to use.
error:
If the NurbsSurface could not be created, the error value describes where
the failure occured.  0 = success,  1 = curve sorter failed, 2 = network initializing failed,
3 = failed to build surface, 4 = network surface is not valid.
Returns: A NurbsSurface or null on failure.

Rhino.Geometry.NurbsSurface.CreateNetworkSurface(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Double,System.Double,System.Double,System.Int32@)
Builds a surface from an autosorted network of curves/edges.
curves: An array, a list or any enumerable set of curves/edges, sorted automatically into U and V curves.
continuity: continuity along edges, 0 = loose, 1 = pos, 2 = tan, 3 = curvature.
edgeTolerance: tolerance to use along network surface edge.
interiorTolerance: tolerance to use for the interior curves.
angleTolerance: angle tolerance to use.
error:
If the NurbsSurface could not be created, the error value describes where
the failure occured.  0 = success,  1 = curve sorter failed, 2 = network initializing failed,
3 = failed to build surface, 4 = network surface is not valid.
Returns: A NurbsSurface or null on failure.

Rhino.Geometry.NurbsSurface.IncreaseDegreeU(System.Int32)
Increase the degree of this surface in U direction.
desiredDegree: The desired degree.
Degrees should be number between and including 1 and 11.
Returns: true on success, false on failure.

Rhino.Geometry.NurbsSurface.IncreaseDegreeV(System.Int32)
Increase the degree of this surface in V direction.
desiredDegree: The desired degree.
Degrees should be number between and including 1 and 11.
Returns: true on success, false on failure.

Rhino.Geometry.NurbsSurface.EpsilonEquals(Rhino.Geometry.NurbsSurface,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns: