Rhino.Geometry.Centermark
Represents a centermark

Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)
Create a new centermark
dimStyle:
plane:
centerpoint:
radius:
Returns: