Rhino.RhinoDoc.Open(System.String,System.Boolean@)
Opens a 3dm file and makes it the active document. If called on
windows the active document will be saved and closed and the new
document will be opened and become the active document.  If called
on the Mac the file will be opened in a new document window.
filePath: Full path to the 3dm file to open
wasAlreadyOpen:
Will get set to true if there is a currently open document with the
specified path; otherwise it will get set to false.
Returns:
Returns the newly opened document on success or null on error.

Rhino.RhinoDoc.FromFilePath(System.String)
Search the open document list for a document with a Path equal
to the specified file path.
Returns: The file name to search for
filePath: The full path to the file to search for.

Rhino.RhinoDoc.OpenDocuments
Returns a list of currently open Rhino documents
Returns:

Rhino.RhinoDoc.Name
Returns the name of the currently loaded Rhino document (3DM file).

Rhino.RhinoDoc.Path
Returns the path of the currently loaded Rhino document (3DM file).

Rhino.RhinoDoc.GetGumballPlane(Rhino.Geometry.Plane@)
Returns the active plane of Rhino's auto-gumball widget.
Note, when calling from a Rhino command, make sure the command
class has the Rhino.Commands.Style.Transparent command style attribute.
plane: The active plane.
Returns: true if the auto-gumball widget is enabled and visible. False otherwise.

Rhino.RhinoDoc.ModelDistanceDisplayPrecision


Rhino.RhinoDoc.ReadFileVersion
Returns the file version of the current document.
Use this function to determine which version of Rhino last saved the document.
Returns:
The file version (e.g. 1, 2, 3, 4, etc.) or -1 if the document has not been read from disk.

Rhino.RhinoDoc.IsReadOnly
Current read-only mode for this document.
true if the document can be viewed but NOT saved.
false if document can be viewed and saved.

Rhino.RhinoDoc.RuntimeSerialNumber
Unique serialNumber for the document while the application is running.
This is not a persistent value.

Rhino.RhinoDoc.MeshingParameterStyle
Type of MeshingParameters currently used by the document to mesh objects

Rhino.RhinoDoc.GetMeshingParameters(Rhino.Geometry.MeshingParameterStyle)
Get MeshingParameters currently used by the document
style:
Returns:

Rhino.RhinoDoc.GetAnalysisMeshingParameters
Get analysis meshing parameters currently used by the document
Returns:

Rhino.RhinoDoc.SetCustomMeshingParameters(Rhino.Geometry.MeshingParameters)
Set the custom meshing parameters that this document will use. You must also modify the
MeshingParameterStyle property on the document to Custom if you want these meshing
parameters to be used
mp:

Rhino.RhinoDoc.GetCurrentMeshingParameters
Get the custom meshing parameters that this document will use.

Rhino.RhinoDoc.Worksession
Provides access to the document's worksession.

Rhino.RhinoDoc.DimStyles


Rhino.RhinoDoc.InstanceDefinitions


Rhino.RhinoDoc.Strings
Collection of document user data strings in this document

Rhino.RhinoDoc.CurrentEnvironment
Access to the current environment for various uses

Rhino.RhinoDoc.GetRenderPrimitives(System.Boolean,System.Boolean)
Get a enumerable list of custom mesh primitives
forceTriangleMeshes:
If true all mesh faces will be triangulated
quietly:
Iterate quietly, if true then no user interface will be displayed
Returns:

Rhino.RhinoDoc.GetRenderPrimitives(Rhino.DocObjects.ViewportInfo,System.Boolean,System.Boolean)
Get a enumerable list of custom mesh primitives
viewport:
The rendering view camera.
forceTriangleMeshes:
If true all mesh faces will be triangulated
quietly:
Iterate quietly, if true then no user interface will be displayed
Returns:

Rhino.RhinoDoc.GetRenderPrimitives(System.Guid,Rhino.DocObjects.ViewportInfo,System.Boolean,System.Boolean)
Get a enumerable list of custom mesh primitives
plugInId:
The Id of the plug-in creating the iterator.
viewport:
The rendering view camera.
forceTriangleMeshes:
If true all mesh faces will be triangulated
quietly:
Iterate quietly, if true then no user interface will be displayed
Returns:

Rhino.RhinoDoc.GroundPlane
Gets the ground plane of this document.
Throws Rhino.Runtime.RdkNotLoadedException: If the RDK is not loaded.

Rhino.RhinoDoc.NextUndoRecordSerialNumber
The serial number that will be assigned to the next undo record that is
constructed.

Rhino.RhinoDoc.CurrentUndoRecordSerialNumber
>0: undo recording is active and being saved on the undo record with
the specified serial number.
0: undo recording is not active. (Disabled or nothing is being
recorded.)

Rhino.RhinoDoc.ActiveDocumentChanged
This event is raised when the active document used by modeless user
interface changes.  On Mac Rhino this will get raised before the
Rhino.RhinoDoc.NewDocument, Rhino.RhinoDoc.BeginOpenDocument and
Rhino.RhinoDoc.EndOpenDocument events.  Mac Rhino will also raise this
event with 0 for the document Id and a null document pointer when the
last document is closed.  Windows Rhino will raise this event after the
Rhino.RhinoDoc.NewDocument, Rhino.RhinoDoc.BeginOpenDocument and
Rhino.RhinoDoc.EndOpenDocument events when a new or existing model is
opened.

Rhino.RhinoDoc.EndOpenDocumentInitialiViewUpdate
This event is raised after Rhino.RhinoDoc.EndOpenDocument when the
documents initial views have been created and initialized.

Rhino.RhinoDoc.ReplaceRhinoObject
Called if an object is about to be replaced.
If both RhinoDoc.UndoActive() and RhinoDoc.RedoActive() return false,
then immediately after the ReplaceObject event, there will be a DeleteObject
event followed by an AddObject event.
If either RhinoDoc.UndoActive() or RhinoDoc::RedoActive() return true,
then immediately after the ReplaceObject event, there will be a DeleteObject
event followed by an UndeleteObject event.

Rhino.RhinoDoc.ModifyObjectAttributes
Called when all object attributes are changed.

Rhino.RhinoDoc.BeforeTransformObjects
Called before objects are being transformed

Rhino.RhinoDoc.DimensionStyleTableEvent
Called when any modification happens to a document's dimension style table.

Rhino.RhinoDoc.InstanceDefinitionTableEvent
Called when any modification happens to a document's light table.

Rhino.RhinoDoc.LightTableEvent
Called when any modification happens to a document's light table.

Rhino.RhinoDoc.RenderMaterialsTableEvent
Called when the Rhino.Render.RenderMaterialTable has been loaded, is
about to be cleared or has been cleared.  See Rhino.RhinoDoc.RenderContentTableEventType for more
information.

Rhino.RhinoDoc.RenderEnvironmentTableEvent
Called when the Rhino.Render.RenderEnvironmentTable has been loaded, is
about to be cleared or has been cleared.  See Rhino.RhinoDoc.RenderContentTableEventType for more
information.

Rhino.RhinoDoc.RenderTextureTableEvent
Called when the Rhino.Render.RenderTextureTable has been loaded, is
about to be cleared or has been cleared.  See Rhino.RhinoDoc.RenderContentTableEventType for more
information.

Rhino.RhinoDoc.TextureMappingEvent
Called when any modification happens to a document objects texture mapping.