Rhino.DocObjects.Material.RenderMaterial
Get the RenderMaterial related to this Material.
Will create a new RenderMaterial if none exists. This can happen for older
documents.

Rhino.DocObjects.Material.MaterialIndex


Rhino.DocObjects.Material.IsDocumentControlled
If true this object may not be modified. Any properties or functions that attempt
to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.

Rhino.DocObjects.Material.ComponentType
Returns Rhino.DocObjects.ModelComponentType.RenderMaterial.

Rhino.DocObjects.Material.IndexOfRefraction
Gets or sets the index of refraction of the material, generally
>= 1.0 (speed of light in vacuum)/(speed of light in material)

Rhino.DocObjects.Material.FresnelIndexOfRefraction
Gets or sets the Fresnel index of refraction of the material,
default is 1.56

Rhino.DocObjects.Material.RefractionGlossiness
Gets or sets the refraction glossiness.

Rhino.DocObjects.Material.ReflectionGlossiness
Gets or sets the reflection glossiness.

Rhino.DocObjects.Material.FresnelReflections
Gets or sets if fresnel reflections are used.

Rhino.DocObjects.Material.Reflectivity
Gets or sets how reflective a material is, 0f is no reflection
1f is 100% reflective.

Rhino.DocObjects.Material.GetTextures
Get array of textures that this material uses
Returns: