Rhino.Input.Custom.GetPolyline.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Input.Custom.GetPolyline.Get(Rhino.Geometry.Polyline@)
Perform the 'get' operation.
polyline:
Returns:

Rhino.Input.Custom.GetPolyline.FirstPointPrompt
Prompt when getting first point

Rhino.Input.Custom.GetPolyline.SecondPointPrompt
Prompt when getting second point

Rhino.Input.Custom.GetPolyline.ThirdPointPrompt
Prompt when getting third point

Rhino.Input.Custom.GetPolyline.FourthPointPrompt
Prompt when getting fourth point

Rhino.Input.Custom.GetPolyline.SetFirstPoint(Rhino.Geometry.Point3d)
Use SetFirstPoint to specify the line's starting point and skip
the start point interactive picking
point: