Rhino.LengthValue.Dispose
actively reclaim native allocated ON_LenghtValue*

Rhino.LengthValue.Create(System.String,Rhino.Input.StringParserSettings,System.Boolean@)
Create from string
s: string to parse
ps:
parsedAll: true if the whole string was parsed

Rhino.LengthValue.Create(System.Double,Rhino.UnitSystem,Rhino.LengthValue.StringFormat)
Create from Length and UnitSystem
length: Numeric length value
us: Unit system
format:

Rhino.LengthValue.Create(System.Double,Rhino.UnitSystem,Rhino.LengthValue.StringFormat,System.UInt32)
Create from Length and UnitSystem
length: Numeric length value
us: Unit system
format:
localeId:

Rhino.LengthValue.Length
Length value in this instance's current unit system
Returns:

Rhino.LengthValue.Length(Rhino.UnitSystem)
Length value in a given unit system
units:
Returns:

Rhino.LengthValue.LengthString
Return length as a string
Returns:

Rhino.LengthValue.ChangeLength(System.Double)
Changes the numeric value in a LengthValue and leaves all of the other info unchanged
UnitSystem, ParseSettings and StringFormat stay as they were
newLength:
Returns: A new LengthValue

Rhino.LengthValue.ChangeUnitSystem(Rhino.UnitSystem)
Change the UnitSystem of a LengthValue
The numeric value of Length is scaled by new_us / current unit system
so that the absolute length stays the same
newUnits:
Returns:

Rhino.LengthValue.ParseSettings
Parse settings

Rhino.LengthValue.UnitSystem
UnitSystem used by this LengthValue

Rhino.LengthValue.LengthStringFormat
Returns the StringFormat from this LengthValue

Rhino.LengthValue.ContextLocaleId
returns the context LocaleId from this LengthValue

Rhino.LengthValue.ContextAngleUnitSystem
Returns the context AngleUnitSystem from this LengthValue's ParseSettings

Rhino.LengthValue.IsUnset
Test IsUnset
Returns: