Rhino.DocObjects.ViewportInfo.IsPerspectiveProjection
Get or set whether this projection is perspective.

Rhino.DocObjects.ViewportInfo.IsParallelProjection
Get or set whether this projection is parallel.

Rhino.DocObjects.ViewportInfo.DefaultCameraDirection
Default z=up perspective camera direction

Rhino.DocObjects.ViewportInfo.GetScreenPortLocation(System.Int32@,System.Int32@,System.Int32@,System.Int32@)
Get the location of viewport in pixels (non System.Drawing version of GetScreenPort)
left:
top:
right:
bottom:

Rhino.DocObjects.ViewportInfo.ScreenPort
Get or set the screen port. Rhino.DocObjects.ViewportInfo.SetScreenPort(System.Drawing.Rectangle) and Rhino.DocObjects.ViewportInfo.GetScreenPort

Rhino.DocObjects.ViewportInfo.Camera35mmLensLength
This property assumes the camera is horizontal and crop the
film rather than the image when the aspect of the frustum
is not 36/24.  (35mm film is 36mm wide and 24mm high.)
Setting preserves camera location,
changes the frustum, but maintains the frustum's aspect.

Rhino.DocObjects.ViewportInfo.GetFrustumLine(System.Drawing.Point)
Gets the world coordinate line in the view frustum
that projects to a point on the screen.
screenPoint: screen location
Returns: 3d world coordinate line segment starting on the near clipping plane and ending on the far clipping plane.

Rhino.DocObjects.ViewportInfo.GetFrustumLine(System.Drawing.PointF)
Gets the world coordinate line in the view frustum
that projects to a point on the screen.
screenPoint: screen location
Returns: 3d world coordinate line segment starting on the near clipping plane and ending on the far clipping plane.

Rhino.DocObjects.ViewportInfo.DollyExtents(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Double)
Dolly the camera location and so that the view frustum contains
all of the document objects that can be seen in view.
If the projection is perspective, the camera angle is not changed.
geometry:
border:
If border > 1.0, then the fustum in enlarged by this factor
to provide a border around the view.  1.1 works well for
parallel projections; 0.0 is suggested for perspective projections.
Returns: True if successful.

Rhino.DocObjects.ViewportInfo.DollyExtents(Rhino.Geometry.BoundingBox,System.Double)
Dolly the camera location and so that the view frustum contains
all of the document objects that can be seen in view.
If the projection is perspective, the camera angle is not changed.
cameraCoordinateBoundingBox:
border:
If border > 1.0, then the fustum in enlarged by this factor
to provide a border around the view.  1.1 works well for
parallel projections; 0.0 is suggested for perspective projections.
Returns: True if successful.