Rhino.Geometry.Cylinder.Height1
Gets or sets the start height of the cylinder.
The center of bottom cap is: BasePlane.Origin + Height1 * BasePlane.ZAxis.

Rhino.Geometry.Cylinder.Height2
Gets or sets the end height of the cylinder.
If the end height equals the start height, the cylinder is
presumed to be infinite.
The center of top cap is: BasePlane.Origin + Height2 * BasePlane.ZAxis.

Rhino.Geometry.Cylinder.Radius
Gets or sets the radius of the cylinder.

Rhino.Geometry.Cylinder.BasePlane
Gets or sets the base plane of the cylinder.

Rhino.Geometry.Cylinder.EpsilonEquals(Rhino.Geometry.Cylinder,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns: