Rhino.Geometry.Collections.BrepCurveList.Count
Gets the number of curves in this list.

Rhino.Geometry.Collections.BrepCurveList.Add(Rhino.Geometry.Curve)
Adds a curve
curve: A copy of the curve is added to this brep
Returns:
Index that should be used to reference the geometry.
-1 is returned if the input is not acceptable.

Rhino.Geometry.Collections.BrepCurveList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.BrepCurveList.GetEnumerator.
Returns: The enumerator.

Rhino.Geometry.Collections.BrepCurveList.GetEnumerator
Get an enumerator that visits all curves.
Returns: The enumerator.