Rhino.Input.Custom.GetCylinder.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Input.Custom.GetCylinder.CylinderConstraint
State of the cone/cyl constraint option. When the cone/cyl option is
selected, the circle is being made as a base for a cone/cyl.
By default the vertical cone/cyl option not available but is not
selected.  By default the "Vertical" option applies to VerticalCircle.

Rhino.Input.Custom.GetCylinder.DefaultSize
Default radius or diameter (based on InDiameterMode)

Rhino.Input.Custom.GetCylinder.InDiameterMode
Determines if the "size" value is reperesenting a radius or diameter

Rhino.Input.Custom.GetCylinder.BothSidesOption
Determine if the "both sides" option is enabled

Rhino.Input.Custom.GetCylinder.Height
Height of cylinder

Rhino.Input.Custom.GetCylinder.Get(Rhino.Geometry.Cylinder@)
Perform the 'get' operation.
cylinder:
Returns: