Rhino.Render.RenderContent.Create(System.Guid,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and add it to the persistent content list.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RhRdkContentFactories().NewContentFromType().
type: Is the type of the content to add.
flags: Options for the tab.
doc: The current Rhino document.
Returns: A new persistent render content.

Rhino.Render.RenderContent.Create(System.Type,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and add it to the persistent content list.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RhRdkContentFactories().NewContentFromType().
type: Is the type of the content to add.
flags: Options for the tab.
doc: The current Rhino document.
Returns: A new persistent render content.

Rhino.Render.RenderContent.Create(System.Guid,Rhino.Render.RenderContent,System.String,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and add it to the persistent content list.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RhRdkContentFactories().NewContentFromType().
type: is the type of the content to add.
parent: Parent is the parent content. If not NULL, this must be an RDK-owned content that is
in the persistent content list (either top-level or child). The new content then becomes its child.
If NULL, the new content is added to the top-level content list instead.
childSlotName: ChildSlotName is the unique child identifier to use for the new content when creating it as a child of pParent (i.e., when pParent is not NULL)
flags: Options for the tab.
doc: The current Rhino document.
Returns: A new persistent render content.

Rhino.Render.RenderContent.Create(System.Type,Rhino.Render.RenderContent,System.String,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and add it to the persistent content list.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RhRdkContentFactories().NewContentFromType().
type: is the type of the content to add.
parent: Parent is the parent content. If not NULL, this must be an RDK-owned content that is
in the persistent content list (either top-level or child). The new content then becomes its child.
If NULL, the new content is added to the top-level content list instead.
childSlotName: ChildSlotName is the unique child identifier to use for the new content when creating it as a child of pParent (i.e., when pParent is not NULL)
flags: Options for the tab.
doc: The current Rhino document.
Returns: A new persistent render content.

Rhino.Render.RenderContent.RegisterContent(Rhino.PlugIns.PlugIn)
Call RegisterContent in your plug-in's OnLoad function in order to register all of the
custom RenderContent classes in your assembly.
plugin:
Returns: array of render content types registered on success. null on error.

Rhino.Render.RenderContent.RegisterContent(System.Reflection.Assembly,System.Guid)
Call RegisterContent in your plug-in's OnLoad function in order to register all of the
custom RenderContent classes in your assembly.
assembly:
Assembly where custom content is defined, this may be a plug-in assembly
or another assembly referenced by the plug-in.
pluginId: Parent plug-in for this assembly.
Returns: array of render content types registered on success. null on error.

Rhino.Render.RenderContent.LoadFromFile(System.String)
Loads content from a library file.  Does not add the content to the persistent content list.
Use AddPersistantContent to add it to the list.
filename: full path to the file to be loaded.
Returns: The loaded content or null if an error occurred.

Rhino.Render.RenderContent.AddPersistentRenderContent(Rhino.Render.RenderContent)
Add a material, environment or texture to the internal RDK document lists as
top level content.  The content must have been returned from
RenderContent::MakeCopy, NewContentFromType or a similar function that returns
a non-document content.
renderContent: The render content.
Returns: true on success.

Rhino.Render.RenderContent.AddPersistentRenderContent(Rhino.RhinoDoc,Rhino.Render.RenderContent)
Add a material, environment or texture to the internal RDK document lists as
top level content.  The content must have been returned from
RenderContent::MakeCopy, NewContentFromType or a similar function that returns
a non-document content.
document: The document to attach the render content to.
renderContent: The render content.
Returns: true on success.

Rhino.Render.RenderContent.FromId(Rhino.RhinoDoc,System.Guid)
Search for a content object based on its Id
document:
The Rhino document containing the content.
id:
Id of the content instance to search for.
Returns:
Returns the content object with the specified Id if it is found
otherwise it returns null.

Rhino.Render.RenderContent.MakeCopy
Create a copy of the render content. All content is the same, except for the
instance Id.
Returns: The new RenderContent

Rhino.Render.RenderContent.FromPointer(System.IntPtr)
Create a .NET object of the appropriate type and attach it to the
requested C++ pointer
renderContent:
Returns:

Rhino.Render.RenderContent.Fields
Rhino.Render.Fields FieldDictionary which provides access to setting
and retrieving field values.

Rhino.Render.RenderContent.BindParameterToField(System.String,System.String,Rhino.Render.Fields.Field,Rhino.Render.RenderContent.ChangeContexts)
Use bindings to automatically wire parameters to fields
parameterName:
childSlotName:
field:
setEvent:

Rhino.Render.RenderContent.BindParameterToField(System.String,Rhino.Render.Fields.Field,Rhino.Render.RenderContent.ChangeContexts)
Use bindings to automatically wire parameters to fields
parameterName:
field:
setEvent:

Rhino.Render.RenderContent.TypeName
Name for your content type.  ie. "My .net Texture"

Rhino.Render.RenderContent.TypeDescription
Description for your content type.  ie.  "Procedural checker pattern"

Rhino.Render.RenderContent.Name
Instance name for this content.

Rhino.Render.RenderContent.Notes
Notes for this content.

Rhino.Render.RenderContent.Id
Instance identifier for this content.

Rhino.Render.RenderContent.TypeId
Type identifier for this content

Rhino.Render.RenderContent.SetRenderHash(System.UInt32)
This method is deprecated and no longer called. For more information
see Rhino.Render.RenderContent.CalculateRenderHash(System.UInt64)
hash:

Rhino.Render.RenderContent.IsRenderHashCached
This method is deprecated and no longer called. For more information
see Rhino.Render.RenderContent.CalculateRenderHash(System.UInt64)
Returns: bool

Rhino.Render.RenderContent.RenderHash
Render hash for the content hierarchy. It iterates children and includes
a caching mechanism which means the hash value can be retrieved quickly
if it hasn't changed. The cache is invalidated when Changed() is called.
You can override the Rhino.Render.RenderContent.CalculateRenderHash(System.UInt64) method to provide
a custom hash value.

Rhino.Render.RenderContent.RenderHashExclude(Rhino.Render.TextureRenderHashFlags,System.String)
As RenderHash, but ignore parameter names given.
flags: Flags to ignore
excludeParameterNames: semicolon-delimited string
Returns: Render hash

Rhino.Render.RenderContent.TopLevel
Returns true if this content has no parent, false if it is the child of another content.

Rhino.Render.RenderContent.Hidden
Determines if the content has the hidden flag set.

Rhino.Render.RenderContent.CanBeEdited
Determines if the content can be edited.

Rhino.Render.RenderContent.IsDefaultInstance
Checks if render content is default instance.

Rhino.Render.RenderContent.ProxyType
Gets the proxy type of the render content

Rhino.Render.RenderContent.Parent
Returns the top content in this parent/child chain.

Rhino.Render.RenderContent.FirstChild
Return First child of this content or nullptr if none.

Rhino.Render.RenderContent.NextSibling
Return First sibling of this content or nullptr if none.

Rhino.Render.RenderContent.TopLevelParent
Returns the top content in this parent/child chain.

Rhino.Render.RenderContent.Document
If this content is in a document content list, the document will be returned.  Otherwise null.

Rhino.Render.RenderContent.DocumentRegistered
If this content is used by a document, including not in the content lists (for example, as a decal),
the document will be returned.  Otherwise null.

Rhino.Render.RenderContent.DocumentAssoc
If this content is associated by a document in any way, the document will be returned.  This includes copies of
contents that were initially in the document. Otherwise null.

Rhino.Render.RenderContent.OpenInEditor
Call this method to open the content in the relevant thumbnail editor
and select it for editing by the user. The content must be in the
document or the call will fail.
Returns:
Returns true on success or false on error.

Rhino.Render.RenderContent.OpenInModalEditor
Call this method to open the content in the a modal version of the editor.
The content must be in the document or the call will fail.
Returns:
Returns true on success or false on error.

Rhino.Render.RenderContent.BeginChange(Rhino.Render.RenderContent.ChangeContexts)
Begins a change or batch of changes. This returns a reference to the
content which you should use to make your changes. It may also make a
copy of the content state allowing Rhino.Render.RenderContent.EndChange to send an
event with the old and new contents. Calls to this method are counted;
you must call EndChange() once for every call to BeginChange().
Note:
If Changed() was called between the calls to BeginChange() and
EndChange(), the last call to EndChange() may cause the ContentChanged
event to be sent.
changeContext:
the change context. If this is kUI, kProgram, kDrop or kTree, the
content will be copied. EndChange() will then send the copy as 'old' in
the OnContentChanged event.
Note:
If you override this method, please be sure to call the base
class. Rhino.Render.RenderContent.EndChange Rhino.Render.RenderContent.ContentChanged

Rhino.Render.RenderContent.EndChange
Ends a change or batch of changes. Calls to this method are counted;
you must call this method once for every call to Rhino.Render.RenderContent.BeginChange(Rhino.Render.RenderContent.ChangeContexts).
Note:
If Rhino.Render.RenderContent.BeginChange(Rhino.Render.RenderContent.ChangeContexts) was called with ChangeContexts.UI,
ChangeContexts.Program, ChangeContexts.Drop or ChangeContexts.UI.Tree
and Changed() was called between the calls to Rhino.Render.RenderContent.BeginChange(Rhino.Render.RenderContent.ChangeContexts) and
EndChange(), the last call to EndChange() will raise the
Rhino.Render.RenderContent.ContentChanged event.

Rhino.Render.RenderContent.NewUiPointer(System.Guid,System.Guid,System.String,System.Boolean,System.Boolean,System.Object)
Create a new custom content user interface instance for this
RenderContext.
classId: The class Type Guid which was created.
editorId: The editor to add the new UI to.
caption: The expandable tab caption
createExpanded:
If this is true the tab will initially be expanded otherwise it will be
collapsed.
createVisible:
If this is true the tab will initially be visible otherwise it will be
hidden.
window: The user control to embed in the expandable tab.
Returns:
Returns the UserInterfaceSection object used to manage the new custom
UI.

Rhino.Render.RenderContent.AddUserInterfaceSection(System.Type,System.String,System.Boolean,System.Boolean)
Add a new .NET control to an content expandable tab section, the height
of the createExpanded tabs client area will be the initial height of the
specified control.
classType:
The control class to create and embed as a child window in the
expandable tab client area.  This class type must be derived from
IWin32Window or this method will throw an ArgumentException.  Implement
the IUserInterfaceSection interface in your classType to get
UserInterfaceSection notification.
caption: Expandable tab caption.
createExpanded:
If this value is true then the new expandable tab section will
initially be expanded, if it is false it will be collapsed.
createVisible:
If this value is true then the new expandable tab section will
initially be visible, if it is false it will be hidden.
Returns:
Returns the UserInterfaceSection object used to manage the new
user control object.

Rhino.Render.RenderContent.AddAutomaticUserInterfaceSection(System.String,System.Int32)
Add a new automatic user interface section, Field values which include
prompts will be automatically added to this section.
caption: Expandable tab caption.
id: Tab id which may be used later on to reference this tab.
Returns:
Returns true if the automatic tab section was added otherwise; returns
false on error.

Rhino.Render.RenderContent.GetParameter(System.String)
Query the content instance for the value of a given named parameter.
If you do not support this parameter, call the base class.
parameterName: Name of the parameter
Returns: IConvertible. Note that you can't directly cast from object, instead you have to use the Convert mechanism.

Rhino.Render.RenderContent.SetParameter(System.String,System.Object,Rhino.Render.RenderContent.ChangeContexts)
Set the named parameter value for this content instance.
If you do not support this parameter, call the base class.
parameterName:
value:
changeContext:
Returns:

Rhino.Render.RenderContent.SetParameter(System.String,System.Object)
Set the named parameter value for this content instance.
If you do not support this parameter, call the base class.
parameterName:
value:
Returns:

Rhino.Render.RenderContent.IsLocked
Set this property to true prior to adding content to the document to
lock the content browser editing UI methods.  Setting this to true will
keep the browser from allowing things like deleting, renaming or
changing content.  This is useful for custom child content that you
want to be editable but persistent.  Setting this after adding content
to the document will cause an exception to be thrown.
Throws System.Exception:
IsLocked must be called prior to adding content to the document

Rhino.Render.RenderContent.GetChildSlotParameter(System.String,System.String)
Extra requirements are a way of specifying extra functionality on parameters in the automatic UI.
Implement this function to specify additional functionality for automatic UI sections or the texture summary.
See IAutoUIExtraRequirements.h in the C++ RDK for string definitions for the parameter names.
parameterName: The parameter or field internal name to which this query applies
childSlotName: The extra requirement parameter, as listed in IAutoUIExtraRequirements.h in the C++ RDK
Returns:
Call the base class if you do not support the extra requirement parameter.
Current supported return values are (int, bool, float, double, string, Guid, Color, Vector3d, Point3d, DateTime)

Rhino.Render.RenderContent.SetChildSlotParameter(System.String,System.String,System.Object,Rhino.Render.RenderContent.ExtraRequirementsSetContexts)
Extra requirements are a way of specifying extra functionality on parameters in the automatic UI.
Implement this function to support values being set from automatic UI sections or the texture summary.
See IAutoUIExtraRequirements.h in the C++ RDK for string definitions for the parameter names.
parameterName: The parameter or field internal name to which this query applies
childSlotName: The extra requirement parameter, as listed in IAutoUIExtraRequirements.h in the C++ RDK
value: The value to set this extra requirement parameter. You will typically use System.Convert to convert the value to the type you need
sc: The context of this operation.
Returns: Null variant if not supported.  Call the base class if you do not support the extra requirement paramter.

Rhino.Render.RenderContent.ChildSlotOn(System.String)
Gets the on-ness property for the texture in the specified child slot.
childSlotName: Child slot name for the child
Returns:

Rhino.Render.RenderContent.SetChildSlotOn(System.String,System.Boolean,Rhino.Render.RenderContent.ChangeContexts)
Sets the on-ness property for the texture in the specified child slot.
childSlotName: Child slot name for the child
bOn: Value for the on-ness property.
cc: Context of the change

Rhino.Render.RenderContent.ChildSlotAmount(System.String)
Gets the amount property for the texture in the specified child slot.  Values are typically from 0.0 - 100.0
childSlotName: Child slot name for the child
Returns:

Rhino.Render.RenderContent.SetChildSlotAmount(System.String,System.Double,Rhino.Render.RenderContent.ChangeContexts)
Sets the amount property for the texture in the specified child slot.  Values are typically from 0.0 - 100.0
childSlotName: Child slot name for the child
amount: Texture amount. Values are typically from 0.0 - 100.0
cc: Context of the change.

Rhino.Render.RenderContent.NewPreviewSceneServer(Rhino.Render.SceneServerData)
Gets the PreviewSceneServer of the content
ssd: SceneServerData
Returns the contents PreviewSceneServer

Rhino.Render.RenderContent.MatchData(Rhino.Render.RenderContent)
Implement to transfer data from another content to this content during creation.
oldContent: An old content object from which the implementation may harvest data.
Returns: Information about how much data was matched.

Rhino.Render.RenderContent.ChildSlotNameFromParamName(System.String)
A "child slot" is the specific "slot" that a child (usually a texture) occupies.
This is generally the "use" of the child - in other words, the thing the child
operates on.  Some examples are "color", "transparency".
paramName: The name of a parameter field. Since child textures will usually correspond with some
parameter (they generally either replace or modify a parameter over UV space) these functions are used to
specify which parameter corresponded with child slot.  If there is no correspondence, return the empty
string.
Returns:
The default behavior for these functions is to return the input string.
Sub-classes may (in the future) override these functions to provide different mappings.

Rhino.Render.RenderContent.ParamNameFromChildSlotName(System.String)
A "child slot" is the specific "slot" that a child (usually a texture) occupies.
This is generally the "use" of the child - in other words, the thing the child
operates on.  Some examples are "color", "transparency".
childSlotName: The named of the child slot to receive the parameter name for.
Returns: The default behavior for these functions is to return the input string.  Sub-classes may (in the future) override these functions to provide different mappings.

Rhino.Render.RenderContent.SetChild(Rhino.Render.RenderContent,System.String)
Set another content as a child of this content. This content may or may
not be attached to a document.  If this content already has a child
with the specified child slot name, that child will be deleted.  If
this content is not attached to a document, the child will be added
without sending any events.  If this content is attached to a document,
the necessary events will be sent to update the UI.
Note:
Do not call this method to add children in your constructor. If you
want to add default children, you should override Initialize() and add
them there.
renderContent:
Child content to add to this content. If pChild is NULL, the function
will fail.  If pChild is already attached to a document, the function
will fail.  If pChild is already a child of this or another content,
the function will fail.
childSlotName:
The name that will be assigned to this child slot. The child slot name
cannot be an empty string. If it is, the function will fail.
Returns:
Returns true if the content was added or the child slot with this name
was modified otherwise; returns false.

Rhino.Render.RenderContent.SetChild(Rhino.Render.RenderContent,System.String,Rhino.Render.RenderContent.ChangeContexts)
Set another content as a child of this content. This content may or may
not be attached to a document.  If this content already has a child
with the specified child slot name, that child will be deleted.  If
this content is not attached to a document, the child will be added
without sending any events.  If this content is attached to a document,
the necessary events will be sent to update the UI.
Note:
Do not call this method to add children in your constructor. If you
want to add default children, you should override Initialize() and add
them there.
renderContent:
Child content to add to this content. If pChild is NULL, the function
will fail.  If pChild is already attached to a document, the function
will fail.  If pChild is already a child of this or another content,
the function will fail.
childSlotName:
The name that will be assigned to this child slot. The child slot name
cannot be an empty string. If it is, the function will fail.
changeContexts:
Returns:
Returns true if the content was added or the child slot with this name
was modified otherwise; returns false.

Rhino.Render.RenderContent.IsFactoryProductAcceptableAsChild(System.Guid,System.String,System.String)
Override this method to restrict the type of acceptable child content.
The default implementation of this method just returns true.
kindId:
factoryKind:
childSlotName:
Returns:
Return true only if content with the specified kindId can be  accepted
as a child in the specified child slot.

Rhino.Render.RenderContent.FilesToEmbed
A string array of full paths to files used by the content that may be
embedded in .3dm files and library files (.rmtl, .renv, .rtex). The
default implementation returns an empty string list. Override this to
return the file name or file names used by your content. This is
typically used by textures that reference files containing the texture
imagery.

Rhino.Render.RenderContent.VirtualIcon(System.Drawing.Size,System.Drawing.Bitmap@)
Icon to display in the content browser, this bitmap needs to be valid for
the life of this content object, the content object that returns the bitmap
is responsible for disposing of the bitmap.
size:
Requested icon size
bitmap:
Returns:
Return Icon to display in the content browser.

Rhino.Render.RenderContent.ContentAdded
Used to monitor render content addition to the document.

Rhino.Render.RenderContent.ContentRenamed
Used to monitor render content renaming in the document.

Rhino.Render.RenderContent.ContentDeleting
Used to monitor render content deletion from the document.

Rhino.Render.RenderContent.ContentDeleted
Used to monitor render content deletion from the document.

Rhino.Render.RenderContent.ContentReplacing
Used to monitor render content replacing in the document.

Rhino.Render.RenderContent.ContentReplaced
Used to monitor render content replacing in the document.

Rhino.Render.RenderContent.ContentChanged
Used to monitor render content modifications.

Rhino.Render.RenderContent.ContentFieldChanged
This event is raised when a field value is modified.

Rhino.Render.RenderContent.ContentUpdatePreview
Used to monitor render content preview updates.