Rhino.Collections.ArchivableDictionary.GetString(System.String)
Get value as string, will only succeed if value was created using Set(string key, string value)
key: The key which points to the string
Returns: The string

Rhino.Collections.ArchivableDictionary.GetString(System.String,System.String)
Get value as string, will return defaultValue unless value was created using Set(string key, string value)
key: The key which points to the string
defaultValue: The string
Returns:

Rhino.Collections.ArchivableDictionary.TryGetDictionary(System.String,Rhino.Collections.ArchivableDictionary@)
Get value as ArchivableDictionary, will only succeed if value was
created using Set(string key, ArchivableDictionary value)
key:
value:
Returns:

Rhino.Collections.ArchivableDictionary.GetDictionary(System.String)
Get value as ArchivableDictionary, will only succeed if value was created
using Set(string key, ArchivableDictionary value)
key:
Returns:

Rhino.Collections.ArchivableDictionary.GetDictionary(System.String,Rhino.Collections.ArchivableDictionary)
Get value as ArchivableDictionary, will return defaultValue unless
value was created using Set(string key, ArchivableDictionary value)
key:
defaultValue:
Returns:

Rhino.Collections.ArchivableDictionary.TryGetBytes(System.String,System.Byte[]@)
Get value as byte[], will only succeed if value was
created using Set(string key, byte[] value)
key:
value:
Returns:

Rhino.Collections.ArchivableDictionary.GetBytes(System.String)
Get value as byte[], will only succeed if value was created
using Set(string key, byte[] value)
key:
Returns:

Rhino.Collections.ArchivableDictionary.GetBytes(System.String,System.Byte[])
Get value as byte[], will return defaultValue unless
value was created using Set(string key, byte[] value)
key:
defaultValue:
Returns:

Rhino.Collections.ArchivableDictionary.GetDouble(System.String,System.Double)
Get value as double, will only succeed if value was created using Set(string key, double value)
key:
defaultValue:
Returns:

Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.DocObjects.ObjRef)
Sets a Rhino.DocObjects.ObjRef
key: A text key
val: An object for that key
Because this class is a reference type and is mutable, changes to this object will propagate to the object inside the dictionary.
It is up to the user to clone this entry when appropriate.

Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})
Sets an array of Rhino.DocObjects.ObjRef
key: A text key
val: An object for that key
Because this class is a reference type and is mutable, changes to this object will propagate to the object inside the dictionary.
It is up to the user to clone this entry when appropriate.

Rhino.Collections.ArchivableDictionary.SetEnumValue``1(``0)
Set an enum value
enumValue:
Returns:

Rhino.Collections.ArchivableDictionary.SetEnumValue``1(System.String,``0)
Set an enum value in the dictionary with a custom key.
key:
enumValue:
Returns:

Rhino.Collections.ArchivableDictionary.GetEnumValue``1
Get an enum value
Throws System.Collections.Generic.KeyNotFoundException: Thrown when the key is not found in the dictionary.
Throws System.FormatException: Thrown when the string retrieved from the dictionary is not convertible to the enum type.
Returns:

Rhino.Collections.ArchivableDictionary.GetEnumValue``1(System.String)
Get an enum value from the dictionary using a custom key.
key:
Throws System.Collections.Generic.KeyNotFoundException: Thrown when the key is not found in the dictionary.
Throws System.FormatException: Thrown when the string retrieved from the dictionary is not convertible to the enum type.
Returns:

Rhino.Collections.ArchivableDictionary.TryGetEnumValue``1(System.String,``0@)
Attempt to get an enum value from the dictionary using a custom key.
key:
enumValue:
Returns:

Rhino.Collections.ArchivableDictionary.RemoveEnumValue``1
Remmove an enum value from the dictionary.
Returns:

Rhino.Collections.ArchivableDictionary.AddContentsFrom(Rhino.Collections.ArchivableDictionary)
Add the contents from the source dictionary.
source:
Returns:
Throws System.ArgumentException:

Rhino.Collections.ArchivableDictionary.ReplaceContentsWith(Rhino.Collections.ArchivableDictionary)
Replace the contents of the dictionary with that of the given source dictionary.
source:
Returns: