Rhino.Geometry.Collections.SubDVertexAccess
Provides access to the vertices and vertex-related functionality of a SubD.

Rhino.Geometry.Collections.SubDVertexAccess.Count
Gets or sets the number of SubD vertices.

Rhino.Geometry.Collections.SubDVertexAccess.Add(Rhino.Geometry.SubD.SubDVertexTag,System.Double,System.Double,System.Double)
Adds a new vertex to the end of the Vertex list.
tag: The type of vertex tag, such as smooth or corner.
x: X component of new vertex coordinate.
y: Y component of new vertex coordinate.
z: Z component of new vertex coordinate.
Throws System.ArgumentOutOfRangeException: If tag is unset or non-defined.

Rhino.Geometry.Collections.SubDVertexAccess.Add(Rhino.Geometry.SubD.SubDVertexTag,Rhino.Geometry.Point3d)
Adds a new vertex to the end of the Vertex list.
tag: The type of vertex tag, such as smooth or corner.
vertex: Location of new vertex.
Returns: The index of the newly added vertex.
Throws System.ArgumentOutOfRangeException: If tag is unset or non-defined.

Rhino.Geometry.Collections.SubDVertexAccess.AddVertices(Rhino.Geometry.SubD.SubDVertexTag,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds a series of new vertices to the end of the vertex list.
This overload accepts double-precision points.
tag: The type of vertex tag, such as smooth or corner.
vertices: A list, an array or any enumerable set of Rhino.Geometry.Point3d.
Throws System.ArgumentOutOfRangeException: If tag is unset or non-defined.

Rhino.Geometry.Collections.SubDVertexAccess.AddVertices(Rhino.Geometry.SubD.SubDVertexTag,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f})
Adds a series of new vertices to the end of the vertex list.
This overload accepts single-precision points.
tag: The type of vertex tag, such as smooth or corner.
vertices: A list, an array or any enumerable set of Rhino.Geometry.Point3d.

Rhino.Geometry.Collections.SubDVertexAccess.RemoveVertexAndConnections(System.Int32[])
Removes some vertices from the subD.
vertexIndices: The array of vertices.
If null, no vertices are removed and the method succeeds.
Returns: True if the method succeeds; false otherwise.

Rhino.Geometry.Collections.SubDVertexAccess.RemoveVertexAndConnections(System.Int32)
Removes a vertex from the subD.
All connected parts are removed, too.
vertexIndex: A vertex.
If null, no vertices are removed and the method succeeds.
Returns: True if the method succeeds; false otherwise.

Rhino.Geometry.Collections.SubDVertexAccess.GetUnboundSectorIterator
This iterator needs to be reset before any use is sensible.