Rhino.Render.RenderMaterial.CreateBasicMaterial(Rhino.DocObjects.Material)
Constructs a new basic material from a Material.
material: (optional)The material to create the basic material from.
Returns: A new basic material.

Rhino.Render.RenderMaterial.TextureChildSlotName(Rhino.Render.RenderMaterial.StandardChildSlots)
Override this function to provide information about which texture is used for
the standard (ie - defined in ON_Texture) texture channels.
slot: An valid slot.
Returns: The texture used for the channel.

Rhino.Render.RenderMaterial.SimulateMaterial(Rhino.DocObjects.Material@,System.Boolean)
Override this function to provide a Rhino.DocObjects.Material definition for this material
to be used by other rendering engines including the display.
simulation: Set the properties of the input basic material to provide the simulation for this material.
isForDataOnly: Called when only asking for a hash - don't write any textures to the disk - just provide the filenames they will get.

Rhino.Render.RenderMaterial.SimulateMaterial(System.Boolean)
Override this function to provide a Rhino.DocObjects.Material definition for this material
to be used by other rendering engines including the display.
isForDataOnly: Called when only asking for a hash - don't write any textures to the disk - just provide the filenames they will get.
Returns: The simulation of the render material

Rhino.Render.RenderMaterial.DefaultPreviewGeometryType
Set or get the default geometry that appears in preview panes

Rhino.Render.RenderMaterial.DefaultPreviewBackgroundType
Set or get the default scene background for the image that appears in
preview panes

Rhino.Render.RenderMaterial.DefaultPreviewSize
The default preview geometry size