Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedEdgesCount(System.Int32)
Gets the count of edges that are connected to a given vertex.
topologyVertexIndex: Index of a topology vertex in Mesh.TopologyVertices.
Returns: The amount of edges at this vertex. This can be 0.

Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedEdge(System.Int32,System.Int32)
Gets a particular edge that is connected to a topological vertex.
Call TopologyVertices.SortVertices before this if you are interested in ordered edges.
topologyVertexIndex: Index of a topology vertex in Mesh.TopologyVertices.
edgeAtVertexIndex: Index of the edge at the vertex.
Returns:
The index of the connected edge.

Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedEdges(System.Int32)
Gets all edges that are connected to a given vertex.
Call TopologyVertices.SortVertices before this if you are interested in ordered edges.
topologyVertexIndex: Index of a topology vertex in Mesh.TopologyVertices.
Returns:
Indices of all edges around vertex that are connected to this topological vertex.
null if no faces are connected to this vertex.