Rhino.Geometry.AnnotationBase.AnnotationType
Type of annotation

Rhino.Geometry.AnnotationBase.DimensionStyleId
Id of this annotation's parent dimstyle
If this annotation has overrides to dimstyle properties,
those overrides will be represented in the DimensionStyle
returned by DimensionStyle(ParentStyle)

Rhino.Geometry.AnnotationBase.HasPropertyOverrides


Rhino.Geometry.AnnotationBase.IsPropertyOverridden(Rhino.DocObjects.DimensionStyle.Field)
Returns true if a property is overridden
field:
Returns:

Rhino.Geometry.AnnotationBase.ClearPropertyOverrides
Clears all overriden properties for this annotation
Returns:

Rhino.Geometry.AnnotationBase.GetDimensionStyle(Rhino.DocObjects.DimensionStyle)
Return the proper dimension style from which to get properties
for this annotation object
If this object has style overrides, those will be included in the
returned dimension style and the style will be updated to include
the current state of the parent style for non-overridden fields
parentDimStyle:
Returns:

Rhino.Geometry.AnnotationBase.DimensionStyle
If there are no overrides then the parent style is returned otherwise the dimension style saved with the annotation is returned.

Rhino.Geometry.AnnotationBase.SetOverrideDimStyle(Rhino.DocObjects.DimensionStyle)
Set a style including overrides for this annotation object.
The DimensionStyle OverrideStyle must have the override fields marked
as overridden and must have it's Id set to nil.
Use DimensinoStyle.SetFieldOverride(Field field) and related functions
to manage override settings. To override a field, the field value must be set
and the field must be marked as an override.
The DimensionStyle passed in here must not be in the dimstyle table
OverrideStyle:
Returns:

Rhino.Geometry.AnnotationBase.ParentDimensionStyle
The parent dimension style associated with this annotation

Rhino.Geometry.AnnotationBase.TextHeight
AnnotationBase.TextHeight
Gets the parent dimstyle for the annotation and
gets or sets the text height in the dimstyle

Rhino.Geometry.AnnotationBase.MaskEnabled
Determines whether or not to draw a Text Mask

Rhino.Geometry.AnnotationBase.MaskUsesViewportColor
If true, the viewport's color is used for the mask color. If
false, the color defined by MaskColor is used

Rhino.Geometry.AnnotationBase.MaskColorSource
Gets or sets whether the mask background color is from the background or from a color

Rhino.Geometry.AnnotationBase.MaskColor
Color to use for drawing a text mask when it is enabled. If the mask is
enabled and MaskColor is System.Drawing.Color.Transparent, then the
viewport's color will be used for the MaskColor

Rhino.Geometry.AnnotationBase.MaskOffset
Offset for the border around text of the rectangle used to draw the mask.  This
value multiplied by TextHeight is the offset on each side of the tight rectangle
around the text characters to the mask rectangle. The default value is 0.1.

Rhino.Geometry.AnnotationBase.DimensionScale
Gets or sets the dimension scale

Rhino.Geometry.AnnotationBase.GetDimensionScale(Rhino.RhinoDoc,Rhino.DocObjects.DimensionStyle,Rhino.Display.RhinoViewport)
Get view dependent dimension scale
doc:
dimstyle:
vport:
Returns:

Rhino.Geometry.AnnotationBase.DrawForward
Gets or sets whether the text is oriented towards the reader when viewed from behind

Rhino.Geometry.AnnotationBase.Font
The base Font for the text of the annotation.  The text string is rich text and therefore a different font that the base font can be associated with sub strings of the text

Rhino.Geometry.AnnotationBase.DimensionLengthDisplay
Length display units and format

Rhino.Geometry.AnnotationBase.AlternateDimensionLengthDisplay
Alternate length display units and format

Rhino.Geometry.AnnotationBase.Plane
Plane that this annotation lies on

Rhino.Geometry.AnnotationBase.TextFormula
See RichText

Rhino.Geometry.AnnotationBase.RichText
Text including additional RTF formatting information

Rhino.Geometry.AnnotationBase.Text
Text including additional RTF formatting information

Rhino.Geometry.AnnotationBase.PlainText
Text stripped of RTF formatting information

Rhino.Geometry.AnnotationBase.SetRichText(System.String,Rhino.DocObjects.DimensionStyle)
rtfText:
dimstyle:

Rhino.Geometry.AnnotationBase.TextHasRtfFormatting


Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)
rtf_in:
clear_bold:
set_bold:
clear_italic:
set_italic:
clear_underline:
set_underline:
clear_facename:
set_facename:
facename:
Returns:

Rhino.Geometry.AnnotationBase.FirstCharProperties(System.String,System.Boolean@,System.Boolean@,System.Boolean@,System.String@)
rtf_str:
bold:
italic:
underline:
facename:
Returns:

Rhino.Geometry.AnnotationBase.TextModelWidth
Width of text in the model

Rhino.Geometry.AnnotationBase.FormatWidth
Text format width (Wrapping rectangle)

Rhino.Geometry.AnnotationBase.TextIsWrapped
Is text wrapping on

Rhino.Geometry.AnnotationBase.WrapText
Wrap text

Rhino.Geometry.AnnotationBase.TextRotationRadians
Rotation of text in radians

Rhino.Geometry.AnnotationBase.TextRotationDegrees
Rotation of text in degrees

Rhino.Geometry.AnnotationBase.SetBold(System.Boolean)
set_on:
Returns:

Rhino.Geometry.AnnotationBase.SetItalic(System.Boolean)
set_on:
Returns:

Rhino.Geometry.AnnotationBase.SetUnderline(System.Boolean)
set_on:
Returns:

Rhino.Geometry.AnnotationBase.SetFacename(System.Boolean,System.String)
set_on:
facename:
Returns: