Rhino.Display.ZBufferCapture
Provides functionality for getting the zbuffer values from a viewport
and a given display mode

Rhino.Display.ZBufferCapture.Dispose
Actively reclaims unmanaged resources that this instance uses.