Rhino.DocObjects.ObjRef.Trim
If the referenced geometry is an edge of a surface,
this returns the associated brep trim.
Returns: A boundary representation trim; or null on error

Rhino.DocObjects.ObjRef.SubD
Gets the SubD if the referenced geometry is one.
Returns: A SubD; or null if the referenced object is not a SubD, or on error.