Rhino.Geometry.BoundingBox.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Transform)
Constructs a boundingbox from a collection of points.
points: Points to include in the boundingbox.
xform: Transformation.

Rhino.Geometry.BoundingBox.Area
Gets the area of this BoundingBox.

Rhino.Geometry.BoundingBox.Volume
Gets the volume of this BoundingBox.