Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1
An ordered set that notifies its subscribers whenever one of its INotifyPropertyChanged elements raises its PropertyChanged event.
A class that implements INotifyPropertyChanged as well as IAssemblyRestrictedObject
Remarks: This class prevents the removal of elements by assemblies they cannot be edited by. At the time of removal,
each element's Rhino.Runtime.Notifications.IAssemblyRestrictedObject.EditableByAssembly(System.Reflection.Assembly) method will be invoked, and if false, an
InvalidOperationException will be thrown.