Rhino.PlugIns.LicenseStatus.BuildType
The build contentType of the product, where:
100 = A release build, either commercical, education, nfr, etc.
200 = A evaluation build
300 = A beta build, such as a wip.

Rhino.PlugIns.LicenseStatus.LicenseTitle
The title of the license. (e.g. "Rhinoceros 6.0 Commercial")

Rhino.PlugIns.LicenseStatus.LicenseType
The license contentType. (e.g. Standalone, Network, etc.)

Rhino.PlugIns.LicenseStatus.ExpirationDate
The date and time the license will expire.
This value can be null if:
1.) The license contentType is "Standalone" and the license does not expire.
2.) The license contentType is "Network".
3.) The license contentType is "NetworkCheckedOut" and the checkout does not expire
Note, date and time is in local time coordinates.

Rhino.PlugIns.LicenseStatus.CheckOutExpirationDate
The date and time the checked out license will expire.
Note, this is only set if m_license_type = Standalone or CloudZoo
and if "limited license checkout" was enabled on the Zoo server in the case of Standalone.
Note, date and time is in local time coordinates.

Rhino.PlugIns.LicenseStatus.CloudZooLeaseIsValid
Returns true if the Cloud Zoo Lease represented by this instance is actively being managed by the Cloud Zoo Manager; else returns false.