Rhino.Render.TextureMapping.MappingType
Texture mapping type associated with this Mapping object.

Rhino.Render.TextureMapping.Id
The unique Id for this texture mapping object.

Rhino.Render.TextureMapping.UvwTransform
Transform applied to mapping coordinate (u,v,w) to convert it into a
texture coordinate.

Rhino.Render.TextureMapping.PrimativeTransform
For primitive based mappings, these transformations are used to map
the world coordinate (x,y,z) point P and  surface normal N before it is
projected to the normalized mapping primitive. The surface normal
transformation, m_Nxyz, is always calculated from m_Pxyz.  It is a
runtime setting that is not saved in 3dm files. If m_type is
srfp_mapping, then m_Pxyz and m_Nxyz are ignored.

Rhino.Render.TextureMapping.NormalTransform
For primitive based mappings, these transformations are used to map
the world coordinate (x,y,z) point P and  surface normal N before it is
projected to the normalized mapping primitive. The surface normal
transformation, m_Nxyz, is always calculated from m_Pxyz.  It is a
runtime setting that is not saved in 3dm files. If m_type is
srfp_mapping, then m_Pxyz and m_Nxyz are ignored.

Rhino.Render.TextureMapping.ComponentType
Returns Rhino.DocObjects.ModelComponentType.TextureMapping.

Rhino.Render.TextureMapping.TryGetMappingBox(Rhino.Geometry.Plane@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@)
Get a box projection from the texture mapping.
plane:
The center of the box is at plane.origin and the sides of the box are
parallel to the plane's coordinate planes.
dx:
The "front" and "back" sides of the box are in spanned by the vectors
plane.yaxis and plane.zaxis.  The back plane contains the point
plane.PointAt(dx[0],0,0) and the front plane contains the point
plane.PointAt(dx[1],0,0).
dy:
The "left" and "right" sides of the box are in spanned by the vectors
plane.zaxis and plane.xaxis.  The left plane contains the point
plane.PointAt(0,dx[0],0) and the back plane contains the point
plane.PointAt(0,dy[1],0).
dz:
The "top" and "bottom" sides of the box are in spanned by the vectors
plane.xaxis and plane.yaxis.  The bottom plane contains the point
plane.PointAt(0,0,dz[0]) and the top plane contains the point
plane.PointAt(0,0,dz[1]).
Returns:
Returns true if a valid box is returned.
Remarks:
Generally, GetMappingBox will not return the same parameters passed to
SetBoxMapping.  However, the location of the box will be the same.

Rhino.Render.TextureMapping.TryGetMappingSphere(Rhino.Geometry.Sphere@)
Get a spherical projection parameters from this texture mapping.
sphere: ///
Returns:
Returns true if a valid sphere is returned.
Remarks:
Generally, GetMappingShere will not return the same parameters passed
to SetSphereMapping.  However, the location of the sphere will be the
same.  If this mapping is not cylindrical, the cylinder will
approximate the actual mapping primitive.

Rhino.Render.TextureMapping.TryGetMappingCylinder(Rhino.Geometry.Cylinder@)
Get a cylindrical projection parameters from this texture mapping.
cylinder:
Returns:
Returns true if a valid cylinder is returned.
Remarks:
Generally, GetMappingCylinder will not return the same parameters passed
to SetCylinderMapping.  However, the location of the cylinder will be
the same.  If this mapping is not cylindrical, the cylinder will
approximate the actual mapping primitive.

Rhino.Render.TextureMapping.TryGetMappingPlane(Rhino.Geometry.Plane@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@)
Get plane mapping parameters from this texture mapping.
plane:
dx:
Portion of the plane's x axis that is mapped to [0,1]
dy:
Portion of the plane's y axis that is mapped to [0,1]
dz:
Portion of the plane's z axis that is mapped to [0,1]
Returns:
Return true if valid plane mapping parameters were returned.
Remarks:
NOTE WELL:
Generally, GetMappingPlane will not return the same parameters passed
to SetPlaneMapping.  However, the location of the plane will be the
same.