Rhino.Geometry.Point2d.EpsilonEquals(Rhino.Geometry.Point2d,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:

Rhino.Geometry.Point2d.Transform(Rhino.Geometry.Transform)
Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
xform: Transformation to apply.