Rhino.Runtime.InteropWrappers.SimpleArrayUint.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayUint.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayUint.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayInt class.

Rhino.Runtime.InteropWrappers.SimpleArrayUint.#ctor(System.Collections.Generic.IEnumerable{System.UInt32})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayInt class.
values: A list, an array or any collection of unsigned ints that implements the enumerable interface.

Rhino.Runtime.InteropWrappers.SimpleArrayUint.Count
Gets the number of elements in this array.

Rhino.Runtime.InteropWrappers.SimpleArrayUint.UnsignedCount
Gets the number of elements in this array.

Rhino.Runtime.InteropWrappers.SimpleArrayUint.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayUint.Dispose
Actively reclaims unmanaged resources that this instance uses.