Rhino.Geometry.Rectangle3d.CreateFromPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Attempts to create a rectangle from a polyline. This method only works well for
polylines that already closely resemble rectangles. If the polyline contains
more than four vertices, the least significant ones will be ignored. If the
polylines is non-orthogonal, the discrepancies will be averaged away.
This method should not be used as a Rectangle fitter.
polyline: Polyline to parse.
Returns: A rectangle that is shaped similarly to the polyline or Rectangle3d.Unset
if the polyline does not represent a rectangle.

Rhino.Geometry.Rectangle3d.CreateFromPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double@,System.Double@)
Attempts to create a rectangle from a polyline. This method only works well for
polylines that already closely resemble rectangles. If the polyline contains
more than four vertices, the least significant ones will be ignored. If the
polylines is non-orthogonal, the discrepancies will be averaged away.
This method should not be used as a Rectangle fitter.
polyline: Polyline to parse.
deviation: On success, the deviation will contain the largest deviation between the polyline and the rectangle.
angleDeviation: On success, the angleDeviation will contain the largest deviation (in radians) between the polyline edges and the rectangle edges.
Returns: A rectangle that is shaped similarly to the polyline or Rectangle3d.Unset
if the polyline does not represent a rectangle.

Rhino.Geometry.Rectangle3d.EpsilonEquals(Rhino.Geometry.Rectangle3d,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns: