Rhino.DocObjects.Custom.UserDataListEnumerator.#ctor(Rhino.DocObjects.Custom.UserDataList)
Create new UserDataListEnumerator
udl: UserDataList to enumerate

Rhino.DocObjects.Custom.UserDataListEnumerator.Current
Get current UserData on the enumerator.

Rhino.DocObjects.Custom.UserDataListEnumerator.Dispose
Implement Dispose(). NOP.

Rhino.DocObjects.Custom.UserDataListEnumerator.MoveNext
Advance enumerator to next UserData item.
Returns: True if there is a next item.

Rhino.DocObjects.Custom.UserDataListEnumerator.Reset
Reset the enumerator