Rhino.DocObjects.Tables.FontTable.FindOrCreate(System.String,System.Boolean,System.Boolean)
Get a DimensionStyle with the specified characteristics
the settings other than face, bold and italic are copied from the current style
face:
bold:
italic:
Returns:

Rhino.DocObjects.Tables.FontTable.FindOrCreate(System.String,System.Boolean,System.Boolean,Rhino.DocObjects.DimensionStyle)
Get a DimensionStyle with the specified characteristics
face:
bold:
italic:
template_style:
the settings other than face, bold and italic are copied from the template_style
Returns: