Rhino.Render.RenderWindow.ImageAdjust.Gamma
Set the gamma value. The inverse of this will be used to apply
gamma correction to the RenderWindow RGBA channel when necessary.

Rhino.Render.RenderWindow.ImageAdjust.Dither
Set the Dithering method to use when adjusting the RenderWindow
content.