Rhino.Geometry.SubD.SubDFacetType
SubD::FacetType reports the default facet type for subdivision algorithms.

Rhino.Geometry.SubD.SubDFacetType.Unset
Not a valid facet type.

Rhino.Geometry.SubD.SubDFacetType.Tri
Triangle

Rhino.Geometry.SubD.SubDFacetType.Quad
Quadrangle