Rhino.Geometry.HiddenLineDrawingParameters.#ctor
default constructor

Rhino.Geometry.HiddenLineDrawingParameters.AbsoluteTolerance
Absolute tolerance is used to decide if curves overlap or intersect.
A suggested value is to use RhinoDoc.AbsoluteTolerance

Rhino.Geometry.HiddenLineDrawingParameters.SetViewport(Rhino.DocObjects.ViewportInfo)
Set the viewport for the hidden line drawing (HLD). The viewport supplies
the projection that determines the visibility of curves, and the HLD
coordinate system in which the resulting curves are represented. The
HLD-coordinate system is a right handed system for 3-D model space, in
which the 3rd coordinate direction is the projection direction. In particular
the z-coordinate direction points from the scene toward the camera.
viewport: A copy of viewportInfo is made inside of HiddenLineDrawing.
Returns: True if the viewport has been set.

Rhino.Geometry.HiddenLineDrawingParameters.SetViewport(Rhino.Display.RhinoViewport)
Set the viewport for the hidden line drawing (HLD). The viewport supplies
the projection that determinest he visibility of curves, and the HLD
coordinate system in which the resulting curves are represented. The
HLD-coordinate system is a right handed system for 3-D model space, in
which the 3rd coordinate direction is the projection direction. In particular
the z-coordinate direction points from the scene toward the camera.
viewport: A copy of rhinoViewport is made inside of HiddenLineDrawing.
Returns: True if the viewport has been set.

Rhino.Geometry.HiddenLineDrawingParameters.Flatten
Flatten the computed geometry

Rhino.Geometry.HiddenLineDrawingParameters.AddClippingPlane(Rhino.Geometry.Plane)
Specify clipping planes that are active for this view.
plane:

Rhino.Geometry.HiddenLineDrawingParameters.IncludeTangentEdges
Include tangent edges in hidden line drawing (default is true)

Rhino.Geometry.HiddenLineDrawingParameters.IncludeTangentSeams
Include tangent seams in hidden line drawing (default is true)

Rhino.Geometry.HiddenLineDrawingParameters.IncludeHiddenCurves
Include hidden curves in hidden line drawing (default is true)

Rhino.Geometry.HiddenLineDrawingParameters.AddGeometry(Rhino.Geometry.GeometryBase,System.Object)
Add geometry that should be included in the calculation
geometry:
Currently only curves, meshes, breps, surfaces, and extrusions are supported
tag: arbitrary data to be associated with this geometry
Returns:
true if the type of geometry can be added for calculations.
Currently only curves, meshes, breps, surfaces and extrusions are supported

Rhino.Geometry.HiddenLineDrawingParameters.AddGeometry(Rhino.Geometry.GeometryBase,Rhino.Geometry.Transform,System.Object)
Add geometry that should be included in the calculation
geometry:
Currently only curves, meshes, breps, surfaces, and extrusions are supported
xform:
tag: arbitrary data to be associated with this geometry
Returns:
true if the type of geometry can be added for calculations.
Currently only curves, meshes, breps, surfaces and extrusions are supported