Rhino.Geometry.Morphs.TaperSpaceMorph.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double,System.Boolean,System.Boolean)
Constructs a taper space morph.
start: Start of the taper axis.
end: End of the taper axis.
startRadius: Radius at start point.
endRadius: Radius at end point.
bFlat: If true, then a one-directional, one-dimensional taper is created.
infiniteTaper: If false, the deformation takes place only the length of the axis. If true, the deformation happens throughout the object, even if the axis is shorter.

Rhino.Geometry.Morphs.TaperSpaceMorph.IsValid
Returns true if the space morph definition is valid, false otherwise.

Rhino.Geometry.Morphs.TaperSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point.
point: A point that will be morphed by this object.
Returns: Resulting morphed point.

Rhino.Geometry.Morphs.TaperSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.