Rhino.Geometry.Collections.MeshTopologyEdgeList.IsNgonInterior(System.Int32)
Returns true if the topological edge is an interior ngon edge
topologyEdgeIndex: An index of a topology edge in Rhino.Geometry.Mesh.TopologyEdges.
Returns: true if mesh topology edge is an interior ngon edge.