Rhino.Render.RenderPrimitiveList.ToMeshArray
Call this method to get a array of meshes, all primitives will get
meshed and the meshes will get included in the returned array.
Returns:
Return an array of meshes from this list, this will convert all
primitives to meshes.

Rhino.Render.RenderPrimitiveList.ToMaterialArray
Call this method to see if there are any RenderMaterials associated
with the meshes.  Each primitive can optionally have a RenderMaterial
associated with it, if the RenderMaterial is null then check for a
RhinoObject.RenderMaterial.
Returns:
Return an array that of the same size as the ToMeshArray() containing
the RenderMaterial associated with the mesh, may contain null entries
if there is no RenderMaterial associated with the custom mesh.

Rhino.Render.RenderPrimitiveList.Add(Rhino.Geometry.Mesh,Rhino.Render.RenderMaterial)
Add mesh and material.
mesh: Mesh to add.
material:
Material to add, may be null if not needed.

Rhino.Render.RenderPrimitiveList.Add(Rhino.Geometry.Sphere,Rhino.Render.RenderMaterial)
Add primitive sphere and material.
sphere: Sphere to add.
material:
Material to add, may be null if not needed.

Rhino.Render.RenderPrimitiveList.Add(Rhino.Geometry.Cone,Rhino.Geometry.Plane,Rhino.Render.RenderMaterial)
Add primitive cone and material.
cone: Cone to add.
truncation:
The plane used to cut the cone (the non-apex end is kept). Should be
equal to cone.plane if not truncated.
material:
Material to add, may be null if not needed.

Rhino.Render.RenderPrimitiveList.Add(Rhino.Geometry.PlaneSurface,Rhino.Render.RenderMaterial)
Add primitive plane and material.
plane: Plane to add.
material:
Material to add, may be null if not needed.

Rhino.Render.RenderPrimitiveList.Add(Rhino.Geometry.Box,Rhino.Render.RenderMaterial)
Add primitive box and material.
box: Box to add.
material:
Material to add, may be null if not needed.

Rhino.Render.RenderPrimitiveList.UseObjectsMappingChannels
Returns true if the texture mapping will be taken from the Rhino
object otherwise; the texture mapping will use the texture coordinates
on the mesh only.

Rhino.Render.RenderPrimitiveList.Count
Number of meshes in this list

Rhino.Render.RenderPrimitiveList.PrimitiveType(System.Int32)
Type of primitive object at this index.
index:
The zero based index of the item in the list.  Valid values are greater
than or equal to 0 and less than Count.
Returns:
Primitive type of the item at this index.

Rhino.Render.RenderPrimitiveList.Mesh(System.Int32)
Get the mesh for the primitive at the specified index. If the item at
this index is a primitive type other than a mesh then it mesh
representation is returned.
index:
The zero based index of the item in the list.  Valid values are greater
than or equal to 0 and less than Count.
Returns:
Returns the mesh for the primitive at the specified index. If the item
at this index is a primitive type other than a mesh then it mesh
representation is returned.

Rhino.Render.RenderPrimitiveList.TryGetSphere(System.Int32,Rhino.Geometry.Sphere@)
Call this method to get a box at the specified index.
index:
The zero based index of the item in the list.  Valid values are greater
than or equal to 0 and less than Count.
sphere:
Will contain the sphere at the requested index if the index is in range
and the primitive at the requested index is a box.
Returns:
Return true if the index is in range and the primitive at the requested
index is a box otherwise returns false.

Rhino.Render.RenderPrimitiveList.TryGetBox(System.Int32,Rhino.Geometry.Box@)
Call this method to get a box at the specified index.
index:
The zero based index of the item in the list.  Valid values are greater
than or equal to 0 and less than Count.
box:
Will contain the box at the requested index if the index is in range
and the primitive at the requested index is a box.
Returns:
Return true if the index is in range and the primitive at the requested
index is a box otherwise returns false.

Rhino.Render.RenderPrimitiveList.TryGetPlane(System.Int32,Rhino.Geometry.PlaneSurface@)
Call this method to get a box at the specified index.
index:
The zero based index of the item in the list.  Valid values are greater
than or equal to 0 and less than Count.
plane:
Will contain the plane at the requested index if the index is in range
and the primitive at the requested index is a plane.
Returns:
Return true if the index is in range and the primitive at the requested
index is a plane otherwise returns false.

Rhino.Render.RenderPrimitiveList.TryGetCone(System.Int32,Rhino.Geometry.Cone@,Rhino.Geometry.Plane@)
Call this method to get a box at the specified index.
index:
The zero based index of the item in the list.  Valid values are greater
than or equal to 0 and less than Count.
cone:
Will contain the cone at the requested index if the index is in range
and the primitive at the requested index is a box.
truncation:
Returns:
Return true if the index is in range and the primitive at the requested
index is a box otherwise returns false.

Rhino.Render.RenderPrimitiveList.Material(System.Int32)
Call this method to get the render material associated with the mesh at
the specified index.  Will return null if there is no
material associated with the requested mesh.
index:
The zero based index of the item in the list.  Valid values are greater
than or equal to 0 and less than Count.
Returns:
If there is a render material associated at the requested index then
the material is returned otherwise null is returned.

Rhino.Render.RenderPrimitiveList.RhinoObject
The Rhino object associated with this list

Rhino.Render.RenderPrimitiveList.ConvertMeshesToTriangles
Convert mesh quad faces to triangle faces.

Rhino.Render.RenderPrimitiveList.Clear
Remove all primitives from this list