Rhino.Input.Custom.GetCircle.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Input.Custom.GetCircle.AllowDeformable
Allow for deformable options

Rhino.Input.Custom.GetCircle.Deformable
Is the deformable option set

Rhino.Input.Custom.GetCircle.DefaultSize
Default radius or diameter (based on InDiameterMode)

Rhino.Input.Custom.GetCircle.InDiameterMode
Determines if the "size" value is reperesenting a radius or diameter

Rhino.Input.Custom.GetCircle.Get(Rhino.Geometry.Circle@)
Perform the 'get' operation.
circle:
Returns: