Rhino.Display.DisplayModeDescription.ImportFromFile(System.String)
Imports a DisplayModeDescription from a Windows-style .ini file.
filename: The name of the file to import.
Returns: The id of the DisplayModeDescription if successsful.

Rhino.Display.DisplayModeDescription.ExportToFile(Rhino.Display.DisplayModeDescription,System.String)
Exports a DisplayModeDescription to a Windows-style .ini file.
displayMode: The DisplayModeDescription to export.
filename: The name of the file to create.
Returns: