Rhino.Geometry.BrepFace.SurfaceIndex
Surface index of the 3d surface geometry used by this face or -1

Rhino.Geometry.BrepFace.PullPointsToFace(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Pulls one or more points to a brep face.
points: Points to pull.
tolerance: Tolerance for pulling operation. Only points that are closer than tolerance will be pulled to the face.
Returns: An array of pulled points.

Rhino.Geometry.BrepFace.DraftAnglePoint(Rhino.Geometry.Point2d,System.Double,Rhino.Geometry.Vector3d,System.Boolean,Rhino.Geometry.Point3d@,System.Double@)
Returns the surface draft angle and point at a parameter.
testPoint: The u,v parameter on the face to evaluate.
testAngle: The angle in radians to test.
pullDirection: The pull direction.
edge: Restricts the point placement to an edge.
draftPoint: The draft angle point.
draftAngle: The draft angle in radians.
Returns: True if successful, false otherwise.

Rhino.Geometry.BrepFace.CreateExtrusion(Rhino.Geometry.Curve,System.Boolean)
Extrude a face in a Brep.
pathCurve: The path to extrude along.
cap: If true, the extrusion is capped with a translation of the face being extruded
Returns: A Brep on success or null on failure.