Rhino.Runtime.Notifications.IAssemblyRestrictedObject.EditableByAssembly(System.Reflection.Assembly)
Determines whether an assembly can modify the instance.
assembly: The assembly that will be considered to verify if it can edit the instance.
Returns: true if the instance can be edited by the assembly, otherwise returns false.