Rhino.DocObjects.DimensionStyle.#ctor
Create a new non-document controlled annotation style

Rhino.DocObjects.DimensionStyle.Duplicate
Construct a deep (full) copy of this object.
Returns: An object of the same type as this, with the same properties and behavior.

Rhino.DocObjects.DimensionStyle.Duplicate(System.String,System.Guid,System.Guid)
Construct a deep (full) copy of this object.
Returns: An object of the same type as this, with the same properties and behavior.

Rhino.DocObjects.DimensionStyle.CopyFrom(Rhino.DocObjects.DimensionStyle)
Copy settings from source dimension style without changing the name, Id or
index of this DimensionStyle.
source:
DimensionStyle to copy settings from.

Rhino.DocObjects.DimensionStyle.ScaleLengthValues(System.Double)
Scales all length values by 'scale'
scale:

Rhino.DocObjects.DimensionStyle.LeaderTextRotationRadians
Angle of leader text for Rotated style

Rhino.DocObjects.DimensionStyle.LeaderContentAngleType
Style of leader content angle
Horizontal
Aligned
Rotated

Rhino.DocObjects.DimensionStyle.ComponentType
Returns Rhino.DocObjects.ModelComponentType.ModelGeometry.

Rhino.DocObjects.DimensionStyle.IsFieldOverriden(Rhino.DocObjects.DimensionStyle.Field)
Normally, a DimensionStyle is neither a Child nor a Parent.
Setting the value of DimensionStyle.ParentId to the Id of another
DimensionStyle makes that style the Parent of this style.
Fields in a DimensionStyle can get their values from the
Child style or the Parent style.
If a field is marked overridden in the Child style,
the value of that field comes from the Parent.
Typically, when an individual field is overridden for a specific annotation
object, a Child DimensionStyle is made with that field marked as
an overridden field (SetFieldOverride()) and that DimensionStyle is
made the Child of the annotation object's DimensionStyle.
Then the DimensionStyleId of the annotation object is set to the
Id of the Child style
Returns:
True if the field corresponding to field_id is overridden in this AnnotationStyle
False if the field is not overridden

Rhino.DocObjects.DimensionStyle.SetFieldOverride(Rhino.DocObjects.DimensionStyle.Field)
Set a field as overridden
field:

Rhino.DocObjects.DimensionStyle.ClearFieldOverride(Rhino.DocObjects.DimensionStyle.Field)
Set the field as not overridden
field:

Rhino.DocObjects.DimensionStyle.ClearAllFieldOverrides
Sets all the fields in this DimensionStyle to be not overridden
Does not change any dimstyle_id's or parent_id's

Rhino.DocObjects.DimensionStyle.HasFieldOverrides
Checks if any fields in this DimensionStyle are overrides
Returns:
True if any fields are overrides
False is no fields are overrides

Rhino.DocObjects.DimensionStyle.IsChild
Tests if this DimensionStyle is a child of any other DimensionStyle
Returns:
True if this is a child DimensionStyle,
False otherwise.

Rhino.DocObjects.DimensionStyle.IsChildOf(System.Guid)
Tests if this DimensionStyle is a child of a specific DimensionStyle
parentId:
Returns:
True if this is a child of the DimensionStyle with Parent
False otherwise.

Rhino.DocObjects.DimensionStyle.ParentId
Get or Set the Id of this DimensionStyle's parent.
If ParentId is Guid.Empty, this DimensionStyle has no parent