Rhino.Geometry.BrepTrimType
Each brep trim has a defined type.

Rhino.Geometry.BrepTrimType.Seam
trim is connected to an edge, is part of an outer, inner or slit loop,
and one other trim from the same loop is connected to the edge.
(There can be other mated trims that are also connected to the edge.
For example, the non-mainfold edge that results when a surface edge lies
in the middle of another surface.)  Non-mainfold "cuts" have seam trims too.

Rhino.Geometry.BrepTrimType.CurveOnSurface
Trim is connected to an edge, is the only trim in a crfonsrf loop, and
is the only trim connected to the edge.

Rhino.Geometry.BrepTrimType.PointOnSurface
Trim is a point on a surface, trim.m_pbox is records surface parameters,
and is the only trim in a ptonsrf loop.  This trim is not connected to
an edge and has no 2d curve.