Rhino.Render.CachedTextureCoordinates.TryGetAt(System.Int32,System.Double@,System.Double@,System.Double@)
Use this method to iterate the cached texture coordinate array.
index:
Index for the vertex to fetch.
u:
Output parameter which will receive the U value.
v:
Output parameter which will receive the V value.
w:
Output parameter which will receive the W value, this is only
meaningful if Rhino.Render.CachedTextureCoordinates.Dim is 3.
Returns:
Returns true if index is valid; otherwise returns false.

Rhino.Render.CachedTextureCoordinates.Dim
Coordinate dimension: 2 = UV, 3 = UVW

Rhino.Render.CachedTextureCoordinates.MappingId
The texture mapping Id.

Rhino.Render.CachedTextureCoordinates.System#Collections#Generic#ICollection{Rhino#Geometry#Point3d}#Clear
IList implementation, this list is always read-only so calling this
will cause a NotSupportedException to be thrown.

Rhino.Render.CachedTextureCoordinates.Contains(Rhino.Geometry.Point3d)
Determines whether this collection contains a specific value.
item:
Returns:

Rhino.Render.CachedTextureCoordinates.CopyTo(Rhino.Geometry.Point3d[],System.Int32)
Copies the elements of the this collection to an System.Array,
starting at a particular System.Array index.
array:
The one-dimensional System.Array that is the destination of the
elements copied from this collection. The System.Array must have
zero-based indexing.
arrayIndex:
The zero-based index in array at which copying begins.
Throws System.ArgumentNullException:
array is null
Throws System.ArgumentOutOfRangeException:
arrayIndex is less than 0.
Throws System.ArgumentException:
The number of elements in this collection is greater than the available
space from arrayIndex to the end of the destination array.

Rhino.Render.CachedTextureCoordinates.System#Collections#Generic#ICollection{Rhino#Geometry#Point3d}#Remove(Rhino.Geometry.Point3d)
IList implementation, this list is always read-only so calling this
will cause a NotSupportedException to be thrown.

Rhino.Render.CachedTextureCoordinates.Count
Number of cached coordinates.

Rhino.Render.CachedTextureCoordinates.IsReadOnly
This collection is always read-only

Rhino.Render.CachedTextureCoordinates.GetEnumerator
Returns an enumerator that iterates through this collection.
Returns:
A enumerator that can be used to iterate through this collection.

Rhino.Render.CachedTextureCoordinates.System#Collections#IEnumerable#GetEnumerator
Returns an enumerator that iterates through this collection.
Returns:
A enumerator that can be used to iterate through this collection.

Rhino.Render.CachedTextureCoordinates.IndexOf(Rhino.Geometry.Point3d)
Determines the index of a specific point in this collection.
item:
The point (UV or UVW) to locate in this collection.
Returns:
The index of item if found in the list; otherwise, -1.