Rhino.Render.RenderSettings.#ctor(Rhino.Render.RenderSettings)
Initialize new instance of the RenderSettings class.
source: If not null, settings are copied from source

Rhino.Render.RenderSettings.#ctor
Initialize a new instance of the RenderSettings class.

Rhino.Render.RenderSettings.AntialiasLevel
Gets or sets antialias level, used for render quality

Rhino.Render.RenderSettings.ScaleBackgroundToFit
Gets or sets a value indicating whether to scale the wallpaper in the
background or not. This is meaningful only if the viewport has a wallpaper
and render settings are set to render Wallpaper into the background.

Rhino.Render.RenderSettings.ImageUnitSystem
unit system to use when converting image pixel size and dpi information
into a print size.  Default = inches

Rhino.Render.RenderSettings.ImageDpi
Number of dots/inch (dots=pixels) to use when printing and saving
bitmaps. The default is 72.0 dots/inch.

Rhino.Render.RenderSettings.LinearWorkflow
Get the document linear workflow interface

Rhino.Render.RenderSettings.Dithering
Get the document dithering interface