Rhino.Render.ChangeQueue.Skylight.Enabled
Return true if skylight is enabled

Rhino.Render.ChangeQueue.Skylight.UsesCustomEnvironment
Return true if skylight uses custom environment

Rhino.Render.ChangeQueue.Skylight.ShadowIntensity
Get shadow intensity for skylight