Rhino.FileIO.BinaryArchiveReader.EnableCRCCalculation(System.Boolean)
Expert user function to control CRC calculation while reading and writing.
Typically this is used when seeking around and reading/writing information
in non-serial order.
enable:
Returns:
Current state of CRC calculation.  Use the returned value to restore the
CRC calculation setting after you are finished doing your fancy pants
expert IO.

Rhino.FileIO.BinaryArchiveReader.CurrentPosition
current offset (in bytes) into archive ( like ftell() )

Rhino.FileIO.BinaryArchiveReader.BeginRead3dmChunk(System.UInt32,System.Int32@,System.Int32@)
Begins reading a chunk that must be in the archive at this location.
expectedTypeCode:
majorVersion:
minorVersion:
Returns:
True if beginning of the chunk was read.  In this case you must call EndRead3dmChunk(),
even if something goes wrong while you attempt to read the interior of the chunk.
False if the chunk did not exist at the current location in the file.

Rhino.FileIO.BinaryArchiveReader.EndRead3dmChunk(System.Boolean)
Calling this will skip rest of stuff in chunk if it was only partially read.
suppressPartiallyReadChunkWarning:
Generally, a call to ON_WARNING is made when a chunk is partially read.
If suppressPartiallyReadChunkWarning is true, then no warning is issued
for partially read chunks.
Returns:

Rhino.FileIO.BinaryArchiveReader.ReadUtf8String
Reads a System.String from the archive.
Returns: The value that was read.

Rhino.FileIO.BinaryArchiveReader.ReadCompressedBuffer
Reads an array of compressed System.Byte information from the archive and uncompresses it.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.

Rhino.FileIO.BinaryArchiveReader.ReadObjRef
Reads a Rhino.DocObjects.ObjRef from the archive
Returns: the element that was read

Rhino.FileIO.BinaryArchiveReader.ReadObjRefArray
Reads an array of System.Double from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.

Rhino.FileIO.BinaryArchiveReader.ReadRenderSettings
Reads a Rhino.Render.RenderSettings-derived object from the archive.
Returns: The element that was read.

Rhino.FileIO.BinaryArchiveReader.ReadCheckSum
Reads a legacy ON_CheckSum, only provided to read data chunks from old
V5 files, the CheckSum read is discarded

Rhino.FileIO.BinaryArchiveReader.Read3dmStartSection(System.Int32@,System.String@)
version: .3dm file version (2, 3, 4, 5 or 50)
comment:
String with application name, et cetera.  This information is primarily
used when debugging files that contain problems.  McNeel and Associates
stores application name, application version, compile date, and the OS
in use when file was written.
Returns: true on success

Rhino.FileIO.BinaryArchiveReader.Dump3dmChunk(Rhino.FileIO.TextLog)
Fnction for studying contents of a file.  The primary use is as an aid
to help dig through files that have been damaged (bad disks, transmission
errors, etc.) If an error is found, a line that begins with the word
"ERROR" is printed.
log: log where information is printed to
Returns:
0 if something went wrong, otherwise the typecode of the chunk that
was just studied.

Rhino.FileIO.BinaryArchiveReader.AtEnd
true if at end of a file
Returns: