Rhino.Commands.Command.Id
Gets the  unique ID of this command. It is best to use a Guid
attribute for each custom derived command class since this will
keep the id consistent between sessions of Rhino
GuidAttribute