Rhino.Geometry.MeshFace.IsValid(Rhino.Geometry.Point3d[])
Gets a value indicating whether or not this mesh face
is considered to be valid. Unlike the simple IsValid function,
this function takes actual point locations into account.
points: Array of vertices with which to validate the face.
Returns: true if the face is considered valid, false if not.

Rhino.Geometry.MeshFace.Repair(Rhino.Geometry.Point3d[])
Attempts to repair this mesh face by taking both face indexes and
actual vertex locations into account.
points: Array of vertices with which to consider when repairing the face.
Returns: true if the face was repaired, false if not.
Remarks: This function assumes the face is invalid and attempts to repair unconditionally.  It is
only worthwhile to call Repair on faces where IsValid returns false.

Rhino.Geometry.MeshFace.Equals(Rhino.Geometry.MeshFace)
Returns a value indicating whether the other mesh face
has precisely the same value as the current one.
other: The other mesh face for comparison.
Returns: true if the other face is, also orderly, equal
to the present one; otherwise false.

Rhino.Geometry.MeshFace.GetHashCode
Returns a runtime-stable hashcode for the current mesh face.
You are not allowed to rely on persistance of this hashcode in
serialization, but for each version of RhinoCommon, this hashcode
will be the same for each mesh face.
Returns: A non-unique integer that represents this mesh face.

Rhino.Geometry.MeshFace.op_Equality(Rhino.Geometry.MeshFace,Rhino.Geometry.MeshFace)
Determines whether two Rhino.Geometry.MeshFace structures have equal values.
a: The first MeshFace.
b: The second MeshFace.
Returns: true if the indices of the two points are exactly equal; otherwise false.

Rhino.Geometry.MeshFace.op_Inequality(Rhino.Geometry.MeshFace,Rhino.Geometry.MeshFace)
Determines whether two Rhino.Geometry.MeshFace structures have different values.
a: The first MeshFace.
b: The second MeshFace.
Returns: true if the indices of the two points are in any way different; otherwise false.

Rhino.Geometry.MeshFace.CompareTo(Rhino.Geometry.MeshFace)
Compares this Rhino.Geometry.MeshFace with another Rhino.Geometry.MeshFace
and returns a value of 1, 0, or -1, referring to dictionary order.
Index evaluation priority is first A, then B, then C, then D.
other: The other Rhino.Geometry.MeshFace to use in comparison.
Returns:
0: if this is identical to other
-1: if this < other. Priority is for index of corner A first, then B, then C, then D.
+1: otherwise.