Rhino.DocObjects.ObjectEnumeratorSettings.IdefObjects
When true, ONLY Instance Definitions will be returned

Rhino.DocObjects.ObjectEnumeratorSettings.IncludeLights


Rhino.DocObjects.ObjectEnumeratorSettings.IncludeGrips


Rhino.DocObjects.ObjectEnumeratorSettings.ViewportFilter
Filter on value of object->IsActiveInViewport()