Rhino.DocObjects.HistoryRecord.SetHistoryVersion(System.Int32)
Specifies a non-zero integer that identifies the version of
this history record. The virtual ReplayHistory() functions
can check this version to avoid replaying history using
information created by earlier versions of the command.
historyVersion: Any non-zero integer.
It is strongly suggested that something like YYYYMMDD be used.
Returns: True if successful.

Rhino.DocObjects.HistoryRecord.CopyOnReplaceObject
When an object is replaced and the old object has a history record with
this field set, the history record is copied and attached to the new object.
That allows a descendant object to continue the history linkage after
it is edited.