Rhino.Render.MenuTaskOriginFactory
Rdk MenuTaskOriginFactory creates the menu task origin for the UI.
The MenuTaskOriginFactory needs information like Controller, UserControl, ContextEditingContext
in order to create the correct origin.

Rhino.Render.MenuTaskOriginFactory.#ctor
MenuTaskOriginFactory constructor

Rhino.Render.MenuTaskOriginFactory.Finalize
MenuTaskOriginFactory destructor

Rhino.Render.MenuTaskOriginFactory.Dispose
MenuTaskOriginFactory dispose

Rhino.Render.MenuTaskOriginFactory.Dispose(System.Boolean)
MenuTaskOriginFactory dispose

Rhino.Render.MenuTaskOriginFactory.Origin
Returns the menu task origin

Rhino.Render.MenuTaskOriginFactory.NewButtonTaskOrigin(Rhino.Render.RenderContentKind)
Returns the menu task origin for new button

Rhino.Render.MenuTaskOriginFactory.UserControl
Set the RhRdkUserControl

Rhino.Render.MenuTaskOriginFactory.ChildSlotName
Set the ChildSlotName

Rhino.Render.MenuTaskOriginFactory.PreviewAppearance
Set the PreviewAppearance if the usercontrol has one

Rhino.Render.MenuTaskOriginFactory.OnItem
Set OnItem to true to get menutaskorigin for on item clicked and set to false to get menutaskorigin for
none selected item

Rhino.Render.MenuTaskOriginFactory.AllowedKinds
Semicolon delimited string with allowed content kind for menutasks

Rhino.Render.MenuTaskOriginFactory.UuidOrigin
Returns the Guid of the menutask origin
Returns:  Returns the Guid of the menutask origin

Rhino.Render.MenuTaskOriginFactory.SetController(System.IntPtr)
Set the Controller
pController: The control

Rhino.Render.MenuTaskOriginFactory.SetControlController(System.IntPtr)
Set the control of controller
pControl: The control

Rhino.Render.MenuTaskOriginFactory.SetInstanceIdArray(System.IntPtr)
Set the InstanceIdArray: Array of selected items Guids
pInstanceArray: The InstanceIdArray