Rhino.PersistentSettingsHooks.GetPlugInPersistentSettingsPointerFunc(System.Guid,System.UInt32,System.Boolean)
If Create(plugInId) was called then the runtime settings associated
the plug-in are returned otherwise a new PlugInSettings is created
and and its settings are returned.  Creating a new plug-in settings
class is used when reading settings in response to a settings file
saved event.
plugInId:
pointerId:
windowPositions:
Returns:

Rhino.PersistentSettingsHooks.InvokeSetingsSaved(System.Guid,System.Boolean)
Invoke the OnSettingsSaved() call back on the main Rhino UI thread.
plugInId:
thisRhinoIsSaving:

Rhino.PersistentSettingsHooks.g_persistent_settings
Dictionary of PersistentSettings references associated with unmanaged
objects.  Unmanaged object destructors are responsible for calling the
ReleasePlugInSettingsPointerFunc to remove items from this dictionary.
This is used to manage references to child nodes and when reading
settings XML files.

Rhino.PersistentSettingsHooks.g_plug_in_settings_read
Used to manage runtime reading of plug-in settings which will happen
when a settings XML file is modified and a SettingsSaved event is
raised.  Unmanaged object destructors are responsible for calling the
ReleasePlugInSettingsPointerFunc to remove items from this dictionary.