Rhino.DocObjects.TextureType
The TextureType controls how the pixels in the bitmap
are interpreted.

Rhino.DocObjects.TextureType.Bitmap
Standard image texture

Rhino.DocObjects.TextureType.Transparency
value = alpha