Rhino.Geometry.SubD.ConvexCornerOption
Defines how convex corners are treated.

Rhino.Geometry.SubD.ConvexCornerOption.Unset
The option is not set.

Rhino.Geometry.SubD.ConvexCornerOption.None
No convex coners.

Rhino.Geometry.SubD.ConvexCornerOption.AtMeshCorner
A convext subd corner will appear at input mesh/ boundary vertices
where the corner angle <= MaximumConvexCornerAngleRadians() and
the number of edges the end at the vertex is <= MaximumConvexCornerEdgeCount().