Rhino.Geometry.MeshDisplacementInfo.#ctor(Rhino.Render.RenderTexture,Rhino.Render.TextureMapping)
Constructs a displacement information instance with default values.
Users of this class should not rely on default values to stay constant
across service releases.
Throws System.ArgumentNullException: If texture or mapping is null.

Rhino.Geometry.MeshDisplacementInfo.Texture
The texture used as displacement.

Rhino.Geometry.MeshDisplacementInfo.Black
Value considered lowest point in the displacement.

Rhino.Geometry.MeshDisplacementInfo.White
Value considered highest point of the displacement texture.

Rhino.Geometry.MeshDisplacementInfo.Mapping
The texture mapping of the mesh.

Rhino.Geometry.MeshDisplacementInfo.MappingTransform
Texture mapping transform.

Rhino.Geometry.MeshDisplacementInfo.InstanceTransform
Instance transformation of the mesh.

Rhino.Geometry.MeshDisplacementInfo.BlackMove
The amount of displacement for the black color in the texture.

Rhino.Geometry.MeshDisplacementInfo.PostWeldAngle
Specifies the maximum angle between face normals of adjacent faces
that will get welded together.

Rhino.Geometry.MeshDisplacementInfo.RefineSensitivity
Specifies how sensitive the divider for contrasts is on the
displacement texture.
Specify 1 to split all mesh edges on each refine step.
Specify 0.99 to make even slight contrasts on the displacement
texture cause edges to be split.
Specifying 0.01 only splits edges where heavy contrast
exists.

Rhino.Geometry.MeshDisplacementInfo.SweepPitch
Specifies how densely the object is initially subdivided.
The lower the value, the higher the resolution of the displaced mesh.

Rhino.Geometry.MeshDisplacementInfo.WhiteMove
The amount of displacement for the white color in the texture.

Rhino.Geometry.MeshDisplacementInfo.ChannelNumber
Mapping channel number for the displacement mapping.

Rhino.Geometry.MeshDisplacementInfo.FaceLimit
Runs a mesh reduction as a post process o simplify the result of
displacement to meet the specified number of faces.

Rhino.Geometry.MeshDisplacementInfo.FairingAmount
Straightens rough feature edges.
The value specifies the number of passes.

Rhino.Geometry.MeshDisplacementInfo.RefineStepCount
Specifies the number of refinement passes.

Rhino.Geometry.MeshDisplacementInfo.MemoryLimit
Specifies how much memory can be allocated for use by the
displacement mesh. Value in megabytes.