Rhino.Render.ContentUndoHelper.#ctor(Rhino.RhinoDoc,System.String)
Constructs a ContentUndoHelper object inside a using block to handle undo when modifying a RenderContent
or - alternatively - create the ContentUndoHelper and explicitly call Dispose when you are done.
doc:
description: Undo description (which appears in the UI when undo is run)

Rhino.Render.ContentUndoHelper.AddContent(Rhino.Render.RenderContent,Rhino.Render.RenderContent)
Call this *after* adding a content. Undo will cause the content to be deleted.
content: Content you just added to the ContentList.
parent:  is the content that will become the parent of the new content, or null if the new content is being added at the top level (i.e., not a child).
Returns: true if the content was added.

Rhino.Render.ContentUndoHelper.ModifyContent(Rhino.Render.RenderContent)
Call this before modifying or deleting a content. Undo will cause the content to be restored.
content: Content you are about to modify.
Returns: true if the content was modified.

Rhino.Render.ContentUndoHelper.TweakContent(Rhino.Render.RenderContent,System.String)
Call this before tweaking a single content parameter. Undo will cause the parameter to be restored.
content: The render content
parameterName: The parameter name you are about to change.
Returns: true if the content was tweaked.