Rhino.Geometry.TextDot.Text
Gets or sets the primiary text of the textdot.

Rhino.Geometry.TextDot.SecondaryText
Gets or sets the secondary text of the textdot.

Rhino.Geometry.TextDot.FontHeight
Height of font used for displaying the dot

Rhino.Geometry.TextDot.FontFace
Font face used for displaying the dot