Rhino.Runtime.InteropWrappers.SimpleArrayPlane.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayPlane.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayPlane.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayLine instance.

Rhino.Runtime.InteropWrappers.SimpleArrayPlane.Count
Gets the amount of lines in this array.

Rhino.Runtime.InteropWrappers.SimpleArrayPlane.ToArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayPlane.Dispose
Actively reclaims unmanaged resources that this instance uses.