Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer
Wrapper for a C++ ON_SimpleArray<ON_Extrusion*> or ON_SimpleArray<const ON_Extrusion*>
If you are not writing C++ code then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer instance.

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.Count
Gets the amount of Extrusions in this array.

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.Add(Rhino.Geometry.Extrusion,System.Boolean)
Adds a extrusion to the list.
extrusion: A extrusion to add.
asConst: Whether this extrusion should be treated as non-modifiable.

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.