Rhino.NodeInCode.ComponentFunctionInfo.Name
The function name.

Rhino.NodeInCode.ComponentFunctionInfo.Namespace
The function namespace.

Rhino.NodeInCode.ComponentFunctionInfo.IsDefault
Determines if the component is a default one.

Rhino.NodeInCode.ComponentFunctionInfo.Description
The function description.

Rhino.NodeInCode.ComponentFunctionInfo.InputNames
The function input parameter names.

Rhino.NodeInCode.ComponentFunctionInfo.InputDescriptions
The function input parameter descriptions.

Rhino.NodeInCode.ComponentFunctionInfo.InputTypeNames
The function input type names.

Rhino.NodeInCode.ComponentFunctionInfo.InputsOptional
Indications for each function input parameter whether it is optional.

Rhino.NodeInCode.ComponentFunctionInfo.OutputNames
Grasshopper returns several items in general. This property retuns the output names.

Rhino.NodeInCode.ComponentFunctionInfo.OutputDescriptions
Grasshopper returns several items in general. This property retuns the output descriptions.

Rhino.NodeInCode.ComponentFunctionInfo.OutputTypeNames
Grasshopper returns several items in general. This property retuns the output type names.

Rhino.NodeInCode.ComponentFunctionInfo.ComponentGuid
The unique identifier of the Grasshopper component.
It is the original developer's responsability to ensure that this ID is unique.

Rhino.NodeInCode.ComponentFunctionInfo.ToString
Returns a string represetning this function.
Returns: The namespace and the name.

Rhino.NodeInCode.ComponentFunctionInfo.FullName
Returns the name of the component prefixed by, if existing, the namespace.

Rhino.NodeInCode.ComponentFunctionInfo.FullScriptingName
Shows the full name of the component, including optional periods.
Removes spaces and common operator signs.

Rhino.NodeInCode.ComponentFunctionInfo.Evaluate(System.Collections.IEnumerable,System.Boolean,System.String[]@)
Evaluates the component with a particular set of arguments.
args: The arguments list.
keepTree: A value indicating whether tree should be considered valid inputs, and should be returned.
warnings: Used to return a possible list of warnings.
Returns:

Rhino.NodeInCode.ComponentFunctionInfo.SimplifyTreeOutput(System.Object[],System.String[],System.Boolean)
Performs list logical reduction when trees are not used.
input: The computed data.
warnings: A series of warnings.
treatWarningsAsErrors: If warnings should be considered, then this is set to true.
Returns: The simplified object.

Rhino.NodeInCode.ComponentFunctionInfo.EvaluateWithWarningsAsErrors(System.Collections.IEnumerable)
Infrastructure method that simplifies output and performs warning checks.
args: Arguments.
Returns: Items.

Rhino.NodeInCode.ComponentFunctionInfo.EvaluateSilenceWarnings(System.Collections.IEnumerable)
Infrastructure method that simplifies output and performs warning checks.
args: Arguments.
Returns: Items.

Rhino.NodeInCode.ComponentFunctionInfo.EvaluateTreeWithWarningsAsErrors(System.Collections.IEnumerable)
Infrastructure method that simplifies output and performs warning checks.
args: Arguments.
Returns: Items.

Rhino.NodeInCode.ComponentFunctionInfo.EvaluateTreeSilenceWarnings(System.Collections.IEnumerable)
Infrastructure method that simplifies output and performs warning checks.
args: Arguments.
Returns: Items.

Rhino.NodeInCode.ComponentFunctionInfo.Delegate
Returns a delegate that can be directly invoked using a list of arguments.
This flattens trees.

Rhino.NodeInCode.ComponentFunctionInfo.DelegateNoWarnings
Returns a delegate that can be directly invoked using a list of arguments.
This flattens trees.

Rhino.NodeInCode.ComponentFunctionInfo.DelegateTree
Returns a delegate that can be directly invoked using a list of arguments.
This considers trees and simplifies single-output components.

Rhino.NodeInCode.ComponentFunctionInfo.DelegateTreeNoWarnings
Returns a delegate that can be directly invoked using a list of arguments.
This considers trees and simplifies single-output components.