Rhino.DocObjects.ModelComponent.#ctor
Allows constuction from inheriting classes.

Rhino.DocObjects.ModelComponent.DataCRC(System.UInt32)
Increments the Cyclic Redundancy Check value by this instance.
currentRemainder: The current remainder value.
Returns: The updated remainder value.

Rhino.DocObjects.ModelComponent.IsSystemComponent
True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
ON_DimStyle::DefaultMillimeterArchitecture

Rhino.DocObjects.ModelComponent.Id
Gets or sets the ID of the current instance.
Throws System.InvalidOperationException:
When setting the ID failed.
This usually happened because the instance ID is already locked.

Rhino.DocObjects.ModelComponent.ClearId
Resets the HasId property of the model component to false, if possible.
Throws System.InvalidOperationException: If the ID is locked.

Rhino.DocObjects.ModelComponent.HasId
Returns a value indicating whether the component has an ID.

Rhino.DocObjects.ModelComponent.IdIsLocked
Returns a value indicating whether the component ID is already locked.

Rhino.DocObjects.ModelComponent.LockId
Locks the component Id property.

Rhino.DocObjects.ModelComponent.Index
Gets or sets the model component index attribute.
Throws System.InvalidOperationException:
When setting the Index failed.
This usually happend because the instance Index is already locked.

Rhino.DocObjects.ModelComponent.ClearIndex
Resets the HasIndex property of the model component to false, if possible.
Throws System.InvalidOperationException: If the index is locked.

Rhino.DocObjects.ModelComponent.HasIndex
Returns a value indicating whether the component has an Index.

Rhino.DocObjects.ModelComponent.IndexIsLocked
Returns a value indicating whether the component Index is already locked.

Rhino.DocObjects.ModelComponent.LockIndex
Locks the component Index property.

Rhino.DocObjects.ModelComponent.ComponentStatus
Gets or sets the component status of the model component.

Rhino.DocObjects.ModelComponent.IsComponentStatusLocked
The component status itself can be locked. This returns an indication.

Rhino.DocObjects.ModelComponent.Name
Gets or sets the name
Throws System.InvalidOperationException:
When setting the Name failed.
This usually happend because the instance Name is already locked.

Rhino.DocObjects.ModelComponent.ClearName
Resets the HasName property of the model component to false, if possible.
Throws System.InvalidOperationException: If the name is locked.

Rhino.DocObjects.ModelComponent.HasName
Returns a value indicating whether the component has a Name.

Rhino.DocObjects.ModelComponent.NameIsLocked
Returns a value indicating whether the component Name is already locked.

Rhino.DocObjects.ModelComponent.LockName
Locks the component Name property.

Rhino.DocObjects.ModelComponent.ComponentType
Gets the Rhino.DocObjects.ModelComponentType for this object.
Useful in switch statements.

Rhino.DocObjects.ModelComponent.ModelComponentTypeRequiresUniqueName(Rhino.DocObjects.ModelComponentType)
Informs the developer if a particular model component type will require uniqueness within a document.
This is currently true with render materials and model geometry; false otherwise.
type: The type to check.
Returns: true with render materials and model geometry; false otherwise.