Rhino.Geometry.NurbsCurve.CreateFromArc(Rhino.Geometry.Arc)
Gets a rational degree 2 NURBS curve representation
of the arc. Note that the parameterization of NURBS curve
does not match arc's transcendental paramaterization.
arc:
Returns: Curve on success, null on failure.

Rhino.Geometry.NurbsCurve.CreateFromArc(Rhino.Geometry.Arc,System.Int32,System.Int32)
Create a uniform non-ratonal cubic NURBS approximation of an arc.
arc:
degree: >=1
cvCount: cv count >=5
Returns: NURBS curve approximation of an arc on success

Rhino.Geometry.NurbsCurve.CreateFromCircle(Rhino.Geometry.Circle,System.Int32,System.Int32)
Create a uniform non-ratonal cubic NURBS approximation of a circle.
circle:
degree: >=1
cvCount: cv count >=5
Returns: NURBS curve approximation of a circle on success

Rhino.Geometry.NurbsCurve.#ctor(System.Int32,System.Int32)
Constructs a new NURBS curve with a specific degree and control point count.
degree: Degree of curve. Must be equal to or larger than 1 and smaller than or equal to 11.
pointCount: Number of control-points.

Rhino.Geometry.NurbsCurve.#ctor(System.Int32,System.Boolean,System.Int32,System.Int32)
Constructs a new NURBS curve with knot and CV memory allocated.
dimension: >=1.
rational: true to make a rational NURBS.
order: (>= 2) The order=degree+1.
pointCount: (>= order) number of control vertices.

Rhino.Geometry.NurbsCurve.SetEndCondition(System.Boolean,Rhino.Geometry.NurbsCurve.NurbsCurveEndConditionType,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Set end condition of a nurbs curve to point, tangent and curvature.
bSetEnd: true: set end of curve, false: set start of curve
continuity: Position: set strart or end point, Tangency: set point and tangent, Curvature: set point, tangent and curvature
point: point to set
tangent: tangent to set
Returns: true on success, false on failure.

Rhino.Geometry.NurbsCurve.SetEndCondition(System.Boolean,Rhino.Geometry.NurbsCurve.NurbsCurveEndConditionType,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Set end condition of a nurbs curve to point, tangent and curvature.
bSetEnd: true: set end of curve, false: set start of curve
continuity: Position: set strart or end point, Tangency: set point and tangent, Curvature: set point, tangent and curvature
point: point to set
tangent: tangent to set
curvature: curvature to set
Returns: true on success, false on failure.

Rhino.Geometry.NurbsCurve.EpsilonEquals(Rhino.Geometry.NurbsCurve,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:

Rhino.Geometry.NurbsCurve.CreateSpiral(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,System.Double,System.Double,System.Double,System.Double)
Creates a C1 cubic NURBS approximation of a helix or spiral. For a helix,
you may have radius0 == radius1. For a spiral radius0 == radius0 produces
a circle. Zero and negative radii are permissible.
axisStart: Helix's axis starting point or center of spiral.
axisDir: Helix's axis vector or normal to spiral's plane.
radiusPoint:
Point used only to get a vector that is perpedicular to the axis. In
particular, this vector must not be (anti)parallel to the axis vector.
pitch:
The pitch, where a spiral has a pitch = 0, and pitch > 0 is the distance
between the helix's "threads".
turnCount: The number of turns in spiral or helix. Positive
values produce counter-clockwise orientation, negitive values produce
clockwise orientation. Note, for a helix, turnCount * pitch = length of
the helix's axis.
radius0: The starting radius.
radius1: The ending radius.
Returns: NurbsCurve on success, null on failure.

Rhino.Geometry.NurbsCurve.CreateSpiral(Rhino.Geometry.Curve,System.Double,System.Double,Rhino.Geometry.Point3d,System.Double,System.Double,System.Double,System.Double,System.Int32)
Create a C2 non-rational uniform cubic NURBS approximation of a swept helix or spiral.
railCurve: The rail curve.
t0: Starting portion of rail curve's domain to sweep along.
t1: Ending portion of rail curve's domain to sweep along.
radiusPoint:
Point used only to get a vector that is perpedicular to the axis. In
particular, this vector must not be (anti)parallel to the axis vector.
pitch:
The pitch. Positive values produce counter-clockwise orientation,
negative values produce clockwise orientation.
turnCount:
The turn count. If != 0, then the resulting helix will have this many
turns. If = 0, then pitch must be != 0 and the approximate distance
between turns will be set to pitch. Positive values produce counter-clockwise
orientation, negitive values produce clockwise orientation.
radius0:
The starting radius. At least one radii must benonzero. Negative values
are allowed.
radius1:
The ending radius. At least ont radii must be nonzero. Negative values
are allowed.
pointsPerTurn:
Number of points to intepolate per turn. Must be greater than 4.
When in doubt, use 12.
Returns: NurbsCurve on success, null on failure.