Rhino.Geometry.Vector3f.IsZero
Gets a value indicating whether the X, Y, and Z values are all equal to 0.0.

Rhino.Geometry.Vector3f.IsUnitVector
Gets a value indicating whether or not this is a unit vector.
A unit vector has length 1.

Rhino.Geometry.Vector3f.EpsilonEquals(Rhino.Geometry.Vector3f,System.Single)
Check that all values in other are withing epsilon of the values in this
other:
epsilon:
Returns:

Rhino.Geometry.Vector3f.Reverse
Reverses this vector in place (reverses the direction).
If this vector contains RhinoMath.UnsetValue, the
reverse will also be invalid and false will be returned.
Remarks: Similar to Negate, that is only provided for CLR language compliance.
Returns: true on success or false if the vector is invalid.

Rhino.Geometry.Vector3f.op_Addition(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Sums up two vectors.
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the componentwise addition of the two vectors.

Rhino.Geometry.Vector3f.Add(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the componentwise addition of the two vectors.

Rhino.Geometry.Vector3f.op_UnaryNegation(Rhino.Geometry.Vector3f)
Computes the opposite vector.
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.

Rhino.Geometry.Vector3f.op_Subtraction(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Subtracts the second vector from the first one.
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the componentwise difference of vector1 - vector2.

Rhino.Geometry.Vector3f.Subtract(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Subtracts the second vector from the first one.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the componentwise difference of vector1 - vector2.

Rhino.Geometry.Vector3f.Negate(Rhino.Geometry.Vector3f)
Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
Remarks: This is similar to Reverse(), but is static for CLR compliance, and with default name.
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.

Rhino.Geometry.Vector3f.op_Multiply(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Multiplies two Rhino.Geometry.Vector3f together, returning the dot (internal) product of the two.
This is not the cross product.
point1: The first point.
point2: The second point.
Returns: A value that results from the coordinatewise multiplication of point1 and point2.

Rhino.Geometry.Vector3f.Multiply(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Multiplies two Rhino.Geometry.Vector3f together, returning the dot (internal) product of the two.
This is not the cross product.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
point1: The first point.
point2: The second point.
Returns: A value that results from the coordinatewise multiplication of point1 and point2.

Rhino.Geometry.Vector3f.op_Division(Rhino.Geometry.Vector3f,System.Double)
Divides a Rhino.Geometry.Vector3f by a number, having the effect of shrinking it, t times.
vector: A vector.
t: A number.
Returns: A new vector that is componentwise divided by t.

Rhino.Geometry.Vector3f.op_Division(Rhino.Geometry.Vector3f,System.Single)
Divides a Rhino.Geometry.Vector3f by a number, having the effect of shrinking it, t times.
vector: A vector.
t: A number.
Returns: A new vector that is componentwise divided by t.

Rhino.Geometry.Vector3f.Divide(Rhino.Geometry.Vector3f,System.Double)
Divides a Rhino.Geometry.Vector3f by a number, having the effect of shrinking it, t times.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is componentwise divided by t.

Rhino.Geometry.Vector3f.Divide(Rhino.Geometry.Vector3f,System.Single)
Divides a Rhino.Geometry.Vector3f by a number, having the effect of shrinking it, t times.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is componentwise divided by t.