Rhino.DocObjects.Custom.ClassIdAttribute.#ctor(System.String)
Initializes a class id attrbute.
id: String in the form of a Guid.

Rhino.DocObjects.Custom.ClassIdAttribute.Id
Gets the associated style.