Rhino.NodeInCode.NodeInCodeTable.#ctor(System.Collections.Generic.IEnumerable{Rhino.NodeInCode.ComponentFunctionInfo})
Instantiates the table. Users of RhinoCommon do not typically need to call this constructor.
items: Items.

Rhino.NodeInCode.NodeInCodeTable.Count
Returns the amount of items in this table.

Rhino.NodeInCode.NodeInCodeTable.Add(Rhino.NodeInCode.ComponentFunctionInfo)
Adds, or replaces a new instance of component function information.
item:

Rhino.NodeInCode.NodeInCodeTable.TryGetMember(System.Dynamic.GetMemberBinder,System.Object@)
Dynamically binds the table to property-like access via its item names.
binder: The dynamic binder.
result: Returns the result.
Returns:

Rhino.NodeInCode.NodeInCodeTable.GetDynamicMemberNames
Returns all additional names in the table.
Returns:

Rhino.NodeInCode.NodeInCodeTable.TryInvokeMember(System.Dynamic.InvokeMemberBinder,System.Object[],System.Object@)
Dynamically invokes a member of the table.
binder: The binder.
args: The arguments.
result: The result.
Returns: True on success.

Rhino.NodeInCode.NodeInCodeTable.TryGetIndex(System.Dynamic.GetIndexBinder,System.Object[],System.Object@)
Gets the ComponentFunctionInfo at
binder: The binder.
indexes: ONE string index.
result: The bound info.
Returns: