Rhino.Geometry.RevSurface.Curve
Gets the revolute curve.

Rhino.Geometry.RevSurface.Axis
Gets the axis of revolution.

Rhino.Geometry.RevSurface.Angle
Gets the start and end angles of revolution in radians.
The interval angle must be increasing and satisfy
RhinoMath.ZeroTolerance < Angle.Length<= 2.0 * System.Math.PI.