Rhino.FileIO.File3dmViewTable.FindName(System.String)
Finds a ViewInfo given its name.
name: The name of the ViewInfo to be searched.
Returns: An ViewInfo, or null on error.

Rhino.FileIO.File3dmViewTable.IndexOf(Rhino.DocObjects.ViewInfo)
Returns the index of the current ViewInfo.
item: The item to be searched.
Returns: The index of the ViewInfo.

Rhino.FileIO.File3dmViewTable.Delete(System.Int32)
Removes an item.
index: The index of the item to remove.
Returns: True if the item was removed.

Rhino.FileIO.File3dmViewTable.Add(Rhino.DocObjects.ViewInfo)
Adds a
item:

Rhino.FileIO.File3dmViewTable.Clear
Removes all items from the table.

Rhino.FileIO.File3dmViewTable.Contains(Rhino.DocObjects.ViewInfo)
Returns an indication of the presence of a view in the table.
item: The view to check.
Returns: true if the item is in the table; false otherwise.

Rhino.FileIO.File3dmViewTable.CopyTo(Rhino.DocObjects.ViewInfo[],System.Int32)
Copies the content of teh table to an array.
array:
arrayIndex:

Rhino.FileIO.File3dmViewTable.Count
Gets the amount of items in the table.

Rhino.FileIO.File3dmViewTable.Delete(Rhino.DocObjects.ViewInfo)
Deletes an item.
item:
Returns:

Rhino.FileIO.File3dmViewTable.GetEnumerator
Returns an enumerator that yields all views in the table.
Returns: An enumerator.