Rhino.Render.MenuTaskCollection
A collection of RDK Menu tasks

Rhino.Render.MenuTaskCollection.#ctor
MenuTaskCollection constructor

Rhino.Render.MenuTaskCollection.Finalize
MenuTaskCollection destructor

Rhino.Render.MenuTaskCollection.Dispose
MenuTaskCollection dispose

Rhino.Render.MenuTaskCollection.Dispose(System.Boolean)
MenuTaskCollection dispose

Rhino.Render.MenuTaskCollection.Task(System.Int32)
Gets the task at specified index
index: The index of the desired menutask
Returns: Returns the menutask at specified index

Rhino.Render.MenuTaskCollection.Count
The number of menutasks in collection
Returns: Returns the number of menutasks in collection

Rhino.Render.MenuTaskCollection.Find(System.Guid)
Find a specific menutask in the collection
uuid: The task guid to be found
Returns: Returns the task with guid uuid

Rhino.Render.MenuTaskCollection.Build(Rhino.Render.MenuTaskOrigin,System.Boolean)
Constructs the menu task collection. In other words fills the collection with menu task items
tos: The menutask origin.
bOnItem: true if the UI click event was on the item (click on selected item) or false if no item selected
Returns: Return true if menu task collection build was successfull, otherwise false