Rhino.Geometry.Morphs.SporphSpaceMorph.#ctor(Rhino.Geometry.Surface,Rhino.Geometry.Surface)
Constructs a sporph space morph.
surface0: Base surface.
surface1: Target surface.

Rhino.Geometry.Morphs.SporphSpaceMorph.#ctor(Rhino.Geometry.Surface,Rhino.Geometry.Surface,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Constructs a sporph space morph.
surface0: Base surface.
surface1: Target surface.
surface0Param: U,V parameter on surface0 used for orienting.
surface1Param: U,V parameter on surface1 used for orienting.

Rhino.Geometry.Morphs.SporphSpaceMorph.IsValid
Returns true if the space morph definition is valid, false otherwise.

Rhino.Geometry.Morphs.SporphSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point.
point: A point that will be morphed by this object.
Returns: Resulting morphed point.

Rhino.Geometry.Morphs.SporphSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.