Rhino.Display.RhinoViewport.FromId(System.Guid)
Call this method to get the viewport with the specified Id.
id:
Id to search for.
Returns:
Returns a RhinoViewport if the Id is found otherwise null.

Rhino.Display.RhinoViewport.MouseInOutDolly(System.Drawing.Point,System.Drawing.Point)
Moves the camera towards or away from the view maintaing focus on the view.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.

Rhino.Display.RhinoViewport.MouseMagnify(System.Drawing.Point,System.Drawing.Point)
Moves the camera towards or away from the view.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.

Rhino.Display.RhinoViewport.MouseTilt(System.Drawing.Point,System.Drawing.Point)
Tilts the camera view.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.

Rhino.Display.RhinoViewport.MouseAdjustLensLength(System.Drawing.Point,System.Drawing.Point,System.Boolean)
Adjusts the camera lens length.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.
moveTarget: Should this operation move the target?

Rhino.Display.RhinoViewport.MouseDollyZoom(System.Drawing.Point,System.Drawing.Point)
Zooms lens (thus adjusting the field of view) while moving the camera.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.

Rhino.Display.RhinoViewport.MouseLateralDolly(System.Drawing.Point,System.Drawing.Point)
Pans the camera
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.

Rhino.Display.RhinoViewport.ChangeToParallelProjection(System.Boolean)
Use this function to change projections of valid viewports from persective to parallel.
It will make common additional adjustments to the frustum so the resulting views are
similar. The camera location and direction will not be changed.
symmetricFrustum: true if you want the resulting frustum to be symmetric.
Returns:
If the current projection is parallel and bSymmetricFrustum, FrustumIsLeftRightSymmetric()
and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.

Rhino.Display.RhinoViewport.ChangeToPerspectiveProjection(System.Boolean,System.Double)
Use this function to change projections of valid viewports from parallel to perspective.
It will make common additional adjustments to the frustum and camera location so the
resulting views are similar. The camera direction and target point are not be changed.
symmetricFrustum: true if you want the resulting frustum to be symmetric.
lensLength:
(pass 50.0 when in doubt) 35 mm lens length to use when changing from parallel to perspective
projections. If the current projection is perspective or lens_length is <= 0.0, then
this parameter is ignored.
Returns:
If the current projection is perspective and bSymmetricFrustum, FrustumIsLeftRightSymmetric()
and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.

Rhino.Display.RhinoViewport.ChangeToPerspectiveProjection(System.Double,System.Boolean,System.Double)
Use this function to change projections of valid viewports from parallel to perspective.
It will make common additional adjustments to the frustum and camera location so the
resulting views are similar. The camera direction and target point are not be changed.
targetDistance:
If RhinoMath.UnsetValue this parameter is ignored. Otherwise it must be > 0 and indicates
which plane in the current view frustum should be perserved.
symmetricFrustum: true if you want the resulting frustum to be symmetric.
lensLength:
(pass 50.0 when in doubt) 35 mm lens length to use when changing from parallel to perspective
projections. If the current projection is perspective or lens_length is <= 0.0, then
this parameter is ignored.
Returns:
If the current projection is perspective and bSymmetricFrustum, FrustumIsLeftRightSymmetric()
and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.

Rhino.Display.RhinoViewport.ChangeToTwoPointPerspectiveProjection(System.Double)
Use this function to change projections of valid viewports
to a two point perspective.  It will make common additional
adjustments to the frustum and camera location and direction
so the resulting views are similar.
lensLength:
(pass 50.0 when in doubt) 35 mm lens length to use when changing from parallel to perspective
projections. If the current projection is perspective or lens_length is <= 0.0, then
this parameter is ignored.
Returns:
If the current projection is perspective and bSymmetricFrustum, FrustumIsLeftRightSymmetric()
and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.

Rhino.Display.RhinoViewport.ChangeToTwoPointPerspectiveProjection(System.Double,Rhino.Geometry.Vector3d,System.Double)
Use this function to change projections of valid viewports
to a two point perspective.  It will make common additional
adjustments to the frustum and camera location and direction
so the resulting views are similar.
targetDistance:
If RhinoMath.UnsetValue this parameter is ignored. Otherwise it must be > 0 and indicates
which plane in the current view frustum should be perserved.
up:
This direction will be the locked up direction.  Pass
ON_3dVector::ZeroVector if you want to use the world axis
direction that is closest to the current up direction.
Pass CameraY() if you want to preserve the current up direction.
lensLength:
(pass 50.0 when in doubt) 35 mm lens length to use when changing from parallel to perspective
projections. If the current projection is perspective or lens_length is <= 0.0, then
this parameter is ignored.
Returns:
If the current projection is perspective and bSymmetricFrustum, FrustumIsLeftRightSymmetric()
and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.