Rhino.DocObjects.Tables.ObjectTable.Find(System.Guid)
Please use FindId().
objectId: Do not use this method.
Returns: Do not use this method.

Rhino.DocObjects.Tables.ObjectTable.FindId(System.Guid)
Uses the object guid to find a rhino object. Deleted objects cannot be found by id.
The guid is the value that is stored on RhinoObject.Id
In a single document, no two active objects have the same guid. If an object is
replaced with a new object, then the guid  persists. For example, if the _Move command
moves an object, then the moved object inherits it's guid from the starting object.
If the Copy command copies an object, then the copy gets a new guid. This guid persists
through file saving/openning operations. This function will not find grip objects.
id: ID of object to search for.
Returns: Reference to the rhino object with the objectId or null if no such object could be found.

Rhino.DocObjects.Tables.ObjectTable.TryFindPoint(System.Guid,Rhino.Geometry.Point3d@)
Finds the location of a point, if a point exists in the document.
id: ID of point object to search for.
point: The point will be passed here.
Returns: true on success; false if point was not found, id represented another geometry type, or on error.

Rhino.DocObjects.Tables.ObjectTable.FindGeometry(System.Guid)
Same as FindId, but returns the Geometry property directly, if it exists.
id: ID of object to search for.
Returns: Reference to the geometry in the rhino object with the objectId or null if no such object could be found.

Rhino.DocObjects.Tables.ObjectTable.FindByWindowRegion(Rhino.Display.RhinoViewport,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Boolean,Rhino.DocObjects.ObjectType)
Finds objects bounded by a polyline region
viewport: viewport to use for selection
region: list of points that define the
inside: should objects returned be the ones inside of this region (or outside)
filter: filter down list by object type
Returns: An array of RhinoObjects that are inside of this region

Rhino.DocObjects.Tables.ObjectTable.FindByWindowRegion(Rhino.Display.RhinoViewport,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,System.Boolean,Rhino.DocObjects.ObjectType)
Finds objects bounded by a polyline region
viewport: viewport to use for selection
screen1: first screen corner
screen2: second screen corner
inside: should objects returned be the ones inside of this region (or outside)
filter: filter down list by object type
Returns: An array of RhinoObjects that are inside of this region

Rhino.DocObjects.Tables.ObjectTable.FindByCrossingWindowRegion(Rhino.Display.RhinoViewport,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Boolean,Rhino.DocObjects.ObjectType)
Finds objects bounded by a polyline region
viewport: viewport to use for selection
region: list of points that define the
inside: should objects returned be the ones inside of this region (or outside)
filter: filter down list by object type
Returns: An array of RhinoObjects that are inside of this region

Rhino.DocObjects.Tables.ObjectTable.FindByCrossingWindowRegion(Rhino.Display.RhinoViewport,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,System.Boolean,Rhino.DocObjects.ObjectType)
Finds objects bounded by a region
viewport: viewport to use for selection
screen1: first screen corner
screen2: second screen corner
inside: should objects returned be the ones inside of this region (or outside)
filter: filter down list by object type
Returns: An array of RhinoObjects that are inside of this region

Rhino.DocObjects.Tables.ObjectTable.Add(Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds geometry that is not further specified.
This is meant, for example, to handle addition of sets of different geometrical entities.
geometry: The base geometry. This cannot be null.
attributes: The object attributes. This can be null.
history: The history information that will be saved.
reference: If reference is true, object will not be saved in the 3dm file.
Returns: The new object ID on success.
Throws System.ArgumentNullException: If geometry is null.

Rhino.DocObjects.Tables.ObjectTable.HistoryRecordCount
Returns the amount of history records in this document.

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a point object and its geometry-linked information to the document
point: A point geometry class.
attributes: attributes to apply to point. null is acceptible
history: history associated with this point. null is acceptable
reference:
true if the object is from a reference file.  Reference objects do
not persist in archives
Returns: A unique identifier for the object.
Throws System.ArgumentNullException: If point is null.

Rhino.DocObjects.Tables.ObjectTable.AddRadialDimension(Rhino.Geometry.RadialDimension)


Rhino.DocObjects.Tables.ObjectTable.AddRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a radial dimension object to the document.
dimension: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddRectangle(Rhino.Geometry.Rectangle3d)
Adds a rectangle to the object table.
rectangle: The rectangle.
Returns: The ID.

Rhino.DocObjects.Tables.ObjectTable.AddRectangle(Rhino.Geometry.Rectangle3d,Rhino.DocObjects.ObjectAttributes)
Adds a rectangle to the object table.
rectangle: The rectangle.
attributes: Attributes that will be linked with the surface object.
Returns: The ID.

Rhino.DocObjects.Tables.ObjectTable.AddRectangle(Rhino.Geometry.Rectangle3d,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a rectangle to the object table.
rectangle: The rectangle.
attributes: Attributes that will be linked with the surface object.
history: History data records.
reference: If a reference, object will not be saved in the document.
Returns: The ID.

Rhino.DocObjects.Tables.ObjectTable.AddBox(Rhino.Geometry.Box)
Adds a box to the object table.
box: The box.
Returns: The ID.

Rhino.DocObjects.Tables.ObjectTable.AddBox(Rhino.Geometry.Box,Rhino.DocObjects.ObjectAttributes)
Adds a box to the object table.
box: The box.
attributes: Attributes that will be linked with the surface object.
Returns: The ID.

Rhino.DocObjects.Tables.ObjectTable.AddBox(Rhino.Geometry.Box,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a box to the object table, as an extrusion.
box: The box.
attributes: Attributes that will be linked with the surface object.
history: History data records.
reference: If a reference, object will not be saved in the document.
Returns: The ID.

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(System.String,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a text dot object to Rhino.
text: A text string.
location: A point position.
attributes: Attributes to apply to curve.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(Rhino.Geometry.TextDot,Rhino.DocObjects.ObjectAttributes)
Adds a text dot object to Rhino.
dot: A text dot that will be copied.
attributes: Attributes to apply to text dot.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Geometry.TextEntity)
Adds a v6_TextObject to the document.
text:  Text object to add.
Returns:  The Id of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Geometry.TextEntity,Rhino.DocObjects.ObjectAttributes)
Adds a text object to the document.
text: Text object to add.
attributes:
Returns: The Id of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Geometry.TextEntity,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a text object to the document.
text: Text object to add.
attributes:
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Id of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddLeader(Rhino.Geometry.Leader)
Adds a Leader object to the document.
leader: The leader object.
Returns: The Id of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddLeader(Rhino.Geometry.Leader,Rhino.DocObjects.ObjectAttributes)
Addsa Leader object to the document.
leader: The leader object.
attributes: Attributes to apply to rich text.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddLeader(Rhino.Geometry.Leader,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a Leader object to the document.
leader: The leader object.
attributes: Attributes to apply to rich text.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension)
Adds a linear dimension object to the document.
dimension:
Dimension object to add.
Returns:
The Id of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension,Rhino.DocObjects.ObjectAttributes)
Adds a linear dimension object to the document.
dimension: Dimension object to add.
attributes:
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a linear dimension object to the document.
dimension: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddAngularDimension(Rhino.Geometry.AngularDimension)
Adds a angular dimension object to the document.
dimension:
Dimension object to add.
Returns:
The Id of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddAngularDimension(Rhino.Geometry.AngularDimension,Rhino.DocObjects.ObjectAttributes)
Adds a angular dimension object to the document.
dimension: Dimension object to add.
attributes:
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddAngularDimension(Rhino.Geometry.AngularDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds an angular dimension object to the document.
dimension: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddOrdinateDimension(Rhino.Geometry.OrdinateDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds an ordinate dimension object to the document.
dimordinate: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddCentermark(Rhino.Geometry.Centermark,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds an ordinate dimension object to the document.
centermark: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddSubD(Rhino.Geometry.SubD)
Adds a SubD object to Rhino.
subD: A duplicate of this SubD is added to Rhino.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddSubD(Rhino.Geometry.SubD,Rhino.DocObjects.ObjectAttributes)
Adds a SubD object to Rhino.
subD: A duplicate of this SubD is added to Rhino.
attributes: Attributes that will be linked with the surface object.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddSubD(Rhino.Geometry.SubD,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a SubD object to Rhino.
subD: A duplicate of this SubD is added to Rhino.
attributes: Attributes that will be linked with the surface object.
history: History data records.
reference: If a reference, object will not be saved in the document.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddExtrusion(Rhino.Geometry.Extrusion)
Adds an extrusion object to Rhino.
extrusion: A duplicate of this extrusion is added to Rhino.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes)
Adds an extrusion object to Rhino.
extrusion: A duplicate of this extrusion is added to Rhino.
attributes: Attributes that will be linked with the extrusion object.
Returns: A unique identifier for the object.

Rhino.DocObjects.Tables.ObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform)
instanceDefinitionIndex:
instanceXform:
Returns:

Rhino.DocObjects.Tables.ObjectTable.AddLeader(Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d})


Rhino.DocObjects.Tables.ObjectTable.AddPictureFrame(Rhino.Geometry.Plane,System.String,System.Boolean,System.Double,System.Double,System.Boolean,System.Boolean)
Creates a PictureFrame object from a plane and a path to an image file,
Note, a PictureFrame object is just a Plane surface or mesh that has a
material with a texture assigned to it that displays in all display
modes.
plane:
Plane in which the PictureFrame will be created.  Bottom left corner of
picture will be at plane's origin, width will be in the plane's x axis
direction, height will be in the plane's y axis direction.
texturePath: path to an image file
asMesh:
If true, the function will make a MeshObject rather than a surface
width:
Width of the resulting PictureFrame. If 0.0, the width of the pictureframe
is the width of the image if height is also 0.0 or calculated from the
height and aspect ratio of the image if height is not 0.0.
height:
Height of the resulting PictureFrame. If 0.0, the height of the pictureframe
is the height of the image if width is also 0.0 or calculated from the width
and aspect ratio of the image if width is not 0.0.
selfIllumination:
If true, the image mapped to the picture frame plane always displays at full
intensity and is not affected by light or shadow.
embedBitmap:
If true, the funtion adds the the image to the bitmaptable of the document
to which the PictureFrame will be added
Returns: A unique identifier for the object

Rhino.DocObjects.Tables.ObjectTable.Delete(Rhino.DocObjects.ObjRef,System.Boolean,System.Boolean)
Deletes objref.Object(). The deletion can be undone by calling UndeleteObject().
objref: objref.Object() will be deleted.
quiet: If false, a message box will appear when an object cannot be deleted.
ignoreModes:
If true, locked and hidden objects are deleted.  If false objects that
are locked, hidden, or on locked or hidden layers are not deleted.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Delete(Rhino.DocObjects.RhinoObject,System.Boolean,System.Boolean)
Deletes object from document. The deletion can be undone by calling UndeleteObject().
obj: The object to delete.
quiet: If false, a message box will appear when an object cannot be deleted.
ignoreModes:
If true, locked and hidden objects are deleted.  If false objects that
are locked, hidden, or on locked or hidden layers are not deleted.
Returns: true on success, false on failure.

Rhino.DocObjects.Tables.ObjectTable.Delete(Rhino.DocObjects.RhinoObject)
Deletes an object, taking into account modes and not showing error message boxes.
item: The object to delete.
Returns: True on success.

Rhino.DocObjects.Tables.ObjectTable.ModifyRenderMaterial(Rhino.DocObjects.RhinoObject,Rhino.Render.RenderMaterial)
Modifies an object's render material assignment, this will set the
objects material source to ObjectMaterialSource.MaterialFromObject.
obj: Object to modify.
material:
Material to assign to this object.
Returns:
Returns true on success otherwise returns false.

Rhino.DocObjects.Tables.ObjectTable.ModifyRenderMaterial(Rhino.DocObjects.ObjRef,Rhino.Render.RenderMaterial)
Modifies an object's render material assignment, this will set the
objects material source to ObjectMaterialSource.MaterialFromObject.
objRef: Object to modify.
material:
Material to assign to this object.
Returns:
Returns true on success otherwise returns false.

Rhino.DocObjects.Tables.ObjectTable.ModifyRenderMaterial(System.Guid,Rhino.Render.RenderMaterial)
Modifies an object's render material assignment, this will set the
objects material source to ObjectMaterialSource.MaterialFromObject.
objectId: Id of object to modify.
material:
Material to assign to this object.
Returns:
Returns true on success otherwise returns false.

Rhino.DocObjects.Tables.ObjectTable.ModifyTextureMapping(Rhino.DocObjects.ObjRef,System.Int32,Rhino.Render.TextureMapping)
objRef:
channel:
mapping:
Returns:

Rhino.DocObjects.Tables.ObjectTable.ModifyTextureMapping(System.Guid,System.Int32,Rhino.Render.TextureMapping)
objId:
channel:
mapping:
Returns:

Rhino.DocObjects.Tables.ObjectTable.ModifyTextureMapping(Rhino.DocObjects.RhinoObject,System.Int32,Rhino.Render.TextureMapping)
obj:
channel:
mapping:
Returns:

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Point)
Replaces one object with new point object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
point: new point to be added.  The point is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Point)
Replaces one object with new point object.
objectId: Id of object to be replaced.
point: new point to be added.  The point is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.TextEntity)
Replaces one object with new text object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
text: new text to be added.  The text is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.TextEntity)
Replaces one object with new text object.
objectId: Id of object to be replaced.
text: new text to be added.  The text is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Leader)
Replaces one object with new text object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
leader: new leader to be added.  The leader is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Leader)
Replaces one object with new text object.
objectId: Id of object to be replaced.
leader: new leader to be added.  The leader is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Extrusion)
Replaces one object with new extrusion object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
extrusion: New extrusion to be added. A duplicate of the extrusion is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Extrusion)
Replaces one object with new extrusion object.
objectId: Id of object to be replaced.
extrusion: New extrusion to be added. A duplicate of the extrusion is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.SubD)
Replaces one object with a new SubD object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
subD:
new SubD to be added
A duplicate of the SubD is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.SubD)
Replaces one object with new subd object.
objectId: Id of object to be replaced.
subD:
new mesh to be added
A duplicate of the mesh is added to the Rhino model.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.PickObjects(Rhino.Input.Custom.PickContext)
Pick one or more objects based on a given pick context
pickContext: settings used to define what is picked
Returns: zero or more objects

Rhino.DocObjects.Tables.ObjectTable.GetObjectList(System.Type)
