Rhino.Geometry.HiddenLineDrawingSegment.SideFill
When a silhouette is projected on the image plane (determined by the camera location or direction),
and projects to a curve (not a point), the image area to the left or right of a projected silhouette
curve is filled with either the surface or a void.