Rhino.PrivateMeshCommands.MeshTypes.CreaseEdges
Defines the way naked edges are handled.

Rhino.PrivateMeshCommands.MeshTypes.CreaseEdges.NakedFixed
Naked edges will not move or be modified.

Rhino.PrivateMeshCommands.MeshTypes.CreaseEdges.NakedSmooth
The naked edge will tend toward a spline.

Rhino.PrivateMeshCommands.MeshTypes.CreaseEdges.CornerFixedOtherCreased
Corners (2-sided vertices) will be fixed, while other naked vertices will tend toward a spline.

Rhino.PrivateMeshCommands.MeshTypes.CreaseEdges.Auto
Unwelded vertices become creases, and welded are smooth.