Rhino.Geometry.SubD.InteriorCreaseOption
Defines how interior creases are treated.

Rhino.Geometry.SubD.InteriorCreaseOption.Unset
The interior creases option is not defined.

Rhino.Geometry.SubD.InteriorCreaseOption.None
No interior creases.

Rhino.Geometry.SubD.InteriorCreaseOption.AtMeshCrease
An interior subd crease will appear along coincident
mesh edges where the angle between coindident vertex
normals >= MinimumCreaseAngleRadians().

Rhino.Geometry.SubD.InteriorCreaseOption.AtMeshEdge
An interior subd crease will appear all coincident mesh edges.
Input mesh vertex normals are ignored.