Rhino.Geometry.Collections.SubDFaceAccess
Provides access to the face and face-related functionality of a SubD.

Rhino.Geometry.Collections.SubDFaceAccess.Count
Gets or sets the number of SubD faces.

Rhino.Geometry.Collections.SubDFaceAccess.Add(Rhino.Geometry.SubDEdgePtr[],System.Boolean[])
Adds a new edge to the end of the SubDEdgePtr list.
edges: An array of edges
directions: The direction each of these edges has, ralated to the face.
True means that the edge is reversed compared to the counter-clockwise order of the face.
This argument can be null. In this case, no edge is considered reversed.
Throws System.ArgumentOutOfRangeException: If tag is unset or non-defined.