Rhino.Display.ColorConverter.RGB_To_HSV(System.Int32,System.Int32,System.Int32,System.Double@,System.Double@,System.Double@)
Converts RGB space colors to HSV.
r: Red channel (0~255)
g: Green channel (0~255)
b: Blue channel (0~255)
h: Hue channel (0.0~1.0)
s: Saturation channel (0.0~1.0)
v: Value (Brightness) channel (0.0~1.0)

Rhino.Display.ColorConverter.HSV_To_RGB(System.Double,System.Double,System.Double,System.Byte@,System.Byte@,System.Byte@)
Converts HSV space colors to RGB.
h: Hue channel (0.0~1.0)
s: Saturation channel (0.0~1.0)
v: Value (Brightness) channel (0.0~1.0)
r: Red channel (0~255)
g: Green channel (0~255)
b: Blue channel (0~255)