Rhino.Geometry.Silhouette.Compute(Rhino.Geometry.GeometryBase,Rhino.Geometry.SilhouetteType,Rhino.Geometry.Point3d,System.Double,System.Double)
Compute silhouettes of a shape for a perspective projection.
geometry: Geometry whose silhouettes need to be computed. Can be Brep, BrepFace, Mesh, or Extrusion.
silhouetteType: Types of silhouette to compute.
perspectiveCameraLocation: Location of perspective camera.
tolerance: Tolerance to use for determining projecting relationships.
Surfaces and curves that are closer than tolerance, may be treated as projecting.
When in doubt use RhinoDoc.ModelAbsoluteTolerance.
angleToleranceRadians: Angular tolerance to use for determining projecting relationships.
A surface normal N that satisfies N o cameraDirection < Sin(angleToleranceRadians) may be considered projecting.
When in doubt use RhinoDoc.ModelAngleToleranceRadians.
Returns: Array of silhouette curves.

Rhino.Geometry.Silhouette.Compute(Rhino.Geometry.GeometryBase,Rhino.Geometry.SilhouetteType,Rhino.Geometry.Point3d,System.Double,System.Double,System.Collections.Generic.IEnumerable{Rhino.Geometry.Plane},System.Threading.CancellationToken)
Compute silhouettes of a shape for a perspective projection.
geometry: Geometry whose silhouettes need to be computed. Can be Brep, BrepFace, Mesh, or Extrusion.
silhouetteType: Types of silhouette to compute.
perspectiveCameraLocation: Location of perspective camera.
tolerance: Tolerance to use for determining projecting relationships.
Surfaces and curves that are closer than tolerance, may be treated as projecting.
When in doubt use RhinoDoc.ModelAbsoluteTolerance.
angleToleranceRadians: Angular tolerance to use for determining projecting relationships.
A surface normal N that satisfies N o cameraDirection < Sin(angleToleranceRadians) may be considered projecting.
When in doubt use RhinoDoc.ModelAngleToleranceRadians.
clippingPlanes: Optional collection of clipping planes.
cancelToken: Computation cancellation token.
Returns: Array of silhouette curves.

Rhino.Geometry.Silhouette.Compute(Rhino.Geometry.GeometryBase,Rhino.Geometry.SilhouetteType,Rhino.Geometry.Vector3d,System.Double,System.Double)
Compute silhouettes of a shape for a parallel projection.
geometry: Geometry whose silhouettes need to be computed. Can be Brep, BrepFace, Mesh, or Extrusion.
silhouetteType: Types of silhouette to compute.
parallelCameraDirection: Direction of parallel camera.
tolerance: Tolerance to use for determining projecting relationships.
Surfaces and curves that are closer than tolerance, may be treated as projecting.
When in doubt use RhinoDoc.ModelAbsoluteTolerance.
angleToleranceRadians: Angular tolerance to use for determining projecting relationships.
A surface normal N that satisfies N o cameraDirection < Sin(angleToleranceRadians) may be considered projecting.
When in doubt use RhinoDoc.ModelAngleToleranceRadians.
Returns: Array of silhouette curves.

Rhino.Geometry.Silhouette.Compute(Rhino.Geometry.GeometryBase,Rhino.Geometry.SilhouetteType,Rhino.Geometry.Vector3d,System.Double,System.Double,System.Collections.Generic.IEnumerable{Rhino.Geometry.Plane},System.Threading.CancellationToken)
Compute silhouettes of a shape for a parallel projection.
geometry: Geometry whose silhouettes need to be computed. Can be Brep, BrepFace, Mesh, or Extrusion.
silhouetteType: Types of silhouette to compute.
parallelCameraDirection: Direction of parallel camera.
tolerance: Tolerance to use for determining projecting relationships.
Surfaces and curves that are closer than tolerance, may be treated as projecting.
When in doubt use RhinoDoc.ModelAbsoluteTolerance.
angleToleranceRadians: Angular tolerance to use for determining projecting relationships.
A surface normal N that satisfies N o cameraDirection < Sin(angleToleranceRadians) may be considered projecting.
When in doubt use RhinoDoc.ModelAngleToleranceRadians.
clippingPlanes: Optional collection of clipping planes.
cancelToken: Computation cancellation token.
Returns: Array of silhouette curves.

Rhino.Geometry.Silhouette.Compute(Rhino.Geometry.GeometryBase,Rhino.Geometry.SilhouetteType,Rhino.DocObjects.ViewportInfo,System.Double,System.Double)
Compute silhouettes of a shape for a specified projection.
geometry: Geometry whose silhouettes need to be computed. Can be Brep, BrepFace, Mesh, or Extrusion.
silhouetteType: Types of silhouette to compute.
viewport: Projection.
tolerance: Tolerance to use for determining projecting relationships.
Surfaces and curves that are closer than tolerance, may be treated as projecting.
When in doubt use RhinoDoc.ModelAbsoluteTolerance.
angleToleranceRadians: Angular tolerance to use for determining projecting relationships.
A surface normal N that satisfies N o cameraDirection < Sin(angleToleranceRadians) may be considered projecting.
When in doubt use RhinoDoc.ModelAngleToleranceRadians.
Returns: Array of silhouette curves.

Rhino.Geometry.Silhouette.Compute(Rhino.Geometry.GeometryBase,Rhino.Geometry.SilhouetteType,Rhino.DocObjects.ViewportInfo,System.Double,System.Double,System.Collections.Generic.IEnumerable{Rhino.Geometry.Plane},System.Threading.CancellationToken)
Compute silhouettes of a shape for a specified projection.
geometry: Geometry whose silhouettes need to be computed. Can be Brep, BrepFace, Mesh, or Extrusion.
silhouetteType: Types of silhouette to compute.
viewport: Projection.
tolerance: Tolerance to use for determining projecting relationships.
Surfaces and curves that are closer than tolerance, may be treated as projecting.
When in doubt use RhinoDoc.ModelAbsoluteTolerance.
angleToleranceRadians: Angular tolerance to use for determining projecting relationships.
A surface normal N that satisfies N o cameraDirection < Sin(angleToleranceRadians) may be considered projecting.
When in doubt use RhinoDoc.ModelAngleToleranceRadians.
clippingPlanes: Optional collection of clipping planes.
cancelToken: Computation cancellation token.
Returns: Array of silhouette curves.

Rhino.Geometry.Silhouette.SilhouetteType
Gets the type of this silhouette curve.

Rhino.Geometry.Silhouette.GeometryComponentIndex
Gets the component index corresponding with this silhouette curve.
This field is only set when the entire silhouette curve is part of some geometry component.

Rhino.Geometry.Silhouette.Curve
3D curve representing the shape of the silhouette.