Rhino.DocObjects.ViewInfo.#ctor(Rhino.Display.RhinoViewport)
Access to the ViewInfo for given RhinoViewport
rhinoViewPort:

Rhino.DocObjects.ViewInfo.#ctor(System.UInt32)
Construct the ViewInfo for active viewport of given doc.
docRuntimeSerialNumber: Runtime serial number of the
document to query for the active viewport

Rhino.DocObjects.ViewInfo.WallpaperFilename
Get filename for wallpaper set to this view, if any.

Rhino.DocObjects.ViewInfo.ShowWallpaperInGrayScale
True if wallpaper (if any) is to be shown in gray scale in this view.

Rhino.DocObjects.ViewInfo.WallpaperHidden
True if wallpaper (if any) is to be hidden from this view.

Rhino.DocObjects.ViewInfo.FocalBlurDistance
Gets or sets the Focal blur distance of the active viewport

Rhino.DocObjects.ViewInfo.FocalBlurAperture
Gets or sets the Focal blur aperture of the active viewport

Rhino.DocObjects.ViewInfo.FocalBlurJitter
Gets or sets the Focal blur jitter of the active viewport

Rhino.DocObjects.ViewInfo.FocalBlurSampleCount
Gets or sets the Focal blur sample count of the active viewport

Rhino.DocObjects.ViewInfo.FocalBlurMode
Gets or sets the Focal blur mode of the active viewport