Rhino.UI.Gumball.GumballDisplayConduit.PreTransform
The pre-transform is a transformation that needs to be applied before
the gumball transformation.

Rhino.UI.Gumball.GumballDisplayConduit.GumballTransform
The gumball transformation is the transformation calculated by comparing
the current gumball to the starting BaseGumball.

Rhino.UI.Gumball.GumballDisplayConduit.TotalTransform
The total transformation is GumballTransform * PreTransform.

Rhino.UI.Gumball.GumballDisplayConduit.BaseGumball
Starting location.

Rhino.UI.Gumball.GumballDisplayConduit.SetBaseGumball(Rhino.UI.Gumball.GumballObject)
Contents of the gumball are copied to the base gumball of this class.
gumball: The gumball source.

Rhino.UI.Gumball.GumballDisplayConduit.SetBaseGumball(Rhino.UI.Gumball.GumballObject,Rhino.UI.Gumball.GumballAppearanceSettings)
Contents of the gumball are copied to the base gumball of this class.
gumball: The gumball source.
appearanceSettings: The gumball appearance and behavior settings.

Rhino.UI.Gumball.GumballDisplayConduit.PickResult
The inital mouse down event sets PickResult.