Rhino.Geometry.Point4d.#ctor(Rhino.Geometry.Point4d)
Initializes a new point by copying coordinates from another point.
point: A point.

Rhino.Geometry.Point4d.EpsilonEquals(Rhino.Geometry.Point4d,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:

Rhino.Geometry.Point4d.Transform(Rhino.Geometry.Transform)
Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
xform: Transformation to apply.