Rhino.RhinoApp.CommandLineTextWriter.Encoding
Returns Encoding Unicode.

Rhino.RhinoApp.CommandLineTextWriter.Write(System.String)
Writes a string to the command line.

Rhino.RhinoApp.CommandLineTextWriter.Write(System.Char)
Writes a char to the command line.

Rhino.RhinoApp.CommandLineTextWriter.Write(System.Char[],System.Int32,System.Int32)
Writes a char buffer to the command line.

Rhino.RhinoApp.CommandLineTextWriter.write(System.String)
Provided to give a simple way to IronPython to call this class.
str: The text.