Rhino.UI.MouseCallback.OnMouseMove(Rhino.UI.MouseCallbackEventArgs)
Called at the beginning of handling of a mouse move event in Rhino.
If you don't want the default Rhino functionality to be run, then set
Cancel to true on the passed in event args.
Base class implementation of this function does nothing.
e:

Rhino.UI.MouseCallback.OnEndMouseMove(Rhino.UI.MouseCallbackEventArgs)
Called at the end of handling of a mouse move event in Rhino.
All of the default Rhino mouse move functionality has already been
executed unless a MouseCallback has set Cancel to true for the event args.
You can tell if this is the case by inpecting the Cancel property in
the event args parameter.
Base class implementation of this function does nothing.
e:

Rhino.UI.MouseCallback.OnMouseDown(Rhino.UI.MouseCallbackEventArgs)
Called at the beginning of handling of a mouse down event in Rhino.
If you don't want the default Rhino functionality to be run, then set
Cancel to true on the passed in event args
Base class implementation of this function does nothing
e:

Rhino.UI.MouseCallback.OnEndMouseDown(Rhino.UI.MouseCallbackEventArgs)
Called at the end of handling of a mouse down event in Rhino.
All of the default Rhino mouse down functionality has already been
executed unless a MouseCallback has set Cancel to true for the event args.
You can tell if this is the case by inpecting the Cancel property in
the event args parameter.
Base class implementation of this function does nothing
e:

Rhino.UI.MouseCallback.OnMouseUp(Rhino.UI.MouseCallbackEventArgs)
Called at the beginning of handling of a mouse up event in Rhino.
If you don't want the default Rhino functionality to be run, then set
Cancel to true on the passed in event args
Base class implementation of this function does nothing
e:

Rhino.UI.MouseCallback.OnEndMouseUp(Rhino.UI.MouseCallbackEventArgs)
Called at the end of handling of a mouse up event in Rhino.
All of the default Rhino mouse down functionality has already been
executed unless a MouseCallback has set Cancel to true for the event args.
You can tell if this is the case by inpecting the Cancel property in
the event args parameter.
Base class implementation of this function does nothing
e: