Rhino.Geometry.SweepOneRail.GlobalShapeBlending
If true, the sweep is linearly blended from one end to the other,
creating sweeps that taper from one cross-section curve to the other.
If false, the sweep stays constant at the ends and changes more
rapidly in the middle.