Rhino.Render.ChangeQueue.MeshInstance.ReceiveShadows
Return true if mesh instance should receive shadows

Rhino.Render.ChangeQueue.MeshInstance.CastShadows
Return true if mesh instance should cast shadows

Rhino.Render.ChangeQueue.MeshInstance.InstanceId
Get the instance identifier for this mesh instance.

Rhino.Render.ChangeQueue.MeshInstance.MeshId
Get the mesh identifier for this mesh instance.

Rhino.Render.ChangeQueue.MeshInstance.GroupId
Get identifier that specifies the grouping of these mesh instances - usually based on the object that this originally comprised.

Rhino.Render.ChangeQueue.MeshInstance.MeshIndex
Get the mesh index for this mesh instance.

Rhino.Render.ChangeQueue.MeshInstance.MaterialId
The Material CRC / RenderHash

Rhino.Render.ChangeQueue.MeshInstance.RenderMaterial
RenderMaterial associated with mesh instance

Rhino.Render.ChangeQueue.MeshInstance.Transform
Transform for the MeshInstance