Rhino.Render.RenderContentSerializer
Used to import and export custom render content types such as
materials, environments and textures.  You must override
RenderPlugIn.RenderContentSerializers() and return an array of
derived RenderContentSerializer class types to add to the content
browsers.

Rhino.Render.RenderContentSerializer.#ctor(System.String,Rhino.Render.RenderContentKind,System.Boolean,System.Boolean)
Protected constructor to be called from derived class
fileExtension:
File extension associated with this serialize object
contentKind:
Type of content created when importing or exporting this file type.
canRead:
If true then the file type can be imported and will be included in the
file open box when importing the specified render content type.
canWrite:
If true then the file type can be exported and will be included in the
file save box when exporting the specified render content type.

Rhino.Render.RenderContentSerializer.RegisterSerializer(System.Guid)
Register the RenderContentSerializer
id:
Plug-in id
True if registered successful and false if unsuccessful

Rhino.Render.RenderContentSerializer.FileExtension
File extension associated with this serialize object

Rhino.Render.RenderContentSerializer.ContentType
Type of content created when importing or exporting this file type.

Rhino.Render.RenderContentSerializer.CanRead
If true then the file type can be imported and will be included in the
file open box when importing the specified render content type.

Rhino.Render.RenderContentSerializer.CanWrite
If true then the file type can be exported and will be included in the
file save box when exporting the specified render content type.

Rhino.Render.RenderContentSerializer.Read(System.String)
Called to when importing a file, file should be parsed and converted to
a valid RenderContent object.
pathToFile:
Full path of the file to load.
Returns:
Returns a valid RenderContent object such as RenderMaterial if the file
was successfully parsed otherwise returns null.

Rhino.Render.RenderContentSerializer.Write(System.String,Rhino.Render.RenderContent,Rhino.Render.CreatePreviewEventArgs)
Called to save a custom RenderContent object as an external file.
pathToFile:
Full path of file to write
renderContent:
Render content to save
previewArgs:
Parameters used to generate a preview image which may be embedded in
the exported file.
Returns:

Rhino.Render.RenderContentSerializer.EnglishDescription
English string describing this plug-in

Rhino.Render.RenderContentSerializer.LocalDescription
Localized plug-in description