Rhino.Render.Utilities.SetDefaultRenderPlugIn(System.Guid)
Set default render application
pluginId: ID of render plug-in
Returns:
True if plug-in found and loaded successfully.  False if pluginId is
invalid or was unable to load plug-in

Rhino.Render.Utilities.DefaultRenderPlugInId
Get the plug-in Id for the default render plug-in

Rhino.Render.Utilities.ShowIncompatibleMaterials
Specifies whether incompatible content should be shown in the corresponding editor.

Rhino.Render.Utilities.ShowIncompatibleEnvironments
Specifies whether incompatible content should be shown in the corresponding editor.

Rhino.Render.Utilities.ShowIncompatibleTextures
Specifies whether incompatible content should be shown in the corresponding editor.

Rhino.Render.Utilities.SafeFrameEnabled(Rhino.RhinoDoc)
Queries whether or not the Safe Frame is visible.

Rhino.Render.Utilities.ChangeContentType(Rhino.Render.RenderContent,System.Guid,System.Boolean)
Changes the type of a content. This deletes the content and creates a replacement
of the specified type allowing the caller to decide about harvesting.
oldContent: oldContent is the old content which is deleted.
newType: The type of content to replace pOldContent with.
harvestParameters: Determines whether or not parameter harvesting will be performed.
Returns: A new persistent render content.

Rhino.Render.Utilities.PromptForSaveImageFileParameters(System.String,System.Int32@,System.Int32@,System.Int32@)
Prompts the user for a save file name and the width, height and depth of an image to be saved.
filename: The original file path.
width: A width.
height: An height.
colorDepth: A color depth.
Returns: The new file name.

Rhino.Render.Utilities.LoadPersistentRenderContentFromFile(System.UInt32,System.String)
Loads a content from a library file and adds it to the persistent content list of a particular document.
docSerialNumber: identifies the document into which the content should be loaded.
filename: is the full path to the file to be loaded.
Returns: The loaded content or null if an error occurred.

Rhino.Render.Utilities.FindFile(Rhino.RhinoDoc,System.String)
Finds a file and also handles network shares.
Remarks: This is a replacement for CRhinoFileUtilities::FindFile().
doc: Document to use for locating .3dm file's folder.
fullPathToFile: The file to be found.
Returns: The found file.

Rhino.Render.Utilities.FindFile(Rhino.RhinoDoc,System.String,System.Boolean)
Finds a file and also handles network shares.
Remarks: This is a replacement for CRhinoFileUtilities::FindFile().
doc: Document to use for locating .3dm file's folder.
fullPathToFile: The file to be found.
unpackFromBitmapTableIfNecessary: True to seasch for the file in the bitmap table and unpack it into the temp folder if not found in the initial search.
Returns: The found file.

Rhino.Render.Utilities.IsCachedTextureFileInUse(System.String)
Determines if any texture in any persistent content list is using the specified file name for caching.
textureFileName: The file name to check for. The extension is ignored.
Returns: true if the texture is present.

Rhino.Render.Utilities.ShowIORMenu(System.IntPtr,System.Drawing.Point,System.Double@,System.String@)
Display and track the context menu.
hwnd: The window that displays the menu, for example an edit box.
pt: The position to display the menu at inside the window
outIOR: Accepts the IOR value of the user's chosen substance
outString: Accepts the name of the user's chosen substance. Can be null if not required.
Returns: true if the function showed the IOR menu and something was picked.