Rhino.PlugIns.RenderPlugIn.RegisterRenderTabs(Rhino.Render.RenderTabs)
Override this method and call Rhino.Render.RenderTabs.RegisterTab(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon)
to add custom tabs to the render output window

Rhino.PlugIns.RenderPlugIn.CreatePreview(Rhino.Render.CreatePreviewEventArgs)
Creates the preview bitmap that will appear in the content editor's
thumbnail display when previewing materials and environments. If this
function is not overridden or the PreviewImage is not set on the
args, then the internal OpenGL renderer will generate a simulation of
the content.
This function is called with four different preview quality settings.
The first quality level of RealtimeQuick is called on the main thread
and needs to be drawn as fast as possible.  This function is called
with the other three quality settings on a separate thread and are
meant for generating progressively refined preview.
args: Event argument with several preview option state properties.

Rhino.PlugIns.RenderPlugIn.CreateTexture2dPreview(Rhino.Render.CreateTexture2dPreviewEventArgs)
Creates the preview bitmap that will appear in the content editor's
thumbnail display when previewing textures in 2d (UV) mode.
If this function is not overridden or the PreviewImage is not set on the
args, then the internal OpenGL renderer will generate a simulation.
args: Event argument with several preview option state properties.

Rhino.PlugIns.RenderPlugIn.SupportedOutputTypes
Returns a list of output types which your renderer can write.
The default implementation returns bmp, jpg, png, tif, tga.
Returns: A list of file types.

Rhino.PlugIns.RenderPlugIn.ShowDecalProperties(System.Collections.Generic.List{Rhino.Render.NamedValue}@)
Override this function to handle showing a modal dialog with your plugin's
custom decal properties.  You will be passed the current properties for the
object being edited.  The defaults will be set in InitializeDecalProperties.
properties: A list of named values that will be stored on the object
the input values are the current ones, you should modify the values after the dialog
closes.
Returns: true if the user pressed "OK", otherwise false.

Rhino.PlugIns.RenderPlugIn.PerferBasicContent
Set to true if you would like Rhino to quickly create a basic render
content in response to 'Create New' commands. Set to false if you would
prefer Rhino to display the render content chooser dialog.

Rhino.PlugIns.RenderPlugIn.RenderOptionsDialogPage(Rhino.RhinoDoc)
Override this method to replace the render properties page in the Rhino
document properties dialog.  The default implementation returns null
which means just use the the default Rhino page.
doc:
The document properties to edit.
Returns:
Return null to use the default Rhino page or return a page derived from
Rhino.UI.OptionsDialogPage to replace the default page.

Rhino.PlugIns.RenderPlugIn.OnAssignMaterial(System.IntPtr,Rhino.RhinoDoc,Rhino.DocObjects.Material@)
This function is called by the Object Properties and Layer Control
dialogs when the "Material" button is pressed in the "Render" tab.
This is only called if EnableAssignMaterialButton returns true.
parent:
doc:
material:
Returns:

Rhino.PlugIns.RenderPlugIn.EnableAssignMaterialButton
Called to enable/disable the "Material" button located on the
"Material" tab in the Properties and Layer dialog boxes.  The default
return value is false which will disable the button.  If the button is
disabled then the OnAssignMaterial function is never called.
Returns:

Rhino.PlugIns.RenderPlugIn.OnEditMaterial(System.IntPtr,Rhino.RhinoDoc,Rhino.DocObjects.Material@)
This function is called by the Object Properties and Layer Control
dialogs when the "Edit" button is pressed in the "Material" tab.  This
is only called if EnableEditMaterialButton returns true. A return value
of true means the material has been updated.
parent:
doc:
material:
Returns:

Rhino.PlugIns.RenderPlugIn.EnableEditMaterialButton(Rhino.RhinoDoc,Rhino.DocObjects.Material)
Called to enable/disable the "Edit" button located on the "Material" in
the Properties and Layer dialog boxes.  The default return value is
false  which will disable the button.  If the button is disabled then
the OnEditMaterial function is never called.
doc:
material:
Returns:

Rhino.PlugIns.RenderPlugIn.OnCreateMaterial(System.IntPtr,Rhino.RhinoDoc,Rhino.DocObjects.Material@)
This function is called by the Object Properties and Layer Control
dialogs when the "New" button is pressed in the "Material" tab.  This
is only called if EnableCreateMaterialButton returns true.
parent:
doc:
material:
Returns:

Rhino.PlugIns.RenderPlugIn.EnableCreateMaterialButton
Called to enable/disable the "New" button located on the "Material" in
the  Properties and Layer dialog boxes.  The default return value is
false which will disable the button.  If the button is disabled then
the OnEditMaterial function is never called.
Returns:

Rhino.PlugIns.RenderPlugIn.SunCustomSections(System.Collections.Generic.List{Rhino.UI.Controls.ICollapsibleSection})
Override this function to provide custom sections for the sun panel that are displayed
when your plug-in is the current render plug-in.
sections: Create your sections and return a list of them

Rhino.PlugIns.RenderPlugIn.RenderSettingsCustomSections(System.Collections.Generic.List{Rhino.UI.Controls.ICollapsibleSection})
Override this function to provide custom sections for the render settings panel that are displayed
when your plug-in is the current render plug-in.
sections: Create your sections and return a list of them