Rhino.Geometry.SubD.SubDVertexTag
SubD::VertexTag identifies the type of subdivision vertex.  Different tags use
different subdivision algorithms to determine where the subdivision point and
limit point are located.  There are toplological constraints that restrict which
tags can be assigned.

Rhino.Geometry.SubD.SubDVertexTag.Unset
Not a valid vertex tag and the default value for ON_SubDVertex::m_vertex_tag.
This encourages developers to thoughtfully initialize ON_SubDVertex::m_vertex_tag.

Rhino.Geometry.SubD.SubDVertexTag.Smooth
Must be an interior vertex.
All edges ending at a smooth vertex must be tagged as ON_SubD::EdgeTag::Smooth.

Rhino.Geometry.SubD.SubDVertexTag.Crease
Can be an iterior or a boundary vertex.
Exactly two edges ending at a crease vertex must be tagged as ON_SubD::EdgeTag::Crease.
All other edges ending at a crease must be tagged as tagON_SubD::EdgeTag::smooth.

Rhino.Geometry.SubD.SubDVertexTag.Corner
Can be an iterior, boundary or isolated vertex.
The location of a corner vertex is fixed.
The all subdivision points and the limit point are at the initial vertex location.
The edges ending at a corner vertex can be smooth or crease edges.

Rhino.Geometry.SubD.SubDVertexTag.Dart
Must be an interior vertex.
Exactly one edge ending at a dart vertex must be tagged as ON_SubD::EdgeTag::Smooth.
All other edges ending at a dart vertex must be tagged as tagON_SubD::EdgeTag::smooth.