Rhino.Render.RenderWindow.SetProgress(System.String,System.Single)
Accepts a rendering progress value to inform the user of the rendering advances.
text: The progress text.
progress: A progress value in the domain [0.0f; 1.0f].

Rhino.Render.RenderWindow.EndAsyncRender(Rhino.Render.RenderWindow.RenderSuccessCode)
Must be called when an asynchronous render has finished or ended for any reason.
successCode: Completed for a correct or canceled render, Failed for errors.

Rhino.Render.RenderWindow.AddWireframeChannel(Rhino.RhinoDoc,Rhino.DocObjects.ViewportInfo,System.Drawing.Size,System.Drawing.Rectangle)
A wireframe channel will not be added if none of the document properties settings
indicate that one is needed. In other words, Rhino will not generate an empty wireframe channel
just for the fun of it.
doc: The document to display
viewport: The view to display
size: The size of the image without clipping (ie - if you have a region, it was the
size of the image before you cut the region out.
region: The area of the rendering you want to display.  This should match the size
of the render window itself (ie - the one set using SetSize)
Returns: Returns true if the wireframe channel was successfully added.

Rhino.Render.RenderWindow.AddChannel(Rhino.Render.RenderWindow.StandardChannels)
Add a channel to the frame buffer in addition to the fixed Red, Green, Blue and Alpha channels.
channel: Channel to add
Returns: If the channel existed then true is returned otherwise; returns true if the channel was added or false if not.

Rhino.Render.RenderWindow.SetRGBAChannelColors(System.Drawing.Size,Rhino.Display.Color4f[])
Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
size: Size of the area to set. No validation is done on this value
colors: Array of Color4f values used to set the RenderWindow.StandardChannels.RGBA

Rhino.Render.RenderWindow.SetRGBAChannelColors(System.Drawing.Rectangle,Rhino.Display.Color4f[])
Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
rectangle:
rectangle.X is the horizontal pixel position of the left edge. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
rectangle.Y is the vertical pixel position of the top edge. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
rectangle.Width is the width of the rectangle in pixels. No validation is done on this value.
rectangle.Height is the height of the rectangle in pixels. No validation is done on this value.
colors: Array of Color4f values used to set the RenderWindow.StandardChannels.RGBA

Rhino.Render.RenderWindow.Invalidate
Invalidate the entire view window so that the pixels get painted.

Rhino.Render.RenderWindow.SaveDibAsBitmap(System.String)
Save current Dib of RenderWindow as file
Helper function for debugging purposes.
filename:

Rhino.Render.RenderWindow.SaveRenderImageAs(System.String,System.Guid,System.Boolean)
Save current RenderWindow contents as
an image file with the given name. The
filetype will be determine.
Pass in render engine Guid if an engine
implements saving to a format that is not
supported by Rhino. Guid.Empty if there is no need for that.
filename: Filename of image file to be created
renderEngineGuid: render engine ID
saveAlpha: True if alpha channel should be saved.

Rhino.Render.RenderWindow.SaveRenderImageAs(System.String,System.Boolean)
Like RenderWindow.SaveRenderImageAs(string,Guid,bool), but with
Guid set to Guid.Empty.
filename: Filename of image file to be created
saveAlpha: True if alpha channel should be saved.

Rhino.Render.RenderWindow.GetAdjust
Get an ImageAdjust instance containing current image adjusting settings
for this RenderWindow
Returns: ImageAdjust

Rhino.Render.RenderWindow.SetAdjust(Rhino.Render.RenderWindow.ImageAdjust)
Set new ImageAdjust to use. An ImageAdjust instance can be obtained by first
querying for one using GetAdjust()
imageAdjust: ImageAdjust