Rhino.Render.MenuTask
RDK Menu tasks
The Menu task consists of three items:
1. Icon
2. Menu string
3. Function

Rhino.Render.MenuTask.#ctor(System.IntPtr)
MenuTask constructor

Rhino.Render.MenuTask.Finalize
MenuTask destructor

Rhino.Render.MenuTask.Dispose
MenuTask dispose

Rhino.Render.MenuTask.Dispose(System.Boolean)
MenuTask dispose

Rhino.Render.MenuTask.Id
Returns the Guid of the menutask
Returns: Returns the Guid of the menutask

Rhino.Render.MenuTask.MenuString(Rhino.Render.MenuTaskOrigin,Rhino.Render.RenderContentKind)
Returns the title of the menutask
origin: The menutask origin.
kind: kind as a string. E.g environment, material, texture ...
Returns: Returns the menutask title string

Rhino.Render.MenuTask.RenderEngineId
Returns the render engine Guid of the menutask
Returns: Returns the render engine Guid of the menutask

Rhino.Render.MenuTask.IsEnabled(Rhino.Render.MenuTaskOrigin)
Returns true if the menutask item is enabled and false if the menutask item is disabled
origin: The menutask origin.
Returns: Returns true if the menutask item is enabled and false if the menutask item is disabled

Rhino.Render.MenuTask.Query(Rhino.Render.MenuTaskOrigin,System.Boolean)
Query if the task should be displayed to the user in a menu etc.
The default implementation returns the result of calling origin.SupportsTask()
origin: origin represents the UI that the menu was invoked in.
onItem: True if the user right-clicked on one or more items (thumbnail, tree node etc).
Returns: \e true if a UI element (e.g., a menu item) should be created for the task, else \e false.

Rhino.Render.MenuTask.MenuOrder(Rhino.Render.MenuTaskOrigin)
Return the order of the menutask
origin: The menutask origin.
Returns: Return the order of the menutask, 0 = first item, 1 = second item and so on

Rhino.Render.MenuTask.IsForTopLevelContent
Return true if the menutask is associated with the toplevel content and false if not
Returns: Return true if the menutask is associated with the toplevel content and false if not

Rhino.Render.MenuTask.IconOut(Rhino.Render.RenderContentKind,System.Int32)
Returns the associated out icon for the menutask item.
Out icon is the icon displayed if the menu task is not selected.
kind: kind as a string. E.g environment, material, texture ...
size: The size of the icon.
Returns: Returns a bitmap representing the icon

Rhino.Render.MenuTask.IconIn(Rhino.Render.RenderContentKind,System.Int32)
Returns the associated in icon for the menutask item.
Out icon is the icon displayed if the menu task is not selected and the in icon is
represents that the menutask is selected. If the menutask does not contain two states
then the IconIn will return the same icon as IconOut
kind: kind as a string. E.g environment, material, texture ...
size: The size of the icon.
Returns: Returns a bitmap representing the icon

Rhino.Render.MenuTask.UserExecute(Rhino.Render.MenuTaskOrigin)
Called to execute the function associated with the menutask
origin: The menutask origin.
Returns:  Returns UserExecuteResult values { kSuccess, kFailure, kCancel };

Rhino.Render.MenuTask.MenuSeparators
Returns a value indicating if the menutask has menuseparators before, after or none
Returns:  Returns Separator value
kNone = No separators will surround this task on the menu.
kBefore = A separator will appear before this task on the menu.
kAfter = A separator will appear after this task on the menu.
kBoth,

Rhino.Render.MenuTask.SubMenu
Returns the SubMenu value of the task
Returns:  Returns SubMenu value