Rhino.Geometry.MeshSmoothingCoordinateSystem
The direction of the smoothing used by Rhino.Geometry.Mesh.Smooth.

Rhino.Geometry.MeshSmoothingCoordinateSystem.World
World coordinates

Rhino.Geometry.MeshSmoothingCoordinateSystem.CPlane
Construction plane coordinates

Rhino.Geometry.MeshSmoothingCoordinateSystem.Object
Object u, v, and n coordinates