Rhino.Render.LinearWorkflow.CopyFrom(Rhino.Render.FreeFloatingBase)
Create a copy of linearworkflow
src:

Rhino.Render.LinearWorkflow.#ctor
Create an utility object not associated with any document

Rhino.Render.LinearWorkflow.#ctor(Rhino.Render.LinearWorkflow)
Create utility object not associated with any document from another object
src:

Rhino.Render.LinearWorkflow.PreProcessColors
Linear workflow active state

Rhino.Render.LinearWorkflow.PreProcessTextures
Linear workflow active state

Rhino.Render.LinearWorkflow.PostProcessFrameBuffer
Linear workflow active state

Rhino.Render.LinearWorkflow.PreProcessGamma
Linear workflow gamma

Rhino.Render.LinearWorkflow.PostProcessGamma
Linear workflow gamma

Rhino.Render.LinearWorkflow.PostProcessGammaReciprocal
Linear workflow gamma

Rhino.Render.LinearWorkflow.Hash
Linear workflow CRC