Rhino.RhinoApp.Version
File version of the main Rhino process

Rhino.RhinoApp.LicenseUserName
Gets the name of the user that owns the license or lease.

Rhino.RhinoApp.LicenseUserOrganization
Gets the name of the organization of the user that owns the license or lease.

Rhino.RhinoApp.InstallationTypeString
Gets the type of installation (product edition) of the license or lease.

Rhino.RhinoApp.SchemeName
Gets the current Registry scheme name.

Rhino.RhinoApp.GetDataDirectory(System.Boolean,System.Boolean)
Gets the data directory.
Returns: The data directory.
localUser: If set to true local user.
forceDirectoryCreation: If set to true force directory creation.

Rhino.RhinoApp.GetDataDirectory(System.Boolean,System.Boolean,System.String)
Gets the data directory.
Returns: The data directory.
localUser: If set to true local user.
forceDirectoryCreation: If set to true force directory creation.
subDirectory:
Sub directory, will get appended to the end of the data directory.  if forceDirectoryCreation
is true then this directory will get created and writable.

Rhino.RhinoApp.CommandLineOut
Provides a TextWriter that can write to the command line.

Rhino.RhinoApp.OutputDebugString(System.String)
Print a string to the Visual Studio Output window, if a debugger is attached.
Note that the developer needs to add a newline manually if the next output should
come on a separate line.
str: The string to print to the Output window.

Rhino.RhinoApp.SetCommandPromptMessage(System.String)
Set the text that appears in the Rhino command prompt.
In general, you should use the SetCommandPrompt functions.
In rare cases, like worker thread messages, the message that
appears in the prompt has non-standard formatting. In these
rare cases, SetCommandPromptMessage can be used to literally
specify the text that appears in the command prompt window.
prompt: A literal text for the command prompt window.

Rhino.RhinoApp.ExecuteCommand(Rhino.RhinoDoc,System.String)
Execute a Rhino command.
document: Document to execute the command for
commandName: Name of command to run.  Use command's localized name or preface with an underscore.
Returns: Returns the reult of the command.

Rhino.RhinoApp.RunMenuScript(System.String)
Run a Rhino menu item script.  Will add the selected menu string to the MRU command menu.
script: [in] script to run.
Remarks:
Rhino acts as if each character in the script string had been typed in the command prompt.
When RunScript is called from a "script runner" command, it completely runs the
script before returning. When RunScript is called outside of a command, it returns and the
script is run. This way menus and buttons can use RunScript to execute complicated functions.
Throws System.ApplicationException:
If RunScript is being called while inside an event watcher.
Returns:

Rhino.RhinoApp.InvokeOnUiThread(System.Delegate,System.Object[])
method:
args:

Rhino.RhinoApp.InvokeAndWait(System.Action)
Work-In-Progess. Testing this with our unit test framework
action:

Rhino.RhinoApp.InvokeRequired
Returns true if we are currently not running on the main user interface thread

Rhino.RhinoApp.MainWindow
Main Rhino Window

Rhino.RhinoApp.IsInstallationEvaluation(Rhino.ApplicationSettings.Installation)
If licenseType is an evaluation license, returns true. An evaluation license limits the ability of
Rhino to save based on either the number of saves or a fixed period of time.
Rhino.ApplicationSettings.Installation
licenseType:
Returns: true if licenseType is an evaluation license. false otherwise

Rhino.RhinoApp.IsInstallationCommercial(Rhino.ApplicationSettings.Installation)
If licenseType is a commercial license, returns true. A commercial license grants
full use of the product.
licenseType:
Rhino.ApplicationSettings.Installation
Returns: true if licenseType is a commercial license. false otherwise

Rhino.RhinoApp.IsInstallationBeta(Rhino.ApplicationSettings.Installation)
If licenseType is a beta license, returns true. A beta license grants
full use of the product during the pre-release development period.
licenseType:
Rhino.ApplicationSettings.Installation
Returns: true if licenseType is a beta license. false otherwise

Rhino.RhinoApp.LicenseExpires
Returns
true if the license will expire
false otherwise

Rhino.RhinoApp.IsPreRelease
Returns
true if Rhino is compiled a s Pre-release build (Beta, WIP)
false otherwise

Rhino.RhinoApp.IsLicenseValidated
Returns
true if the license is validated
false otherwise

Rhino.RhinoApp.IsCloudZooNode
Returns
true if rhino is currently using the Cloud Zoo
false otherwise

Rhino.RhinoApp.ValidationGracePeriodDaysLeft
Returns number of days within which validation must occur. Zero when
validation grace period has expired.
Raises InvalidLicenseTypeException if LicenseType is one of:
EvaluationSaveLimited
EvaluationTimeLimited
Viewer
Unknown

Rhino.RhinoApp.DaysUntilExpiration
Returns number of days until license expires. Zero when
license is expired.
Raises InvalidLicenseTypeException if LicenseExpires
would return false.

Rhino.RhinoApp.AskUserForRhinoLicense(System.Boolean,System.Object)
Display UI asking the user to enter a license for Rhino or use one from the Zoo.
standAlone: True to ask for a stand-alone license, false to ask the user for a license from the Zoo
parentWindow: Parent window for the user interface dialog.
Returns:

Rhino.RhinoApp.RefreshRhinoLicense
Refresh the license used by Rhino. This allows any part of Rhino to ensure that the most current version of the license file on disk is in use.
Returns:

Rhino.RhinoApp.LoginToCloudZoo
Logs in to the cloud zoo.

Rhino.RhinoApp.LoggedInUserName
Returns the name of the logged in user, or null if the user is not logged in.

Rhino.RhinoApp.LoggedInUserAvatar
Returns the logged in user's avatar picture.
Returns a default avatar if the user does not have an avatar or if the avatar could not be fetched.

Rhino.RhinoApp.UserIsLoggedIn
Returns true if the user is logged in; else returns false.
A logged in user does not guarantee that the auth tokens managed by the CloudZooManager instance are valid.

Rhino.RhinoApp.EscapeKeyPressed
Can add or removed delegates that are raised when the escape key is clicked.

Rhino.RhinoApp.KeyboardEvent
Can add or removed delegates that are raised by a keyboard event.

Rhino.RhinoApp.RdkNewDocument
Monitors when RDK document information is rebuilt.

Rhino.RhinoApp.RdkGlobalSettingsChanged
Monitors when RDK global settings are modified.

Rhino.RhinoApp.RdkUpdateAllPreviews
Monitors when RDK thumbnails are updated.

Rhino.RhinoApp.RdkCacheImageChanged
Monitors when the RDK thumbnail cache images are changed.

Rhino.RhinoApp.RendererChanged
Monitors when Rhino's current renderer changes.

Rhino.RhinoApp.RdkPlugInUnloading
Monitors when RDK client plugins are unloaded.

Rhino.RhinoApp.InFullScreen
Verifies that Rhino is running in full screen mode.
Returns: true if Rhino is running full screen, false otherwise.

Rhino.RhinoApp.DefaultUiFont
Default font used to render user interface

Rhino.RhinoApp.RunningOnVMWare
Verifies that Rhino is running on VMWare
Returns: true if Rhino is running in Windows on VMWare, false otherwise

Rhino.RhinoApp.RunningInRdp
Find out if Rhino is running in a remote session
Returns: true if Rhino is running in a RDP session, false otherwise

Rhino.RhinoApp.ParseTextField(System.String,Rhino.DocObjects.RhinoObject,Rhino.DocObjects.RhinoObject)
formula:
obj:
topParentObject:
Returns: