Rhino.PlugIns.PlugIn.GetLoadedPlugInIcon(System.Guid,System.String,System.Int32)
Gets an icon from a loaded RhinoCommon plugin and returns it as a bitmap.
5-Jul-2017 Dale Fugier, https://mcneel.myjetbrains.com/youtrack/issue/RH-39494

Rhino.PlugIns.PlugIn.GetUnloadedPlugInIcon(System.String,System.Int32)
Gets an icon from unloaed RhinoCommon plugin and returns it as a bitmap.
5-Jul-2017 Dale Fugier, https://mcneel.myjetbrains.com/youtrack/issue/RH-39494

Rhino.PlugIns.PlugIn.LoadPlugIn(System.String,System.Guid@)
Attempt to load a plug-in at a path. Loaded plug-ins are remembered by
Rhino between sessions, so this function can also be considered a plug-in
installation routine
path: full path to plug-in to attempt to load
plugInId:
If successfull (or the plug-in is already loaded), the unique id for the
plug-in is returned here. Guid.Empty on failure
Returns:

Rhino.PlugIns.PlugIn.Install(System.String)
Add plug-in to install list if it is not already registered
path: full path to plug-in to attempt to load

Rhino.PlugIns.PlugIn.Find(System.Guid)
Finds the plug-in instance that was loaded from a given plug-in Id.
plugInId: The plug-in Id.
Returns: The plug-in instance if successful. Otherwise, null.

Rhino.PlugIns.PlugIn.RaiseOnPlugInSettingsSavedEvent
Raise any pending OnPlugInSettingsSaved events, the events are normally
queued while a command is running and and fired while Rhino is in an
idle state.  Calling this method will raise any pending changed events
regardless of Rhino's current idle state or if a command is running.

Rhino.PlugIns.PlugIn.Id
Returns the Guid, or unique Id, of the plug-in.

Rhino.PlugIns.PlugIn.Name
Returns the name of the plug-in, as found in the plug-in's assembly attributes.

Rhino.PlugIns.PlugIn.Version
Returns the version of the plug-in, as found in the plug-in's assembly attributes.

Rhino.PlugIns.PlugIn.Icon(System.Drawing.Size)
Returns the plug-in's icon in bitmap form.
size: The desired size in pixels.
Returns: The icon if successful, null otherwise.

Rhino.PlugIns.PlugIn.Description
Returns the description of the plug-in, as found in the plug-in's assembly attributes.

Rhino.PlugIns.PlugIn.GetLicenseOwner(System.String@,System.String@)
Get the customer name and organization used when entering the product
license.
registeredOwner:
registeredOrganization:
Returns:

Rhino.PlugIns.PlugIn.SettingsSaved
This event is raised when an instance of Rhino has modified the
external settings file associated with this plug-in's Rhino.PlugIns.PlugIn.Settings
property.
Rhino.PlugIns.PlugIn.SaveSettings

Rhino.PlugIns.PlugIn.InvokeSetingsSaved(System.Object,System.Boolean)
Call this method to raise the SettingsSaved event.
sender:
writing:

Rhino.PlugIns.PlugIn.SaveSettings
Write settings to disk which will raise a Rhino.PlugIns.PlugIn.SettingsSaved
event.

Rhino.PlugIns.PlugIn.Settings
Persistent plug-in settings.

Rhino.PlugIns.PlugIn.GetPlugInInfo(System.Guid)
Returns detailed information about an installed Rhino plug-in.
pluginId: The id of the plug-in.
Returns: Detailed information about an installed Rhino plug-in if successful, null otherwise.

Rhino.PlugIns.PlugIn.AskOnLoadProtection
If true, Rhino will display a warning dialog when load-protected plug-ins are attempting to load.
If false, load-protected plug-ins will silently not load.

Rhino.PlugIns.PlugIn.InstalledPlugInCount
Returns the number of installed Rhino plug-ins.

Rhino.PlugIns.PlugIn.PlugInExists(System.Guid,System.Boolean@,System.Boolean@)
Verifies that a Rhino plug-in is installed.
id: The id of the plug-in.
loaded: The loaded state of the plug-in.
loadProtected: The load protected state of the plug-in.
Returns: Returns true if the plug-in exists, or is installed.

Rhino.PlugIns.PlugIn.GetInstalledPlugInNames
Returns the names of all installed Rhino plug-ins.
Returns: The names if successful.

Rhino.PlugIns.PlugIn.PathFromName(System.String)
Gets the path to an installed plug-in given the name of that plug-in
pluginName:
Returns:

Rhino.PlugIns.PlugIn.PathFromId(System.Guid)
Gets the path to an installed plug-in given the id of that plug-in
pluginId:
Returns:

Rhino.PlugIns.PlugIn.IdFromPath(System.String)
Gets the id of an installed plug-in giving the plug-in's file path.
pluginPath: The path to the installed plug-in.
Returns: The id if successful.

Rhino.PlugIns.PlugIn.IdFromName(System.String)
Gets the id of an installed plug-in giving the plug-in's name.
pluginName: The name of the installed plug-in.
Returns: The id if successful.

Rhino.PlugIns.PlugIn.LoadPlugIn(System.Guid)
Loads an installed plug-in.
pluginId: The id of the installed plug-in.
Returns: true if successful, false otherwise.

Rhino.PlugIns.PlugIn.LoadPlugIn(System.Guid,System.Boolean,System.Boolean)
Loads an installed plug-in.
pluginId: The id of the installed plug-in.
loadQuietly: Load the plug-in quietly.
forceLoad: Load plug-in even if previous attempt to load has failed.
Returns: true if successful, false otherwise.

Rhino.PlugIns.PlugIn.SetLoadProtection(System.Guid,System.Boolean)
Set load protection state for a certain plug-in
pluginId:
loadSilently:

Rhino.PlugIns.PlugIn.GetLoadProtection(System.Guid,System.Boolean@)
Get load protection state for a plug-in
pluginId:
loadSilently:
Returns: