Rhino.Display.RhinoView.FromRuntimeSerialNumber(System.UInt32)
Get a RhinoView from it's unique runtime serial number
serialNumber:
Returns: RhinoView or null if no view exists for a given serial number

Rhino.Display.RhinoView.DisplayPipeline
Gets the display pipeline used for this view.

Rhino.Display.RhinoView.RealtimeDisplayMode
Gets the RealtimeDisplayMode active for this view. null if the view doesn't have a RealtimeDisplayMode set.

Rhino.Display.RhinoView.Bounds
Gets the size and location of the view including its nonclient elements, in pixels, relative to the parent control.

Rhino.Display.RhinoView.MouseCaptured(System.Boolean)
Returns whether or not the mouse is captured in this view.
bIncludeMovement: If captured, test if the mouse has moved between mouse button down and mouse button up.
Returns: true if captured, false otherwise.