Rhino.Geometry.Collections.MeshVertexStatusList.Count
Gets or sets the number of hidden vertices. For this to be a valid part of a mesh, this count should be the same as the one of mesh vertices.

Rhino.Geometry.Collections.MeshVertexStatusList.HiddenCount
Gets a value indicating how many vertices have been set to hidden.

Rhino.Geometry.Collections.MeshVertexStatusList.Capacity
Gets or sets the total number of hidden vertex information the internal data structure can hold without resizing.

Rhino.Geometry.Collections.MeshVertexStatusList.Clear
Clears the hidden vertex list on the mesh. This results in a fully visible mesh.

Rhino.Geometry.Collections.MeshVertexStatusList.Add(System.Boolean)
Adds a new flag at the end of the list.
hidden: True if vertex is hidden.
Returns: The index of the newly added hidden vertex.

Rhino.Geometry.Collections.MeshVertexStatusList.AddRange(System.Collections.Generic.IEnumerable{System.Boolean})
Appends an array, a list or any enumerable of flags to the end of the list.
values: Hidden values to append.
Returns: true on success, false on failure.

Rhino.Geometry.Collections.MeshVertexStatusList.Destroy
Releases all memory allocated to store hidden vertices. The list capacity will be 0 after this call.
Vertices will be immediately considered visible.
Subsequent calls can add new items.

Rhino.Geometry.Collections.MeshVertexStatusList.Contains(System.Boolean)
Determines if some vertices are hidden or some are shown.
hidden: The value to be checked. True means some vertex is hidden.
Returns: True if the array contains the specified value.

Rhino.Geometry.Collections.MeshVertexStatusList.CopyTo(System.Boolean[],System.Int32)
Copies to an array, starting at an index.
array: The array to be copied into.
arrayIndex: The starting index in the array.

Rhino.Geometry.Collections.MeshVertexStatusList.GetEnumerator
Gets an enumerator that yields all flags in this collection.
Returns: The enumerator.