Rhino.UI.PanelIds.Materials
Rhino material browser

Rhino.UI.PanelIds.Environment
Rhino environment panel

Rhino.UI.PanelIds.Texture
Rhino texture panel

Rhino.UI.PanelIds.LightManager
Rhino light manager panel

Rhino.UI.PanelIds.Sun
Rhino sun panel

Rhino.UI.PanelIds.GroundPlane
Rhino ground plane panel

Rhino.UI.PanelIds.Layers
Rhino Layer panel

Rhino.UI.PanelIds.ObjectProperties
Rhino object properties panel

Rhino.UI.PanelIds.ContextHelp
Rhino context sensitive help panel.

Rhino.UI.PanelIds.Notes
Rhino notes panel

Rhino.UI.PanelIds.Rendering
Rhino rendering properties panel

Rhino.UI.PanelIds.Libraries
Rhino render properties panel