Rhino.Geometry.MeshUnsafeLock.VertexPoint3fArray(System.Int32@)
Retrieves a pointer to the raw mesh vertex array, which uses coordinates
defined with single precision floating point numbers.
length: The length of the array. This value is returned by reference (out in C#).
Returns: The beginning of the vertex array. Item 0 is the first vertex,
and item length-1 is the last valid one.

Rhino.Geometry.MeshUnsafeLock.Release
Releases the lock and updates the underlying unmanaged data structures.