Rhino.Render.DynamicIconUsage.TreeControl
Dynamic icon appears in a tree control.

Rhino.Render.DynamicIconUsage.SubnodeControl
Dynamic icon appears in a sub-node control (\see CRhRdkSubNodeCtrl)

Rhino.Render.DynamicIconUsage.ContentControl
Dynamic icon appears in a content control  (\see CRhRdkContentCtrl)