Rhino.FileIO.ContentHash
Contains information that is useful to uniquly identify an object.
Remarks: This object is immutable.

Rhino.FileIO.ContentHash.Sha1NameHash
Gets the 20-bytes long SHA1 hash of the name.

Rhino.FileIO.ContentHash.ByteCount
Gets the length of the content, in bytes.

Rhino.FileIO.ContentHash.Sha1ContentHash
Gets the 20-bytes long SHA1 hash of the content.

Rhino.FileIO.ContentHash.HashTime
Gets the hash time, rounded to seconds.

Rhino.FileIO.ContentHash.GetDisposableHandle
Be resposible: call Dispose()

Rhino.FileIO.ContentHash.CreateFromFile(System.String)
Creates a new ContentHash, representing the content of a file.
path: A path. This can be null and can refer to a nonexisting path.
Returns:

Rhino.FileIO.ContentHash.Clone
Creates a copy of this content hash.
Because content hash is immutable, this can be used as a deep copy.
Returns: A different instance of the same content hash.

Rhino.FileIO.ContentHash.Equals(Rhino.FileIO.ContentHash)
Determines if another content hash has the same value.
other: The other content hash to compare.
Returns: True if the two hashes are equal.

Rhino.FileIO.ContentHash.op_Equality(Rhino.FileIO.ContentHash,Rhino.FileIO.ContentHash)
Determines if two ContentHash instances are equal by value.
left: The first hash.
right: The second hash.
Returns: True if they are equal by value, otherwise false.

Rhino.FileIO.ContentHash.op_Inequality(Rhino.FileIO.ContentHash,Rhino.FileIO.ContentHash)
Determines if two ContentHash instances are different by value.
left: The first hash.
right: The second hash.
Returns: True if they are different by value, otherwise false.