Rhino.Render.PreviewBackground.CppPointer
CppPointer for PreivewLighting

Rhino.Render.PreviewBackground.#ctor(System.IntPtr)
Constructor for PreivewLighting

Rhino.Render.PreviewBackground.EnvironmentInstanceId
EnvironmentInstanceId

Rhino.Render.PreviewBackground.SetEnvironmentInstanceId(System.Guid)
SetEnvironmentInstanceId

Rhino.Render.PreviewBackground.SetUpPreview(System.IntPtr,System.Guid)
SetUpPreview

Rhino.Render.PreviewBackground.ElementKind
ElementKind