Rhino.Render.RenderEnvironment.NewBasicEnvironment(Rhino.Render.SimulatedEnvironment)
Constructs a new Rhino.Render.RenderEnvironment from a Rhino.Render.SimulatedEnvironment.
environment: The environment to create the basic environment from.
Returns: A new basic environment.