Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef instance.

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.#ctor(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})
Initializes a new instances from a set of ObjRefs
objrefs: An array, a list or any enumerable set of Rhino object references.

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.Count
Gets the number of ObjRef instances in this array.

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.Add(Rhino.DocObjects.ObjRef)
Adds an ObjRef to the list.
objref: An ObjRef to add.

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.