Rhino.Render.PreviewSceneServer.CppPointer
The CppPointer of PreviewSceneServer

Rhino.Render.PreviewSceneServer.#ctor(System.IntPtr)
Constructor for PreviewSceneServer

Rhino.Render.PreviewSceneServer.Dispose
Dispose for PreviewSceneServer

Rhino.Render.PreviewSceneServer.ApplyRotation(System.Double,System.Double,Rhino.Render.IRhRdkPreviewSceneServer_eRotationType)
Set Scene Server Rotation