Rhino.Geometry.Vector2f.EpsilonEquals(Rhino.Geometry.Vector2f,System.Single)
Check that all values in other are withing epsilon of the values in this
other:
epsilon:
Returns:

Rhino.Geometry.Vector2f.op_Multiply(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Multiplies two Rhino.Geometry.Vector2f together, returning the dot (internal) product of the two.
point1: The first point.
point2: The second point.
Returns: A value that results from the coordinatewise multiplication of point1 and point2.

Rhino.Geometry.Vector2f.Multiply(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Multiplies two Rhino.Geometry.Vector2f together, returning the dot (internal) product of the two.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
point1: The first point.
point2: The second point.
Returns: A value that results from the coordinatewise multiplication of point1 and point2.