Rhino.Runtime.InteropWrappers.StringHolder
This class is used to pass strings back and forth between managed
and unmanaged code.  This should not be be needed by plug-ins.
If you are just dealing with an ON_wString*,
use Rhino.Runtime.InteropWrappers.StringWrapper

Rhino.Runtime.InteropWrappers.StringHolder.ConstPointer
C++ pointer used to access the ON_wString, managed plug-ins should
never need this.
Returns:

Rhino.Runtime.InteropWrappers.StringHolder.NonConstPointer
C++ pointer used to access the ON_wString, managed plug-ins should
never need this.
Returns:

Rhino.Runtime.InteropWrappers.StringHolder.#ctor
Constructor

Rhino.Runtime.InteropWrappers.StringHolder.Dispose
IDispose implementation

Rhino.Runtime.InteropWrappers.StringHolder.GetString(System.IntPtr)
Gets managed string from unmanaged ON_wString pointer.
pStringHolder:
Returns: Null if pStringHolder has no reference, otherwise, the string. This may be an empty string, if setting an empty string is possible.