Rhino.Geometry.Circle.ToNurbsCurve(System.Int32,System.Int32)
Create a uniform non-ratonal cubic NURBS approximation of a circle.
degree: >=1
cvCount: cv count >=5
Returns: NURBS curve approximation of a circle on success

Rhino.Geometry.Circle.EpsilonEquals(Rhino.Geometry.Circle,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns: