Rhino.Render.DataSources.RdkSelectionNavigator.Clear
Clear the navigator.

Rhino.Render.DataSources.RdkSelectionNavigator.Add(Rhino.Render.RenderContentCollection)
Add a selection of contents at the current position.
Clears the navigator ahead of the current position.
selectedContentArray: The selected content

Rhino.Render.DataSources.RdkSelectionNavigator.CanGoBackwards
Check the backwards status of the navigator
Returns: True if it is possible to navigate backwards, else false

Rhino.Render.DataSources.RdkSelectionNavigator.CanGoForwards
Check the forwards status of the navigator
Returns: True if it is possible to navigate forwards, else false

Rhino.Render.DataSources.RdkSelectionNavigator.GoBackwards(Rhino.Render.RenderContentCollection@)
Navigate backwards if possible
selectedContentArray: selectedContentArray is the new selection after navigating backwards
Returns: true on success, else false

Rhino.Render.DataSources.RdkSelectionNavigator.GoForwards(Rhino.Render.RenderContentCollection@)
Navigate forwards if possible
selectedContentArray: selectedContentArray is the new selection after navigating forwards
Returns: true on success, else false