Rhino.UI.Controls.ThumbnailUI.Thumbnail.CppPointer
Thumbnail c++ pointer

Rhino.UI.Controls.ThumbnailUI.Thumbnail.#ctor(System.IntPtr)
Constructor for Thumbnail

Rhino.UI.Controls.ThumbnailUI.Thumbnail.Dispose
Dispose for Thumbnail