Rhino.Geometry.Collections.MeshFaceNormalList.Capacity
Gets or sets the total number of face normals the internal data structure can hold without resizing.

Rhino.Geometry.Collections.MeshFaceNormalList.Destroy
Releases all memory allocated to store face normals. The list capacity will be 0 after this call.
Subsequent calls can add new items.

Rhino.Geometry.Collections.MeshFaceNormalList.GetEnumerator
Gets an enumerator that yields all normals (vectors) in this collection.
Returns: The enumerator.