Rhino.Render.ChangeQueue.ChangeQueue.CrcFromGuid(System.Guid)
Helper function to get a CRC from a Guid.
guid:
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.IsPreview
Return true if this ChangeQueue is created for preview rendering.
No view was set for preview rendering.

Rhino.Render.ChangeQueue.ChangeQueue.ViewId
Return view ID for a RhinoDoc based ChangeQueue.
Returns Guid.Empty if no view was associated with the changequeue,
i.e. preview rendering.

Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,System.UInt32,Rhino.DocObjects.ViewInfo,System.Boolean)
Construct a new ChangeQueue from the given document
pluginId: Id of plugin instantiating ChangeQueue
docRuntimeSerialNumber:
viewinfo:
bUseDisplayPipelineAttributes: Determines whether the display pipeline attributes for this viewport should be taken into account when supplying data.	If you are
using this queue to populate a scene for the "Render" command, set this to false.	If you are using it to draw a realtime preview, you will probably want to set it to true.

Rhino.Render.ChangeQueue.ChangeQueue.OneShot
Call Flush() once, after that automatically dispose the queue.

Rhino.Render.ChangeQueue.ChangeQueue.CreateWorld
Calls CreateWorld with true passed.

Rhino.Render.ChangeQueue.ChangeQueue.CreateWorld(System.Boolean)
Signal the queue to do the initialisation of the queue, seeding it with the content currently available.
bFlushWhenReady: Set to true CreateWorld should automatically flush at the end.
Note that the Flush called when true is passed doesn't apply changes.

Rhino.Render.ChangeQueue.ChangeQueue.Flush
Tell the ChangeQueue to flush all collected events.
This can trigger a host of Apply* calls.
The following is the order in which those calls get
made if there are changes for that specific data type:
ApplyViewChange
ApplyLinearWorkflowChanges
ApplyDynamicObjectTransforms
ApplyDynamicLightChanges
ApplyRenderSettingsChanges
ApplyEnvironmentChanges (background)
ApplyEnvironmentChanges (refl)
ApplyEnvironmentChanges (sky)
ApplySkylightChanges
ApplySunChanges
ApplyLightChanges
ApplyMaterialChanges
ApplyMeshChanges
ApplyMeshInstanceChanges
ApplyGroundPlaneChanges
ApplyClippingPlaneChanges

Rhino.Render.ChangeQueue.ChangeQueue.GetQueueSkylight
Get skylight known to the queue at the time of the Flush
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.GetQueueGroundPlane
Get groundplane known to the queue at the time of the Flush
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.GetQueueRenderSettings
Get render settings known to the queue at the time of the Flush
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.GetQueueSun
Get sun known to the queue at the time of the Flush
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.GetQueueView
Get view known to the queue at the time of the Flush
Returns: ViewInfo

Rhino.Render.ChangeQueue.ChangeQueue.AreViewsEqual(Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewInfo)
Compare to ViewInfo instances and decide whether they are equal or not.
If you need to change the way the comparison is done you can override
this function and implement your custom comparison.
aView: First ViewInfo to compare
bView: Second ViewInfo to compare
Returns: true if the views are considered equal

Rhino.Render.ChangeQueue.ChangeQueue.GetQueueSceneBoundingBox
Get the scene bounding box
Returns: Scene bounding box

Rhino.Render.ChangeQueue.ChangeQueue.Dispose
Dispose our ChangeQueue

Rhino.Render.ChangeQueue.ChangeQueue.MaterialFromId(System.UInt32)
Get the RenderMaterial from the ChangeQueue material cache based on RenderHash
crc: The RenderHash
Returns: RenderMaterial

Rhino.Render.ChangeQueue.ChangeQueue.EnvironmentIdForUsage(Rhino.Render.RenderEnvironment.Usage)
Get RenderEnvironment RenderHash for given usage.
usage:
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.EnvironmentForid(System.UInt32)
Get RenderEnvironment for given RenderHash
crc:
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.ConvertCameraBasedLightToWorld(Rhino.Render.ChangeQueue.ChangeQueue,Rhino.Render.ChangeQueue.Light,Rhino.DocObjects.ViewInfo)
Convert given (camera-based) light to a world-based light (in-place)
changequeue:
light:
vp: