Rhino.Geometry.SubDVertexPtr
Efficiently manages a reference to a vertex in a SubD.
Contains connection information to faces and edges.

Rhino.Geometry.SubDVertexPtr.Previous
Links to previous vertex on this level.

Rhino.Geometry.SubDVertexPtr.Next
Links to next vertex on this level.