Rhino.Render.ChangeQueue.MappingChannelCollection.Count
Get count of MappingChannels in this collection

Rhino.Render.ChangeQueue.MappingChannelCollection.Channels
Enumerate all available channels in this mapping