Rhino.Runtime.InteropWrappers.ClassArrayString.ConstPointer
Gets the const (immutable) pointer of this array.
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.ClassArrayString.NonConstPointer
Gets the non-const pointer (for modification) of this array.
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.ClassArrayString.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.ClassArrayString instance.

Rhino.Runtime.InteropWrappers.ClassArrayString.Count
Gets the number of strings in this array.

Rhino.Runtime.InteropWrappers.ClassArrayString.Add(System.String)
Adds a string to the list.
s: A string to add.

Rhino.Runtime.InteropWrappers.ClassArrayString.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.ClassArrayString.ToArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.