Rhino.Render.PreviewAppearance.CppPointer
Previewappearances c++ pointer

Rhino.Render.PreviewAppearance.MetaData
Previewappearance MetaData

Rhino.Render.PreviewAppearance.#ctor(System.IntPtr)
Constructor for previewappearance

Rhino.Render.PreviewAppearance.Dispose
Dispose for previewappearance

Rhino.Render.PreviewAppearance.RotationX
RotationX

Rhino.Render.PreviewAppearance.SetRotationX(System.Double)
SetRotationX

Rhino.Render.PreviewAppearance.RotationY
RotationY

Rhino.Render.PreviewAppearance.SetRotationY(System.Double)
SetRotationY

Rhino.Render.PreviewAppearance.Size
Size

Rhino.Render.PreviewAppearance.SetSize(System.Double)
SetSize

Rhino.Render.PreviewAppearance.RotationType
RotationType

Rhino.Render.PreviewAppearance.SetRotationType(Rhino.Render.IRhRdkPreviewSceneServer_eRotationType)
SetRotationType

Rhino.Render.PreviewAppearance.Geometry
Geometry

Rhino.Render.PreviewAppearance.FromMetaData(Rhino.Render.DataSources.MetaData)
Copy data from MetaData to PreviewAppearance

Rhino.Render.PreviewAppearance.ToMetaData
Copy PreviewAppearance to MetaData

Rhino.Render.PreviewAppearance.Background
Background

Rhino.Render.PreviewAppearance.Lighting
Lighting