Rhino.DocObjects.Tables.MaterialTable.FindIndex(System.Int32)
Retrieves a Material object based on Index. This seach type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Material object, or null if none was found.