Rhino.Display.ViewCaptureSettings
Used to hold the information required to generate high resolution output
of a RhinoViewport.  This is used for generating paper prints or image files

Rhino.Display.ViewCaptureSettings.MediaSize
Total size of the image or page in dots

Rhino.Display.ViewCaptureSettings.Resolution
Capture "density" in dots per inch

Rhino.Display.ViewCaptureSettings.CropRectangle
Actual area of output rectangle that view capture is sent to.

Rhino.Display.ViewCaptureSettings.Dispose
Actively reclaims unmanaged resources that this instance uses.