Rhino.Geometry.RTree.Search(Rhino.Geometry.Sphere,System.EventHandler{Rhino.Geometry.RTreeEventArgs})
Searches for items in a sphere.
sphere: bounds used for searching.
callback: An event handler to be raised when items are found.
Returns:
true if entire tree was searched. It is possible no results were found.

Rhino.Geometry.RTree.Search(Rhino.Geometry.Sphere,System.EventHandler{Rhino.Geometry.RTreeEventArgs},System.Object)
Searches for items in a sphere.
sphere: bounds used for searching.
callback: An event handler to be raised when items are found.
tag: State to be passed inside the Rhino.Geometry.RTreeEventArgs Tag property.
Returns:
true if entire tree was searched. It is possible no results were found.