Rhino.Render.Decal.CRC
The decal CRC identifies a decal by its state. Multiple decals which would be
exactly the same would have the same CRC and are culled from the system.
If you store this value with the intention of using it to find the decal again
later, you must update your stored value whenever the decal state changes.
You can detect when a decal changes by watching for the OnUserDataTransformed event.

Rhino.Render.Decal.TextureInstanceId
Gets the texture ID for this decal.

Rhino.Render.Decal.DecalMapping
Gets the mapping of the decal.

Rhino.Render.Decal.DecalProjection
Gets the decal's projection. Used only when mapping is planar.

Rhino.Render.Decal.MapToInside
Used only when mapping is cylindrical or spherical.
true if texture is mapped to inside of sphere or cylinder, else \e false.

Rhino.Render.Decal.Transparency
Gets the decal's transparency in the range 0 to 1.

Rhino.Render.Decal.Origin
Gets the origin of the decal in world space.

Rhino.Render.Decal.VectorUp
For cylindrical and spherical mapping, the vector is unitized.
Returns: The 'up' vector of the decal. For planar mapping the length of the vector is relevant.

Rhino.Render.Decal.VectorAcross
Gets the vector across. For cylindrical and spherical mapping, the vector is unitized.
The 'across' vector of the decal. For planar mapping the length of the vector is relevant.

Rhino.Render.Decal.Height
Gets the height of the decal. Only used when mapping is cylindrical.

Rhino.Render.Decal.Radius
Gets the radius of the decal. Only used when mapping is cylindrical or spherical.

Rhino.Render.Decal.StartLatitude
Gets the start angle of the decal's arc of latitude or 'horizontal sweep'. This is actually a LONGITUDINAL angle. Only used when mapping is cylindrical or spherical.

Rhino.Render.Decal.EndLatitude
Gets the end angle of the decal's arc of latitude or 'horizontal sweep'. This is actually a LONGITUDINAL angle. Only used when mapping is cylindrical or spherical.

Rhino.Render.Decal.StartLongitude
Gets the start angle of the decal's arc of longitude or 'vertical sweep'. This is actually a LATITUDINAL angle. Only used when mapping is spherical.

Rhino.Render.Decal.EndLongitude
Gets the end angle of the decal's arc of longitude or 'vertical sweep'. This is actually a LATITUDINAL angle. Only used when mapping is spherical.

Rhino.Render.Decal.UVBounds(System.Double@,System.Double@,System.Double@,System.Double@)
The UV bounds of the decal. Only used when mapping is UV.

Rhino.Render.Decal.CustomData
Gets custom data associated with this decal - see Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
Returns: The return value can be null if there is no data associated with this decal.

Rhino.Render.Decal.TryGetColor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Display.Color4f@,Rhino.Geometry.Point2d@)
Blend color with the decal color at a given point.
point: The point in space or, if the decal is uv-mapped, the uv-coordinate of that point.
normal: The face normal of the given point.
colInOut: The color to blend the decal color to.
uvOut: the UV on the texture that the color point was read from.
Returns: true if the given point hits the decal, else false.