Rhino.PersistentSettingsConverter.IsStringList(System.String)
Determines if the string value is formatted as a string list.
s: String to check
Returns:
Returns true if it is a XML string list otherwise return false.

Rhino.PersistentSettingsConverter.IsStringDictionary(System.String)
Determines if the string value is formatted as a key value pair
string list.
s: String to check
Returns:
Returns true if it is a XML key value pair list otherwise return false.

Rhino.PersistentSettingsConverter.TryParseStringList(System.String,System.String[]@)
Attempts to convert a string to a string value list.
s: String to parse
value:
Result will get copied here, if the string is null or empty then this
will be an empty list, if there was an error parsing then this will be
null otherwise it will be the string parsed as a list.
Returns:
Returns true if the string is not empty and properly formatted as a
string list otherwise returns false.

Rhino.PersistentSettingsConverter.ToString(System.String[])
Converts a string array to a properly formatted string list XML string.
values:
List of strings to turn into a string list XML string.
Returns:
Returns a properly formatted XML string that represents the list of
strings.

Rhino.PersistentSettingsConverter.TryParseEnum(System.Type,System.String,System.String@)
Converts an enum value string (integer as string) to
a enum value name.
type: The enum type
intValueAsString: enum integer value as string
value: Output value, will be null on error
Returns:
Returns true if the the successfully converted or false if not.

Rhino.PersistentSettingsConverter.TryParseEnum(System.Type,System.String,System.Int32@)
Converts an enum value name to its integer
equivalent.
type: The enum type
enumValueName: Enum value name as string
value: Output value, will get set to -1 on error
Returns:
Returns true if the the successfully converted or false if not.