Rhino.FileIO.FileWriteOptions.WriteSelectedObjectsOnly
If true, this command should export only the objects currently selected in the Rhino model.

Rhino.FileIO.FileWriteOptions.IncludeRenderMeshes
The file written should include the render meshes if your File Writing Plug-in supports it.

Rhino.FileIO.FileWriteOptions.IncludePreviewImage
The file written should include a preview image if your File Writing Plug-in supports it.

Rhino.FileIO.FileWriteOptions.IncludeBitmapTable
The file written should include the bitmap table if your File Writing Plug-in supports it.

Rhino.FileIO.FileWriteOptions.IncludeHistory
The file written should include history information if your File Writing Plug-In supports it.

Rhino.FileIO.FileWriteOptions.WriteAsTemplate
Write as template

Rhino.FileIO.FileWriteOptions.SuppressDialogBoxes
If true, it means the command has been run with a '-', meaning you should not ask questions during writing. (no dialogs, no "getters", etc.)

Rhino.FileIO.FileWriteOptions.WriteGeometryOnly
If true, the file written should include only geometry File Writing Plug-in supports it.

Rhino.FileIO.FileWriteOptions.WriteUserData
If true, the file written should include User Data if your File Writing Plug-in supports it.