Rhino.Geometry.Morphs.SplopSpaceMorph.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Surface,Rhino.Geometry.Point2d)
Constructs a flow space morph.
plane: Source plane of deformation.
surface: Surface to wrap objects onto.
surfaceParam: U,V parameter on surface used for orienting.

Rhino.Geometry.Morphs.SplopSpaceMorph.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Surface,Rhino.Geometry.Point2d,System.Double)
Constructs a flow space morph.
plane: Source plane of deformation.
surface: Surface to wrap objects onto.
surfaceParam: U,V parameter on surface used for orienting.
scale: Scale factor.

Rhino.Geometry.Morphs.SplopSpaceMorph.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Surface,Rhino.Geometry.Point2d,System.Double,System.Double)
Constructs a flow space morph.
plane: Source plane of deformation.
surface: Surface to wrap objects onto.
surfaceParam: U,V parameter on surface used for orienting.
scale: Scale factor. To ignore, use Rhino.RhinoMath.UnsetValue.
angle: Rotation angle in radians. To ignore, use Rhino.RhinoMath.UnsetValue.

Rhino.Geometry.Morphs.SplopSpaceMorph.IsValid
Returns true if the space morph definition is valid, false otherwise.

Rhino.Geometry.Morphs.SplopSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point.
point: A point that will be morphed by this object.
Returns: Resulting morphed point.

Rhino.Geometry.Morphs.SplopSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.