Rhino.Render.RenderPipeline.#ctor(Rhino.RhinoDoc,Rhino.Commands.RunMode,Rhino.PlugIns.PlugIn,System.Drawing.Size,System.String,Rhino.Render.RenderWindow.StandardChannels,System.Boolean,System.Boolean)
Constructs a subclass of this object on the stack in your Rhino plug-in's Render() or RenderWindow() implementation.
doc: A Rhino document.
mode: A command running mode, such as scripted or interactive.
plugin: A plug-in.
sizeRendering: The width and height of the rendering.
caption: The caption to display in the frame window.
channels: The color channel or channels.
reuseRenderWindow: true if the rendering window should be reused; otherwise, a new one will be instantiated.
clearLastRendering:
true If the last rendering should be removed. Indicates that this
render is being done using RenderQuiet(). It specifically makes sure
the render mesh iterator does not display any progress user interface.

Rhino.Render.RenderPipeline.#ctor(Rhino.RhinoDoc,Rhino.Commands.RunMode,Rhino.PlugIns.PlugIn,System.Drawing.Size,System.String,Rhino.Render.RenderWindow.StandardChannels,System.Boolean,System.Boolean,Rhino.Render.AsyncRenderContext@)
Constructs a subclass of this object on the stack in your Rhino plug-in's Render() or RenderWindow() implementation.
This constructor should be used when a non-blocking RenderWindow is required.
Note that the asynchronous render context will not be used when mode is Scripted.
doc: A Rhino document.
mode: A command running mode, such as scripted or interactive.
plugin: A plug-in.
sizeRendering: The width and height of the rendering.
caption: The caption to display in the frame window.
channels: The color channel or channels.
reuseRenderWindow: true if the rendering window should be reused; otherwise, a new one will be instantiated.
clearLastRendering:
true if the last rendering should be removed. Indicates that this
render is being done using RenderQuiet(). It specifically makes sure
the render mesh iterator does not display any progress user interface.
aRC: The asynchronous render context to set

Rhino.Render.RenderPipeline.SaveImage(System.String,System.Boolean)
Saves the rendered image to a file. Does not prompt the user in any way.
fileName:
Full path to the file name to save to.
saveAlpha:
Determines if alpha will be saved in files that support it (e.g., PNG).
Returns:

Rhino.Render.RenderPipeline.CloseWindow
Closes the render window associated with this render instance.
Returns:
Return true if successful or false if not.

Rhino.Render.RenderPipeline.Render
Call this function to render the scene normally. The function returns when rendering is complete (or cancelled).
Returns: A code that explains how rendering completed.

Rhino.Render.RenderPipeline.RenderSessionId
Get the Id associated with this render session, this is useful when
looking up Rhino.Render.RenderPanels.

Rhino.Render.RenderPipeline.RenderWindow(Rhino.Display.RhinoView,System.Drawing.Rectangle,System.Boolean)
Call this function to render the scene in a view window. The function returns when rendering is complete (or cancelled).
view: the view that the user selected a rectangle in.
rect: rectangle that the user selected.
inWindow: true to render directly into the view window.
Returns: A code that explains how rendering completed.
//TODO - ViewInfo is wrong here

Rhino.Render.RenderPipeline.RenderSize(Rhino.RhinoDoc)
Get the render size as specified in the ON_3dmRenderSettings. Will automatically return the correct size based on the ActiveView or custom settings.
Returns: The render size.

Rhino.Render.RenderPipeline.GetRenderWindow(System.Boolean)
As GetRenderWindow(), but if withWireframeChannel is true
the returned RenderWindow will have the channel added.
withWireframeChannel:
Returns: RenderWindow with wireframe channel enabled, or null
if no RenderWindow can be found (i.e. rendering has completed
already)

Rhino.Render.RenderPipeline.GetRenderWindow
Get the RenderWindow associated with this RenderPipeline instance.
Returns: RenderWindow if one exists, null otherwise (i.e. rendering
has already completed).

Rhino.Render.RenderPipeline.ConfirmationSeconds
Sets the number of seconds that need to elapse during rendering before
the user is asked if the rendered image should be saved.

Rhino.Render.RenderPipeline.SupportsPause
Override and return true if the renderer supports pausing
Returns: true if pausing is supported, false otherwise

Rhino.Render.RenderPipeline.PauseRendering
Implement to pause the current render session

Rhino.Render.RenderPipeline.ResumeRendering
Implement to resume current render session