Rhino.Render.Dithering.#ctor
Create an utility object not associated with any document

Rhino.Render.Dithering.#ctor(Rhino.Render.Dithering)
Create an utility object not associated with any document from another object
d: