Rhino.Geometry.Collections.NurbsSurfaceKnotList.RemoveMultipleKnots(System.Int32,System.Int32,System.Double)
Remove multiple knots from this surface
minimumMultiplicity:
Remove knots with multiplicity >= minimumKnotMultiplicity
maximumMultiplicity:
Remove knots with multiplicity <= maximumKnotMultiplicity
tolerance:
When you remove knots, the shape of the surface is changed.
If tolerance is RhinoMath.UnsetValue, any amount of change is permitted.
If tolerance is >=0, the maximum distance between the input and output
surface is restricted to be <= tolerance.
Returns: number of knots removed on success. 0 if no knots were removed

Rhino.Geometry.Collections.NurbsSurfaceKnotList.RemoveKnots(System.Int32,System.Int32)
Remove knots from the knot vector and adjusts the remaining control points to maintain surface position as closely as possible.
The knots from Knots[index0] through Knots[index1 - 1] will be removed.
index0: The starting knot index, where Degree-1 < index0 < index1 <= Points.Count-1.
index1: The ending knot index, where Degree-1 < index0 < index1 <= Points.Count-1.
Returns: true if successful, false on failure.

Rhino.Geometry.Collections.NurbsSurfaceKnotList.RemoveKnotsAt(System.Double,System.Double)
Remove knots from the surface and adjusts the remaining control points to maintain surface position as closely as possible.
u: The u parameter on the surface that is closest to the knot to be removed.
v: The v parameter on the surface that is closest to the knot to be removed.
Returns: true if successful, false on failure.

Rhino.Geometry.Collections.NurbsSurfaceKnotList.EpsilonEquals(Rhino.Geometry.Collections.NurbsSurfaceKnotList,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns: