Rhino.DocObjects.Tables.BitmapTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.Image.

Rhino.DocObjects.Tables.BitmapTable.FindIndex(System.Int32)
Retrieves a BitmapEntry object based on Index. This seach type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A BitmapEntry object, or null if none was found.

Rhino.DocObjects.Tables.BitmapTable.Find(System.String,System.Boolean,System.String@)
This function first attempts to find the file with "name" on the disk.
If it does find it, "fileName" is set to the full path of the file and
the BitmapEntry returned will be null, even if there was a BitmapEntry
with "name" in the bitmap table.
If the function cannot find the file on the disk, it searches the bitmap
table.  If it finds it, the returned BitmapEntry entry will be the entry
in the table with that name.
Additionally, if "createFile" is true, and an entry is found, the file
will be written to the disk and it's full path will be contained in "fileName".
name:
Name of the file to search for including file extension.
createFile:
If this is true, and the file is not found on the disk but is found in
the BitmapTable, then the BitmapEntry will get saved to the Rhino bitmap
file cache and fileName will contain the full path to the cached file.
fileName:
The full path to the current location of this file or an empty string
if the file was not found and/or not extracted successfully.
Returns:
Returns null if "name" was found on the disk.  If name was not found on the disk,
returns the BitmapEntry with the specified name if it is found in the bitmap table
and null if it was not found in the bitmap table.

Rhino.DocObjects.Tables.BitmapTable.Delete(Rhino.DocObjects.BitmapEntry)
Removes the bitmap from the table.
item: The item to remove. Null will always return false.
Returns: True if the item could be deleted; otherwise, false.