Rhino.Runtime.InteropWrappers.SimpleArrayInt.#ctor(System.Collections.Generic.IEnumerable{System.Int32})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayInt class
values: initial set of integers to add to the array