Rhino.Runtime.InteropWrappers.RhinoDib.ToBitmap(System.IntPtr,System.Boolean)
Convert unmanged CRhinoDib pointer to a System.Drawing bitmap.
Returns:
If the pointer to the CRhinoDib is null then null is returned otherwise;
if the CRhinoDib is valid then the DIB is converted to a System.Drawing.Bitmap
otherwise null is returned.
rhinoDibPointer:
Unmanged CRhinoDib pointer
deletePointer:
If set to true delete the unmanged pointer otherwise;
don't delete the pointer.

Rhino.Runtime.InteropWrappers.RhinoDib.Attach(System.IntPtr,System.Boolean)
Create a new RhinoDib and attach it to the specified CRhinoDib pointer.
rhinoDibPointer:
Unmanged CRhinoDib pointer to attach to.
deletePointer:
If set to true delete the unmanged pointer when the returned RhinoDib
is disposed of otherwise; don't delete the unmanaged pointer.

Rhino.Runtime.InteropWrappers.RhinoDib.#ctor(System.IntPtr,System.Boolean)
Initializes a new instance of the Rhino.Runtime.InteropWrappers.RhinoDib
class and attache it to a unmanged CRhinoDib pointer.
rhinoDibPointer:
Unmanged CRhinoDib pointer to attach to.
autoDelete:
If set to true delete the unmanged pointer when this object
is disposed of otherwise; don't delete the unmanaged pointer.