Rhino.Render.ChangeQueue.GroundPlane.IsShadowOnly
Get true if ground plane should be shadow-only

Rhino.Render.ChangeQueue.GroundPlane.Altitude
Get the altitude for ground plane

Rhino.Render.ChangeQueue.GroundPlane.MaterialId
The CRC / RenderHash of the material on this ground plane

Rhino.Render.ChangeQueue.GroundPlane.TextureScale
Get texture scale on the ground plane

Rhino.Render.ChangeQueue.GroundPlane.TextureOffset
Get texture offset on the ground plane

Rhino.Render.ChangeQueue.GroundPlane.TextureRotation
Get texture rotation on the ground plane

Rhino.Render.ChangeQueue.GroundPlane.Enabled
Return true if ground plane is enabled

Rhino.Render.ChangeQueue.GroundPlane.Crc
Get the checksum of this groundplane object