Rhino.ApplicationSettings.ModelAidSettingsState.NudgeKeyStep
Gets or sets the nudge step amount.

Rhino.ApplicationSettings.ModelAidSettingsState.CtrlNudgeKeyStep
Gets or sets the Ctrl-key based nudge step amount.

Rhino.ApplicationSettings.ModelAidSettingsState.ShiftNudgeKeyStep
Gets or sets the Shift-key based nudge step amount.