Rhino.Geometry.Vector2d.op_Multiply(Rhino.Geometry.Vector2d,System.Double)
Multiplies a vector by a number, having the effect of scaling it.
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinatewise multiplied by t.

Rhino.Geometry.Vector2d.op_Multiply(System.Double,Rhino.Geometry.Vector2d)
Multiplies a vector by a number, having the effect of scaling it.
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinatewise multiplied by t.

Rhino.Geometry.Vector2d.Multiply(Rhino.Geometry.Vector2d,System.Double)
Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinatewise multiplied by t.

Rhino.Geometry.Vector2d.Multiply(System.Double,Rhino.Geometry.Vector2d)
Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinatewise multiplied by t.

Rhino.Geometry.Vector2d.op_Division(Rhino.Geometry.Vector2d,System.Double)
Divides a Rhino.Geometry.Vector2d by a number, having the effect of shrinking it.
vector: A vector.
t: A number.
Returns: A new vector that is componentwise divided by t.

Rhino.Geometry.Vector2d.Divide(Rhino.Geometry.Vector2d,System.Double)
Divides a Rhino.Geometry.Vector2d by a number, having the effect of shrinking it.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is componentwise divided by t.

Rhino.Geometry.Vector2d.op_Addition(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Sums up two vectors.
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the componentwise addition of the two vectors.

Rhino.Geometry.Vector2d.Add(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the componentwise addition of the two vectors.

Rhino.Geometry.Vector2d.op_Subtraction(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Subtracts the second vector from the first one.
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the componentwise difference of vector1 - vector2.

Rhino.Geometry.Vector2d.Subtract(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Subtracts the second vector from the first one.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the componentwise difference of vector1 - vector2.

Rhino.Geometry.Vector2d.op_Multiply(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Multiplies two vectors together, returning the dot product (or inner product).
vector1: A vector.
vector2: A second vector.
Returns:
A value that results from the evaluation of v1.X*v2.X + v1.Y*v2.Y.
This value equals v1.Length * v2.Length * cos(alpha), where alpha is the angle between vectors.

Rhino.Geometry.Vector2d.Multiply(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Multiplies two vectors together, returning the dot product (or inner product).
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns:
A value that results from the evaluation of v1.X*v2.X + v1.Y*v2.Y.
This value equals v1.Length * v2.Length * cos(alpha), where alpha is the angle between vectors.

Rhino.Geometry.Vector2d.op_UnaryNegation(Rhino.Geometry.Vector2d)
Computes the opposite vector.
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.

Rhino.Geometry.Vector2d.Negate(Rhino.Geometry.Vector2d)
Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.

Rhino.Geometry.Vector2d.EpsilonEquals(Rhino.Geometry.Vector2d,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:

Rhino.Geometry.Vector2d.IsValid
Gets a value indicating whether this vector is valid.
A valid vector must be formed of valid component values for x, y and z.

Rhino.Geometry.Vector2d.IsTiny(System.Double)
Determines whether a vector is very short.
tolerance:
A nonzero value used as the coordinate zero tolerance.
.
Returns: (Math.Abs(X) <= tiny_tol) AND (Math.Abs(Y) <= tiny_tol) AND (Math.Abs(Z) <= tiny_tol).

Rhino.Geometry.Vector2d.IsTiny
Uses RhinoMath.ZeroTolerance for IsTiny calculation.
Returns: true if vector is very small, otherwise false.

Rhino.Geometry.Vector2d.Unitize
Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Returns: true on success or false on failure.