Rhino.ApplicationSettings.ModelAidSettings.NudgeKeyStep
Gets or sets the nudge step amount.

Rhino.ApplicationSettings.ModelAidSettings.CtrlNudgeKeyStep
Gets or sets the Ctrl-key based nudge step amount.

Rhino.ApplicationSettings.ModelAidSettings.ShiftNudgeKeyStep
Gets or sets the Shift-key based nudge step amount.