TaskTypeListBuilder
TaskTypeListBuilder class that wraps the CRhRdkTaskTypeListBuilder class

TaskTypeListBuilder.#ctor(InstanceIdArray,Rhino.Render.RenderContentKind)
TaskTypeListBuilder constructor

TaskTypeListBuilder.Finalize
TaskTypeListBuilder destructor

TaskTypeListBuilder.Dispose
TaskTypeListBuilder dispose

TaskTypeListBuilder.Dispose(System.Boolean)
TaskTypeListBuilder dispose

TaskTypeListBuilder.Build(Rhino.Render.RenderContentCollection)
Builds the list in the target
Returns: returns the required text width.