Rhino.FileIO.FileObjReadOptions.UseObjObjects
Determines whether or not "o"s in the obj file
will be interpreted as objects in the Rhino model
Remarks:
If UseObjGsAs is OBJGroupsAsObjects this value is ignored.

Rhino.FileIO.FileObjReadOptions.MapYtoZ
Setting to transform OBJ's Y axis to Rhino's Z axis

Rhino.FileIO.FileObjReadOptions.MorphTargetOnly
TODO

Rhino.FileIO.FileObjReadOptions.ReverseGroupOrder
Determines how groups/layers are nested when reading an obj file.
Left to Right (default = false) or Right to Left (true)

Rhino.FileIO.FileObjReadOptions.IgnoreTextures
Determines whether textures are read from the .mtl file, if it exists.

Rhino.FileIO.FileObjReadOptions.#ctor(Rhino.FileIO.FileReadOptions)
readOptions:

Rhino.FileIO.FileObjReadOptions.GetTransform
Calculates the YToZ transform.
Returns: