Rhino.FileIO.File3dmObjectTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.ModelGeometry.

Rhino.FileIO.File3dmObjectTable.FindByLayer(System.String)
Finds all File3dmObject that are in a given layer.
layer: Layer to search.
Returns:
Array of objects that belong to the specified layer or empty array if no objects could be found.

Rhino.FileIO.File3dmObjectTable.FindByLayer(Rhino.DocObjects.Layer)
Finds all File3dmObject that are in a given layer.
layer: A layer instance.
Returns: Array of objects that belong to the specified layer or empty array if no objects could be found.
Throws System.ArgumentNullException: If layer is null.

Rhino.FileIO.File3dmObjectTable.Add(Rhino.FileIO.File3dmObject)
Duplicates the object, then adds a copy of the object to the document.
item: The item to duplicate and add.

Rhino.FileIO.File3dmObjectTable.AddExtrusion(Rhino.Geometry.Extrusion)
Adds an extrusion object to Rhino.
extrusion: A duplicate of this extrusion is added to Rhino.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.AddExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes)
Adds an extrusion object to Rhino.
extrusion: A duplicate of this extrusion is added to Rhino.
attributes: Attributes to link to the object.
Returns: A unique identifier for the object.

Rhino.FileIO.File3dmObjectTable.Delete(System.Guid)
Deletes object from document.
objectId: Id of the object to delete.
Returns: true on success, false on failure.

Rhino.FileIO.File3dmObjectTable.Delete(System.Collections.Generic.IEnumerable{System.Guid})
Deletes a collection of objects from the document.
objectIds: Ids of all objects to delete.
Returns: The number of successfully deleted objects.