Rhino.Geometry.Intersect.MeshClash.MeshA
Gets the first mesh.

Rhino.Geometry.Intersect.MeshClash.MeshB
Gets the second mesh.

Rhino.Geometry.Intersect.MeshClash.ClashPoint
If valid, then the sphere centered at ClashPoint of ClashRadius
distance interesects the clashing meshes.

Rhino.Geometry.Intersect.MeshClash.ClashRadius
Gets the clash, or intersection, radius.

Rhino.Geometry.Intersect.MeshClash.Search(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double,System.Int32)
Searches for locations where the distance from a mesh in one set of meshes
is less than distance to another mesh in a second set of meshes.
setA: The first set of meshes.
setB: The second set of meshes.
distance: The largest distance at which there is a clash.
All values smaller than this cause a clash as well.
maxEventCount: The maximum number of clash objects.
Returns: An array of clash objects.

Rhino.Geometry.Intersect.MeshClash.Search(Rhino.Geometry.Mesh,System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double,System.Int32)
Searches the locations where the distance from the first mesh to a mesh in the second set of meshes
is less than the provided value.
meshA: The first mesh.
setB: The second set of meshes.
distance: The largest distance at which there is a clash.
All values smaller than this cause a clash as well.
maxEventCount: The maximum number of clash objects.
Returns: An array of clash objects.

Rhino.Geometry.Intersect.MeshClash.Search(Rhino.Geometry.Mesh,Rhino.Geometry.Mesh,System.Double,System.Int32)
Searches the locations where the distance from the first mesh to the second mesh
is less than the provided value.
meshA: The first mesh.
meshB: The second mesh.
distance: The largest distance at which there is a clash.
All values smaller than this cause a clash as well.
maxEventCount: The maximum number of clash objects.
Returns: An array of clash objects.