Rhino.Runtime.LicenseManager.GetLicenseCallback
Delegate passed to rhcommon_c as a call back function pointer
title:
License description string
id:
License type id
productBuildType:
path:
Full path to module which we are getting a license for, will check
module for the required digital signatures.
validator:
A pointer to the CRhinoLicenseValidator associated with this call, this
object contains the ValidateProductKey method used by the Zoo Client to
validate key values.
Returns:
Returns a value of 1 on success or 0 on failure.