Rhino.DocObjects.MaterialRefCreateParams.PlugInId
Identifies a rendering plug-in

Rhino.DocObjects.MaterialRefCreateParams.MaterialSource
Determines if the simple material should come from the object or from
it's layer.

Rhino.DocObjects.MaterialRefCreateParams.FrontFaceMaterialId
The Id of the Material used to render the front of an object.

Rhino.DocObjects.MaterialRefCreateParams.FrontFaceMaterialIndex
The index of the material used to render the front of an object

Rhino.DocObjects.MaterialRefCreateParams.BackFaceMaterialId
The Id of the Material used to render the back of an object.

Rhino.DocObjects.MaterialRefCreateParams.BackFaceMaterialIndex
The index of the material used to render the back of an object