Rhino.DocObjects.Texture.FileName
Gets or sets a file name that is used by this texture.
NOTE: We are moving away from string-based FileName, and suggest
the usage of the new FileReference class.
Also, this filename may well not be a path that makes sense
on a user's computer because it was a path initially set on
a different user's computer. If you want to get a workable path
for this user, use the BitmapTable.Find function using this
property.

Rhino.DocObjects.Texture.FileReference
Gets or sets a copy of the file reference that is used by this texture.
Remarks: After the get or the set method complete,
you own the copy you received or passed in, and can Dispose() of it.

Rhino.DocObjects.Texture.TextureType
Controls how the pixels in the bitmap are interpreted

Rhino.DocObjects.Texture.MappingChannelId


Rhino.DocObjects.Texture.TextureCombineMode
Determines how this texture is combined with others in a material's
texture list.

Rhino.DocObjects.Texture.WrapU
Texture wrapping mode in the U direction

Rhino.DocObjects.Texture.WrapV
Texture wrapping mode in the V direction

Rhino.DocObjects.Texture.WrapW
Texture wrapping mode in the W direction

Rhino.DocObjects.Texture.ApplyUvwTransform
If true then the UVW transform is applied to the texture
otherwise the UVW transform is ignored.

Rhino.DocObjects.Texture.UvwTransform
Transform to be applied to each instance of this texture
if ApplyUvw is true

Rhino.DocObjects.Texture.GetAlphaBlendValues(System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)
If the TextureCombineMode is Blend, then the blending function
for alpha is determined by
new alpha = constant
+ a0*(current alpha)
+ a1*(texture alpha)
+ a2*min(current alpha,texture alpha)
+ a3*max(current alpha,texture alpha)
constant:
a0:
a1:
a2:
a3:

Rhino.DocObjects.Texture.SetAlphaBlendValues(System.Double,System.Double,System.Double,System.Double,System.Double)
If the TextureCombineMode is Blend, then the blending function
for alpha is determined by
new alpha = constant
+ a0*(current alpha)
+ a1*(texture alpha)
+ a2*min(current alpha,texture alpha)
+ a3*max(current alpha,texture alpha)
constant:
a0:
a1:
a2:
a3:

Rhino.DocObjects.Texture.SetRGBBlendValues(System.Drawing.Color,System.Double,System.Double,System.Double,System.Double)
If the TextureCombineMode is Blend, then the blending function
for RGB is determined by
new rgb = colorcolor
+ a0[0]*(current RGB)
+ a1[1]*(texture RGB)
+ a2[2]*min(current RGB,texture RGB)
+ a3[3]*max(current RGB,texture RGB)
color:
a0:
a1:
a2:
a3: