Rhino.Render.UI.UserInterfaceSection.RenderContent
The RenderContent object that created this user interface object.

Rhino.Render.UI.UserInterfaceSection.Window
The user control associated with this user interface object.

Rhino.Render.UI.UserInterfaceSection.FromWindow(System.Object)
Find the UserInterfaceSection that created the specified instance of a
window.
window:
If window is not null then look for the UserInterfaceSection that
created the window.
Returns:
If a UserInterfaceSection object is found containing a reference to
the requested window then return the object otherwise return null.

Rhino.Render.UI.UserInterfaceSection.GetContentList
Returns a list of currently selected content items to be edited.
Returns: Returns a list of currently selected content items to be edited.

Rhino.Render.UI.UserInterfaceSection.Show(System.Boolean)
Show or hide this content section.
visible: If true then show the content section otherwise hide it.

Rhino.Render.UI.UserInterfaceSection.Expand(System.Boolean)
Expand or collapse this content section.
expand: If true then expand the content section otherwise collapse it.