Rhino.Geometry.InstanceDefinitionGeometry.ComponentType
Returns Rhino.DocObjects.ModelComponentType.InstanceDefinition.

Rhino.Geometry.InstanceDefinitionGeometry.GetObjectIds
list of object ids in the instance geometry table
Returns: