Rhino.Geometry.MeshThicknessMeasurement.#ctor(System.Int32,System.Int32,System.Double,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Create a new thickness measurement.
meshIndex: Index of mesh within collection of meshes.
vertexIndex: Index of mesh vertex.
thickness: Thickness of mesh at vertex.
point: Vertex location.
oppositePoint: Opposite location.

Rhino.Geometry.MeshThicknessMeasurement.MeshIndex
Gets the index of the mesh associated with this thickness measurement.

Rhino.Geometry.MeshThicknessMeasurement.VertexIndex
Gets the index of the vertex associated with this thickness measurement.

Rhino.Geometry.MeshThicknessMeasurement.Thickness
Gets the local thickness of the mesh.

Rhino.Geometry.MeshThicknessMeasurement.Point
Gets the location of the thickness measurement.

Rhino.Geometry.MeshThicknessMeasurement.OppositePoint
Gets the point opposite to the measurement point.