Rhino.Geometry.BrepVertex.Brep
Gets the Brep that owns this vertex.

Rhino.Geometry.BrepVertex.VertexIndex
Gets the index of this vertex in the Brep.Vertices collection.

Rhino.Geometry.BrepVertex.EdgeIndices
Gets the indices of all edges associated with this vertex.
Returns: Empty array on failure.