Rhino.Runtime.CommonObject.ConstructConstObject(System.Object,System.Int32)
Assigns a parent object and a subobject index to this.
parentObject: The parent object.
subobjectIndex: The subobject index.

Rhino.Runtime.CommonObject.Disposed
Indicates if this object has been disposed or the
document it originally belonged to has been disposed.