Rhino.Input.Custom.GetObject.CustomGeometryFilter(Rhino.DocObjects.RhinoObject,Rhino.Geometry.GeometryBase,Rhino.Geometry.ComponentIndex)
Checks geometry to see if it can be selected.
Override to provide fancy filtering.
rhObject: parent object being considered.
geometry: geometry being considered.
componentIndex:
if >= 0, geometry is a proper sub-part of object->Geometry() with componentIndex.
Returns:
The default returns true unless you've set a custom geometry filter. If a custom
filter has been set, that delegate is called.
Remarks: The delegate should not throw exceptions. If an exception is thrown, a message box will show and
the filter will be disabled.

Rhino.Input.Custom.GetObject.InactiveDetailPickEnabled
By default, objects in inactive details are not permitted to be picked.
In a few rare cases this is used (ex. picking circles during DimRadius)

Rhino.Input.Custom.GetObject.EnableUnselectObjectsOnExit(System.Boolean)
By default any objects in the object list are unselected when GetObject.GetObjects()
exits with any return code besides Object. If you want to leave the objects
selected when non-object input is returned, then call EnableUnselectObjectsOnExit(false)
before calling GetObjects().
enable: The state to set.