Rhino.Render.ChangeQueue.Light.Id
Get the light object id

Rhino.Render.ChangeQueue.Light.IdCrc
Get CRC computed from Id

Rhino.Render.ChangeQueue.Light.Data
Get the actual light data

Rhino.Render.ChangeQueue.Light.ChangeType
Get what type of light change this represents