Rhino.Geometry.Cone.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Initializes a new cone with a specified base plane, height and radius.
plane: Base plane of cone.  The apex of the cone is at the plane's origin.
height: Height of cone.
radius: Radius of cone.

Rhino.Geometry.Cone.Plane
Gets or sets the base plane of the cone.  The apex of the cone is at the plane's origin.

Rhino.Geometry.Cone.EpsilonEquals(Rhino.Geometry.Cone,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns: