Rhino.Render.RenderMaterial.StandardChildSlots
Defines enumerated constant values for use in Rhino.Render.RenderMaterial.TextureChildSlotName(Rhino.Render.RenderMaterial.StandardChildSlots) method.

Rhino.Render.RenderMaterial.StandardChildSlots.Diffuse
Corresponds to ON_Texture::TYPE::bitmap_texture.

Rhino.Render.RenderMaterial.StandardChildSlots.Transparency
Corresponds to ON_Texture::transparancy_texture.

Rhino.Render.RenderMaterial.StandardChildSlots.Bump
Corresponds to ON_Texture::TYPE::bump_texture.

Rhino.Render.RenderMaterial.StandardChildSlots.Environment
Corresponds to ON_Texture::TYPE::emap_texture.