Rhino.UI.Fonts.GetUiFont(Rhino.UI.Fonts.Style,Rhino.UI.Fonts.Size)
GetUiFont provides access to a set of unmanaged fonts used by Rhino.
style: Normal, Bold, Italic
size: One of several preset enumerable sizes
Returns:

Rhino.UI.Fonts.NormalFont
Returns the normal font used for dialog boxes and buttons.

Rhino.UI.Fonts.HeadingFont
Returns a font used for dialog headings. 1.2x the size of NormalFont.

Rhino.UI.Fonts.BoldHeadingFont
Returns a font that is 1.2x NormalFont and Bold

Rhino.UI.Fonts.TitleFont
Returns a font used for dialog titles. 2x the size of NormalFont, and bold.

Rhino.UI.Fonts.SmallFont
Returns a font use for small text in dialog boxes. 0.8x the size of NormalFont.