Rhino.Render.RenderWindow.Channel.PixelSize
Returns the size of the data in one pixel in the channel. For RDK standard channels, this value is always sizeof(float).
For the special chanRGBA collective channel,
this value is 4 * sizeof(float).
Returns: The size of a pixel.

Rhino.Render.RenderWindow.Channel.SetValue(System.Int32,System.Int32,System.Single)
If x or y are out of range, the function will fail and may crash Rhino.
x: The horizontal pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
y: the vertical pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
value: The value to store in the channel at the specified position.

Rhino.Render.RenderWindow.Channel.SetValues(System.Drawing.Rectangle,System.Drawing.Size,Rhino.Render.PixelBuffer)
Set a pixel buffer
rectangle:
bufferResolution:
colorBuffer: PixelBuffer to a color buffer of floats in RGBA format.

Rhino.Render.RenderWindow.Channel.SetValue(System.Int32,System.Int32,Rhino.Display.Color4f)
If x or y are out of range, the function will fail and may crash Rhino.
x: The horizontal pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
y: The vertical pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
value: The color to store in the channel at the specified position.

Rhino.Render.RenderWindow.Channel.AddValue(System.Int32,System.Int32,Rhino.Display.Color4f)
Add value to existing values at point x, y.
If x or y are out of range, the function will fail and may crash Rhino.
x: The horizontal pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
y: The vertical pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
value: The color to store in the channel at the specified position.