Rhino.UI.Controls.CollapsibleSectionViewModel.#ctor(Rhino.UI.Controls.ICollapsibleSection)
Construct from your section - the view model should be a member of the section
section:

Rhino.UI.Controls.CollapsibleSectionViewModel.GetData(System.Guid,System.Boolean,System.Boolean)
Call for an interface to data
uuidDataType:
bForWrite:
bAutoChangeBracket:
Returns:

Rhino.UI.Controls.CollapsibleSectionViewModel.Commit(System.Guid)
uuidDataType:

Rhino.UI.Controls.CollapsibleSectionViewModel.Discard(System.Guid)
uuidDataType:

Rhino.UI.Controls.CollapsibleSectionViewModel.UndoHelper(System.String)
Helper function to ease the use of undo records
description:
Returns: Return the undo record

Rhino.UI.Controls.CollapsibleSectionViewModel.CppPointer
