Rhino.Render.RenderTexture.NewBitmapTexture(Rhino.Render.SimulatedTexture)
Constructs a new basic texture from a SimulatedTexture.
texture: The texture to create the basic texture from.
Returns: A new render texture.

Rhino.Render.RenderTexture.RenderHashWithoutLocalMapping
Render hash for texture excluding local mapping.

Rhino.Render.RenderTexture.LocalMappingTransform
Gets the transformation that can be applied to the UVW vector to convert it
from normalized texture space into locally mapped space (ie - with repeat,
offset and rotation applied.)

Rhino.Render.RenderTexture.PixelSize(System.Int32@,System.Int32@,System.Int32@)
Get the texture dimensions for the RenderTexture.
u: width
v: height
w: depth, used for 3D textures

Rhino.Render.RenderTexture.CreateEvaluator(Rhino.Render.RenderTexture.TextureEvaluatorFlags)
Constructs a texture evaluator. This is an independent lightweight object
capable of evaluating texture color throughout uvw space. May be called
from within a rendering shade pipeline.
Returns: A texture evaluator instance.

Rhino.Render.RenderTexture.CreateEvaluator
Constructs a texture evaluator. This is an independent lightweight object
capable of evaluating texture color throughout uvw space. May be called
from within a rendering shade pipeline.
Returns: A texture evaluator instance.

Rhino.Render.RenderTexture.GetRepeat
Get repeat value across UVW space. If the projection type is WCS or
other type specified in model units, then this is the repeat across 1
meter of the model.
Returns:

Rhino.Render.RenderTexture.SetRepeat(Rhino.Geometry.Vector3d,Rhino.Render.RenderContent.ChangeContexts)
Set repeat value across UVW space. If the projection type is WCS or
other type specified in model units, then this is the repeat across 1
meter of the model.
value:
changeContext:

Rhino.Render.RenderTexture.GetOffset
Get offset value across UVW space. If the projection type is WCS or
other type specified in model units, then this is the offset in meters.
Returns:

Rhino.Render.RenderTexture.SetOffset(Rhino.Geometry.Vector3d,Rhino.Render.RenderContent.ChangeContexts)
Set offset value across UVW space. If the projection type is WCS or
other type specified in model units, then this is the offset in meters.
value:
changeContext:

Rhino.Render.RenderTexture.GetRotation
Returns: