Rhino.UI.Panels.IsShowing(Rhino.UI.ShowPanelReason)
Check to see if reason is equal to any of the hide events
reason:
Returns:

Rhino.UI.Panels.IsHiding(Rhino.UI.ShowPanelReason)
Check to see if reason is equal to any of the show events
reason:
Returns:

Rhino.UI.Panels.RegisterPanel(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon)
You typically register your panel class in your plug-in's OnLoad
function.  This will register your custom call with Rhino, Rhino will
create an instance of your class the first time your panel is created
and embed this instance of your class in a panel container.
plugin: Plug-in this panel is associated with
panelType:
Class type to construct when a panel is shown.  If your class is
derived from Eto.Forms.Control it will work on both the Mac and
Windows version of Rhino.  In addition Windows Rhino will support any
class types that implement the IWin32Window interface or that are
derived from System.Windows.FrameworkElement.  Mac Rhino will also
support classes that are derived from NsView.  In addition to the
type requirements the class must have a public constructor with no
parameters or a constructor with a single uint that represents the
document serial number and and have a GuidAttribute applied with a
unique Id.  n Windows there is only one panel created which gets
recycled for each new document.  On the Mac a panel will be created
for each open document and destroyed when the document closes.  In
certain situations in Mac Rhino a a panel may get created and
destroyed multiple times when opening/closing a panel while editing a
document.
caption:
Displays in the panel tab on Windows or at the top of the modeless
window on Mac.
icon:
Currently only used in Windows, use a 32bit depth icon in order to
get proper transparency.

Rhino.UI.Panels.ChangePanelIcon(System.Type,System.Drawing.Icon)
Update the icon used for a panel tab.
panelType:
icon: New icon to use

Rhino.UI.Panels.GetPanel(System.Guid)
Will return an instance of a .Net panel if the panel has been
displayed at least once.  Panel instances are not created until a
panel is displayed.
panelId:
Class Id of the panel to search for.
Returns:
Returns the one and only instance of a panel if it has been properly
registered and displayed at least once.  If the panel has never been
displayed then null will be returned even if the panel is properly
registered.

Rhino.UI.Panels.GetPanel``1
Return an instance of a .Net panel
Returns:

Rhino.UI.Panels.GetPanel(System.Guid,System.UInt32)
Will return an instance of a .Net panel if the panel has been
displayed at least once.  Panel instances are not created until a
panel is displayed.
panelId:
Class Id of the panel to search for.
documentSerialNumber:
Runtime document Id associated with the requested panel.
Returns:
Returns the one and only instance of a panel if it has been properly
registered and displayed at least once.  If the panel has never been
displayed then null will be returned even if the panel is properly
registered.

Rhino.UI.Panels.GetPanel``1(System.UInt32)
Return an instance of a .Net panel
documentSerialNumber:
Runtime document Id associated with the requested panel.
Returns:

Rhino.UI.Panels.GetPanel(System.Guid,Rhino.RhinoDoc)
Will return an instance of a .Net panel if the panel has been
displayed at least once.  Panel instances are not created until a
panel is displayed.
panelId:
Class Id of the panel to search for.
rhinoDoc:
Runtime document Id associated with the requested panel.
Returns:
Returns the one and only instance of a panel if it has been properly
registered and displayed at least once.  If the panel has never been
displayed then null will be returned even if the panel is properly
registered.

Rhino.UI.Panels.GetPanel``1(Rhino.RhinoDoc)
Return an instance of a .Net panel
rhinoDoc:
Runtime document Id associated with the requested panel.
Returns:

Rhino.UI.Panels.IsPanelVisible(System.Guid,System.Boolean)
Check to see if a panel is currently visible, on Windows this means
you can see the tab, it does not necessarily mean it is the current
tab.
panelId:
Class Id for the panel to check.
isSelectedTab:
Is the currently selected tab.
Returns:
Returns true if the tab is visible otherwise it returns false.

Rhino.UI.Panels.IsPanelVisible(System.Type,System.Boolean)
Check to see if a panel is currently visible, on Windows this means
you can see the tab, it does not necessarily mean it is the current
tab.
panelType:
Type of panel to check for, this type must include a GUID attribute.
isSelectedTab:
Class Id for the panel to check.
Returns:
Returns true if panelType is non null and the tab is visible otherwise
it returns false.

Rhino.UI.Panels.IsPanelVisible(System.Guid)
Check to see if a panel is currently visible, on Windows this means
you can see the tab, it does not necessarily mean it is the current
tab.
panelId:
Class Id for the panel to check.
Returns:
Returns true if the tab is visible otherwise it returns false.

Rhino.UI.Panels.IsPanelVisible(System.Type)
Check to see if a panel is currently visible, on Windows this means
you can see the tab, it does not necessarily mean it is the current
tab.
panelType:
Type of panel to check for, this type must include a GUID attribute.
Returns:
Returns true if panelType is non null and the tab is visible otherwise
it returns false.

Rhino.UI.Panels.OpenPanelAsSibling(System.Guid,System.Guid)
In Mac Rhino this will currently just call OpenPanel, in Windows Rhino
this will look for a dock bar which contains the sibling panel and add
this panel to that dock bar as necessary, if the panel was in another
dock bar it will be moved to this dock bar.
panelId:
The class Id of the panel type to open.
siblingPanelId:
The class Id of the sibling panel.
Returns:
Returns true if the panel was successfully opened.

Rhino.UI.Panels.OpenPanelAsSibling(System.Guid,System.Guid,System.Boolean)
In Mac Rhino this will currently just call OpenPanel, in Windows Rhino
this will look for a dock bar which contains the sibling panel and add
this panel to that dock bar as necessary, if the panel was in another
dock bar it will be moved to this dock bar.
panelId:
The class Id of the panel type to open.
siblingPanelId:
The class Id of the sibling panel.
makeSelectedPanel:
If true then the panel is set as the active tab after opening it
otherwise; the panel is opened but not set as the active tab.
Returns:
Returns true if the panel was successfully opened.

Rhino.UI.Panels.OpenPanel(System.Guid)
Open the specified panel in its current or default location and if it
is in a dock bar containing more than one tab, make it the current tab.
panelId:
Class type Id for the panel to open.

Rhino.UI.Panels.OpenPanel(System.Guid,System.Boolean)
Open the specified panel in its current or default location and if it
is in a dock bar containing more than one tab, make it the current tab.
panelId:
Class type Id for the panel to open.
makeSelectedPanel:
If true then the panel is set as the active tab after opening it
otherwise; the panel is opened but not set as the active tab.

Rhino.UI.Panels.OpenPanel(System.Type)
Open the specified panel in its current or default location and if it
is in a dock bar containing more than one tab, make it the current tab.
panelType:
Class type of the panel to open.

Rhino.UI.Panels.OpenPanel(System.Type,System.Boolean)
Open the specified panel in its current or default location and if it
is in a dock bar containing more than one tab, make it the current tab.
panelType:
Class type of the panel to open.
makeSelectedPanel:
If true then the panel is set as the active tab after opening it
otherwise; the panel is opened but not set as the active tab.

Rhino.UI.Panels.OpenPanel(System.Guid,System.Guid)
In Mac Rhino this will just call the version of OpenPanel that takes
a class type Id.  In Windows Rhino this will look for a dock bar with
the specified Id and open or move the specified panel to that dock
bar.
dockBarId:
Id of the dock bar hosting one or more panels.
panelId:
Class type Id for the panel to open.
Returns:
Returns true if the

Rhino.UI.Panels.OpenPanel(System.Guid,System.Guid,System.Boolean)
In Mac Rhino this will just call the version of OpenPanel that takes
a class type Id.  In Windows Rhino this will look for a dock bar with
the specified Id and open or move the specified panel to that dock
bar.
dockBarId:
Id of the dock bar hosting one or more panels.
panelId:
Class type Id for the panel to open.
makeSelectedPanel:
If true then the panel is set as the active tab after opening it
otherwise; the panel is opened but not set as the active tab.
Returns:
Returns true if the

Rhino.UI.Panels.OpenPanel(System.Guid,System.Type)
In Mac Rhino this will just call the version of OpenPanel that takes
a class type Id.  In Windows Rhino this will look for a dock bar with
the specified Id and open or move the specified panel to that dock
bar.
dockBarId:
Id of the dock bar hosting one or more panels.
panelType:
Class type for the panel to open.
Returns:
Returns true if the

Rhino.UI.Panels.OpenPanel(System.Guid,System.Type,System.Boolean)
In Mac Rhino this will just call the version of OpenPanel that takes
a class type Id.  In Windows Rhino this will look for a dock bar with
the specified Id and open or move the specified panel to that dock
bar.
dockBarId:
Id of the dock bar hosting one or more panels.
panelType:
Class type for the panel to open.
makeSelectedPanel:
If true then the panel is set as the active tab after opening it
otherwise; the panel is opened but not set as the active tab.
Returns:
Returns true if the

Rhino.UI.Panels.PanelDockBar(System.Guid)
Will always return Guid.Emty in Mac Rhino.  In Windows Rhino it will
look for the dock bar which contains the specified panel class Id and
return the dock bar Id.
panelId:
Panel class Id for of the panel to look for.
Returns:
Always returns Guid.Empty on Mac Rhino.  On Windows Rhino it will
return the Id for the dock bar which host the specified panel or
Guid.Empty if the panel is not currently visible.

Rhino.UI.Panels.PanelDockBar(System.Type)
Will always return Guid.Emty in Mac Rhino.  In Windows Rhino it will
look for the dock bar which contains the specified panel class Id and
return the dock bar Id.
panelType:
Panel class for of the panel to look for.
Returns:
Always returns Guid.Empty on Mac Rhino.  On Windows Rhino it will
return the Id for the dock bar which host the specified panel or
Guid.Empty if the panel is not currently visible.

Rhino.UI.Panels.ClosePanel(System.Guid)
Will close or hide the specified panel type, in Windows Rhino, if it
is the only visible tab the tab dock bar will be closed as well.  In
Mac Rhino it will always close the modeless dialog hosting the panel.
panelId:
Class type Id of the panel to close.

Rhino.UI.Panels.ClosePanel(System.Type)
Will close or hide the specified panel type, in Windows Rhino, if it
is the only visible tab the tab dock bar will be closed as well.  In
Mac Rhino it will always close the modeless dialog hosting the panel.
panelType:
Class type of the panel to close.

Rhino.UI.Panels.GetOpenPanelIds
Get a list of the currently open panel tabs in Windows Rhino, on Mac
Rhino it will be a list of the currently visible modeless panel
dialogs.
Returns:
Returns an array of panel class Id's for the currently open panels,
if there are no open panels it will be an empty array.

Rhino.UI.Panels.OnShowPanel(System.Guid,System.UInt32,System.Boolean)
Call this method to raise the Show event
panelId:
documentSerialNumber: The document associated with the shown/hidden panel.
show:

Rhino.UI.Panels.Show
This event is called when a panel is shown or hidden.  This event will get raised
multipThis times when the active document changes in Mac Rhino.  It will called
with show equal to false for the prevous active document and with show equal to
true for the current document.  When the event is raised with show equal to false
it only means the document instace of the panel is not visible it does not mean
the panel host has been closed.  If you need to know when the panel host closes
then subsribe to the Closed event.

Rhino.UI.Panels.OnClosePanel(System.Guid,System.UInt32)
Call this method to raise the Closed event
panelId: Panel identifier.
documentSerialNumber: The document associated with the closed panel.

Rhino.UI.Panels.Closed
This event is raised when a panel host is closed