Rhino.DocObjects.Tables.LightTable.Sun
Gets the Sun instance that is applied to the document.
If the RDK is loaded, an instance is always returned.
Throws Rhino.Runtime.RdkNotLoadedException: If the RDK is not loaded.

Rhino.DocObjects.Tables.LightTable.FindName(System.String)
Finds the LightObject with a given name.
Deleted lights have no name.
name: Name to search.
Returns:
A layer. If no layer is found, null is returned.

Rhino.DocObjects.Tables.LightTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a LightObject given its name hash.
nameHash: The name hash of the LightObject to be searched.
Returns: A LightObject, or null on error.

Rhino.DocObjects.Tables.LightTable.FindIndex(System.Int32)
Retrieves a  object based on Index. This seach type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A  object, or null if none was found.

Rhino.DocObjects.Tables.LightTable.Modify(System.Guid,Rhino.Geometry.Light)
