Rhino.Input.StringParserSettings.DefaultParseSettings
- The default settings parse just about everything in
a reasonable way.
- Any angle values with unspecified units will be
treated as radians. Angles without units can be
encountered while parsing formulas, lengths and
points and need to be thoughtfully considered in
most parsing situations.

Rhino.Input.StringParserSettings.ParseSettingsRadians
- The default settings parse just about everything in
a reasonable way.
- Any angle values with unspecified units will be
treated as radians.Angles without units can be
encountered while parsing formulas, lengths and
points and need to be thoughtfully considered in
most parsing situations.

Rhino.Input.StringParserSettings.ParseSettingsDegrees
- The default settings parse just about everything in
a reasonable way.
- Any angle values with unspecified units will be
treated as degrees.Angles without units can be
encountered while parsing formulas, lengths and
points and need to be thoughtfully considered in
most parsing situations.

Rhino.Input.StringParserSettings.ParseSettingsIntegerNumber
- The integer settings parse and optional unary + or unary - and
then parses one or more digits.Parsing stops after the last digit.

Rhino.Input.StringParserSettings.ParseSettingsRationalNumber
- The rational number settings parse and optional unary + or unary -
and then parse one or more digits.If a rational number fraction
bar follows the last digit in the numerator, then it is parsed
and an integer denominator is parsed.The denominator cannot
have a unary + or - preceding the digits.Parsing stops after
the last digit in the denominator.

Rhino.Input.StringParserSettings.ParseSettingsDoubleNumber
- The double number settings parse and optional unary + or unary -
and then parse a number that can be integer, decimal, or
scientific e notation.

Rhino.Input.StringParserSettings.ParseSettingsRealNumber
- The real number settings parse and optional unary + or unary -
and then parse a number that can be integer, decimal,
scientific e notation or pi.

Rhino.Input.StringParserSettings.ParseSettingsEmpty
- ON_ParseSetting::FalseSettings has all parsing options
set to false.
- A common use of ON_ParseSettings FalseSettings is to intialize
ON_ParseSettings classes that are used to report what happened
during parsing.Any parsing results value set to true after
parsing indicates that type of parsing occured.