Rhino.Geometry.BezierCurve.Split(System.Double,Rhino.Geometry.BezierCurve@,Rhino.Geometry.BezierCurve@)
Divides the Bezier curve at the specified parameter.
t: parameter must satisfy 0 < t < 1
left:
right:
Returns: true on success

Rhino.Geometry.BezierCurve.CreateBeziers(Rhino.Geometry.Curve)
Create an array of Bezier curves that fit to an existing curve. Please note, these
Beziers can be of any order and may be rational.
sourceCurve: The curve to fit Beziers to
Returns: A new array of Bezier curves