Rhino.FileIO.FileObjWriteOptions.VertexWelding
Determines how/if vertexes of the mesh in Rhino will be modified in the output
Remarks:
The actual values of any vertex, normal or texture coordinate are not modified, this setting
determines whether they are duplicated or merged.

Rhino.FileIO.FileObjWriteOptions.VertexWelding.Unwelded
Each face gets it's own vertex, and normal and tc if they exist, in the output