Rhino.Render.ChangeQueue.Material.MeshInstanceId
Get the material InstanceAncestry

Rhino.Render.ChangeQueue.Material.Id
Get the material ID (crc)

Rhino.Render.ChangeQueue.Material.MeshIndex
Get mesh index