Rhino.Geometry.Dimension.GetTextTransform(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.DimensionStyle,System.Double,System.Boolean)
Get the transform for this text object's text geometry
viewport:
style:
textScale:
drawForward:

Rhino.Geometry.Dimension.TextPosition
Gets and sets the position of text on the plane.

Rhino.Geometry.Dimension.NumericValue
Gets the numeric value (or measurement), depending on geometry type.
LinearDimension: distance between arrow tips
RadialDimension: radius or diamater depending on type
AngularDimension: angle in degrees