Rhino.NodeInCode.Components.NodeInCodeFunctions
Returns a collection with all component functions.

Rhino.NodeInCode.Components.FindComponent(System.String)
Finds a component given its full name.
fullName: The name, including its library name and a period if it is made by a third-party.