Rhino.Render.CustomRenderMeshProvider.#ctor
Default constructor

Rhino.Render.CustomRenderMeshProvider.Name
The name of the provider for UI display.

Rhino.Render.CustomRenderMeshProvider.WillBuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,Rhino.RhinoDoc,System.Guid,System.Boolean)
Determines if custom render meshes will be built for a particular object.
vp: The viewport being rendered.
obj: The Rhino object of interest.  This can be null in the case where document meshes (not associated with any object) are being requested.
doc: The Rhino document of interest.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
preview: Type of mesh to build.
Returns: true if custom meshes will be built.

Rhino.Render.CustomRenderMeshProvider.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.RhinoDoc,Rhino.Render.RenderPrimitiveList,System.Guid,System.Boolean)
Build custom render mesh(es).
vp: The viewport being rendered.
doc: The Rhino document of interest.  This can be null in the case where document meshes (not associated with any object) are being requested.
objMeshes: The meshes class to populate with custom meshes.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
meshType: Type of mesh to build.
Returns: true if operation was successful.

Rhino.Render.CustomRenderMeshProvider.RegisterProviders(System.Reflection.Assembly,System.Guid)
Call this method once from your plug-ins OnLoad override for each
assembly containing a custom mesh provider.  Only publicly exported
classes derived from CustomRenderMeshProvider with a public constructor
that has no parameters will get registered.
assembly:
Assembly to search for valid CustomRenderMeshProvider derived classes.
pluginId:
The plug-in that owns the custom mesh providers.

Rhino.Render.CustomRenderMeshProvider.AllObjectsChanged
Call this method if your render meshes change.

Rhino.Render.CustomRenderMeshProvider.AllObjectsChanged(Rhino.RhinoDoc)
Call this method if your render meshes change.

Rhino.Render.CustomRenderMeshProvider.ObjectChanged(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject)
obj:
doc:

Rhino.Render.CustomRenderMeshProvider.DocumentBasedMeshesChanged(Rhino.RhinoDoc)
doc:

Rhino.Render.CustomRenderMeshProvider.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,Rhino.RhinoDoc,System.Guid,System.Boolean)
Returns a bounding box for the custom render meshes for the given object.
vp: The viewport being rendered.
obj: The Rhino object of interest.  This can be null in the case where document meshes (not associated with any object) are being requested.
doc: The Rhino document of interest.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
preview: Type of mesh to build.
Returns: A bounding box value.